[NoCoverage] StringLiteral
services/course/services/lo-tree.ts:28:87
   type Tutorial
 } from "@tutors/tutors-model-lib";
 
-export function decorateCourseTree(course: Course, courseId: string = "", courseUrl = "") {
+export function decorateCourseTree(course: Course, courseId: string = "", courseUrl = "Stryker was here!") {
   // define course properties
   course.courseId = courseId;

[Killed] StringLiteral
services/course/services/lo-tree.ts:32:18
   // define course properties
   course.courseId = courseId;
   course.courseUrl = courseUrl;
-  course.route = `/course/${courseId}`;
+  course.route = ``;
 
   // retrieve all Los in course
killedBy: decorateCourseTree() WHEN decorating a course should set course route
statusReason: expected '' to be '/course/test-course' // Object.is equality

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:40:34
   // inject course path into all routes
   injectCourseUrl(allLos, courseId, courseUrl);
   // remove all los with type = "web"
-  allLos = allLos.filter((lo) => lo.type !== "web");
+  allLos = allLos.filter((lo) => false);
 
   removeUnknownLos(course.los);
killedBy: decorateCourseTree() WHEN decorating a course should index the course itself in loIndex
statusReason: expected undefined to be defined

[Killed] EqualityOperator
services/course/services/lo-tree.ts:40:34
   // inject course path into all routes
   injectCourseUrl(allLos, courseId, courseUrl);
   // remove all los with type = "web"
-  allLos = allLos.filter((lo) => lo.type !== "web");
+  allLos = allLos.filter((lo) => lo.type === "web");
 
   removeUnknownLos(course.los);
killedBy: decorateCourseTree() WHEN decorating a course should index the course itself in loIndex
statusReason: expected undefined to be defined

[Killed] ArrowFunction
services/course/services/lo-tree.ts:48:18
 
   // index all Los in course
   course.loIndex = new Map<string, Lo>();
-  allLos.forEach((lo) => course.loIndex.set(lo.route, lo));
+  allLos.forEach(() => undefined);
   const videoLos = allVideoLos(allLos);
   videoLos.forEach((lo) => course.loIndex.set(lo.video, lo));
killedBy: decorateCourseTree() WHEN decorating a course should index the course itself in loIndex
statusReason: expected undefined to be defined

[Survived] ArrowFunction
services/course/services/lo-tree.ts:50:20
   course.loIndex = new Map<string, Lo>();
   allLos.forEach((lo) => course.loIndex.set(lo.route, lo));
   const videoLos = allVideoLos(allLos);
-  videoLos.forEach((lo) => course.loIndex.set(lo.video, lo));
+  videoLos.forEach(() => undefined);
   course.topicIndex = new Map<string, Topic>();
   //course.los.forEach((lo) => course.topicIndex.set(lo.route, lo as Topic));

[Killed] ArrowFunction
services/course/services/lo-tree.ts:54:20
   course.topicIndex = new Map<string, Topic>();
   //course.los.forEach((lo) => course.topicIndex.set(lo.route, lo as Topic));
   const topicLos = filterByType(allLos, "topic");
-  topicLos.forEach((lo) => course.topicIndex.set(lo.route, lo as Topic));
+  topicLos.forEach(() => undefined);
 
   loadPropertyFlags(course);
killedBy: Course Service Integration Tests Feature: Course State Management WHEN readTopic is called shall update currentLo to the topic when found
statusReason: expected undefined to be defined

[Killed] EqualityOperator
services/course/services/lo-tree.ts:71:7
   // define breadcrump - path to all parent Los
   lo.breadCrumbs = [];
   crumbs(lo, lo.breadCrumbs);
-  if (lo.breadCrumbs?.length > 2) {
+  if (lo.breadCrumbs?.length <= 2) {
     if (lo.breadCrumbs[1].type === "unit" || lo.breadCrumbs[1].type === "side") {
       lo.breadCrumbs[1].route = lo.breadCrumbs[1].route.replace("topic", "course");
killedBy: Course Service Integration Tests Feature: Course Loading WHEN a user navigates to /course/{courseId} the Tutors Reader shall fetch tutors.json from the course URL
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:71:7
   // define breadcrump - path to all parent Los
   lo.breadCrumbs = [];
   crumbs(lo, lo.breadCrumbs);
-  if (lo.breadCrumbs?.length > 2) {
+  if (true) {
     if (lo.breadCrumbs[1].type === "unit" || lo.breadCrumbs[1].type === "side") {
       lo.breadCrumbs[1].route = lo.breadCrumbs[1].route.replace("topic", "course");
killedBy: Course Service Integration Tests Feature: Course Loading WHEN a user navigates to /course/{courseId} the Tutors Reader shall fetch tutors.json from the course URL
statusReason: Cannot read properties of undefined (reading 'type')

[NoCoverage] EqualityOperator
services/course/services/lo-tree.ts:72:9
   lo.breadCrumbs = [];
   crumbs(lo, lo.breadCrumbs);
   if (lo.breadCrumbs?.length > 2) {
-    if (lo.breadCrumbs[1].type === "unit" || lo.breadCrumbs[1].type === "side") {
+    if (lo.breadCrumbs[1].type !== "unit" || lo.breadCrumbs[1].type === "side") {
       lo.breadCrumbs[1].route = lo.breadCrumbs[1].route.replace("topic", "course");
     }

[NoCoverage] EqualityOperator
services/course/services/lo-tree.ts:72:46
   lo.breadCrumbs = [];
   crumbs(lo, lo.breadCrumbs);
   if (lo.breadCrumbs?.length > 2) {
-    if (lo.breadCrumbs[1].type === "unit" || lo.breadCrumbs[1].type === "side") {
+    if (lo.breadCrumbs[1].type === "unit" || lo.breadCrumbs[1].type !== "side") {
       lo.breadCrumbs[1].route = lo.breadCrumbs[1].route.replace("topic", "course");
     }

[NoCoverage] StringLiteral
services/course/services/lo-tree.ts:73:65
   crumbs(lo, lo.breadCrumbs);
   if (lo.breadCrumbs?.length > 2) {
     if (lo.breadCrumbs[1].type === "unit" || lo.breadCrumbs[1].type === "side") {
-      lo.breadCrumbs[1].route = lo.breadCrumbs[1].route.replace("topic", "course");
+      lo.breadCrumbs[1].route = lo.breadCrumbs[1].route.replace("", "course");
     }
   }

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:78:7
   }
 
   // Convert contentMd to html
-  if (lo.type !== "lab" && lo.type !== "note") {
+  if (true) {
     // Convert labs & note on demmand as can be time consuming to convert all at once
     convertLoToHtml(course, lo);
killedBy: decorateLoTree() - Advanced Tests WHEN processing breadcrumbs shall replace topic with course in side breadcrumbs
statusReason: Input data should be a String

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:78:7
   }
 
   // Convert contentMd to html
-  if (lo.type !== "lab" && lo.type !== "note") {
+  if (true && lo.type !== "note") {
     // Convert labs & note on demmand as can be time consuming to convert all at once
     convertLoToHtml(course, lo);
killedBy: decorateLoTree() - Advanced Tests WHEN processing composite learning objects shall set parent references for nested children
statusReason: Input data should be a String

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:83:7
     convertLoToHtml(course, lo);
   }
 
-  if (isCompositeLo(lo)) {
+  if (false) {
     // if Lo is composite, recursively decorate all child los
     const compositeLo = lo as Composite;
killedBy: decorateLoTree() - Advanced Tests WHEN processing composite learning objects shall set parent references for nested children
statusReason: expected undefined to be { type: 'topic', …(6) } // Object.is equality

[Survived] ConditionalExpression
services/course/services/lo-tree.ts:83:7
     convertLoToHtml(course, lo);
   }
 
-  if (isCompositeLo(lo)) {
+  if (true) {
     // if Lo is composite, recursively decorate all child los
     const compositeLo = lo as Composite;

[Survived] OptionalChaining
services/course/services/lo-tree.ts:92:10
     compositeLo.toc = [];
     compositeLo.toc.push(
       // eslint-disable-next-line no-unsafe-optional-chaining
-      ...compositeLo?.panels?.panelVideos,
+      ...compositeLo.panels?.panelVideos,
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.panels?.panelTalks,

[Survived] OptionalChaining
services/course/services/lo-tree.ts:92:10
     compositeLo.toc = [];
     compositeLo.toc.push(
       // eslint-disable-next-line no-unsafe-optional-chaining
-      ...compositeLo?.panels?.panelVideos,
+      ...compositeLo?.panels.panelVideos,
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.panels?.panelTalks,

[Survived] OptionalChaining
services/course/services/lo-tree.ts:94:10
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.panels?.panelVideos,
       // eslint-disable-next-line no-unsafe-optional-chaining
-      ...compositeLo?.panels?.panelTalks,
+      ...compositeLo.panels?.panelTalks,
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.panels?.panelNotes,

[Survived] OptionalChaining
services/course/services/lo-tree.ts:94:10
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.panels?.panelVideos,
       // eslint-disable-next-line no-unsafe-optional-chaining
-      ...compositeLo?.panels?.panelTalks,
+      ...compositeLo?.panels.panelTalks,
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.panels?.panelNotes,

[Survived] OptionalChaining
services/course/services/lo-tree.ts:96:10
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.panels?.panelTalks,
       // eslint-disable-next-line no-unsafe-optional-chaining
-      ...compositeLo?.panels?.panelNotes,
+      ...compositeLo?.panels.panelNotes,
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.units?.units,

[Survived] OptionalChaining
services/course/services/lo-tree.ts:96:10
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.panels?.panelTalks,
       // eslint-disable-next-line no-unsafe-optional-chaining
-      ...compositeLo?.panels?.panelNotes,
+      ...compositeLo.panels?.panelNotes,
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.units?.units,

[Survived] OptionalChaining
services/course/services/lo-tree.ts:98:10
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.panels?.panelNotes,
       // eslint-disable-next-line no-unsafe-optional-chaining
-      ...compositeLo?.units?.units,
+      ...compositeLo.units?.units,
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.units?.standardLos,

[Survived] OptionalChaining
services/course/services/lo-tree.ts:98:10
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.panels?.panelNotes,
       // eslint-disable-next-line no-unsafe-optional-chaining
-      ...compositeLo?.units?.units,
+      ...compositeLo?.units.units,
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.units?.standardLos,

[Survived] OptionalChaining
services/course/services/lo-tree.ts:100:10
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.units?.units,
       // eslint-disable-next-line no-unsafe-optional-chaining
-      ...compositeLo?.units?.standardLos,
+      ...compositeLo.units?.standardLos,
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.units?.sides

[Survived] OptionalChaining
services/course/services/lo-tree.ts:100:10
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.units?.units,
       // eslint-disable-next-line no-unsafe-optional-chaining
-      ...compositeLo?.units?.standardLos,
+      ...compositeLo?.units.standardLos,
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.units?.sides

[Survived] OptionalChaining
services/course/services/lo-tree.ts:102:10
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.units?.standardLos,
       // eslint-disable-next-line no-unsafe-optional-chaining
-      ...compositeLo?.units?.sides
+      ...compositeLo?.units.sides
     );
 

[Survived] OptionalChaining
services/course/services/lo-tree.ts:102:10
       // eslint-disable-next-line no-unsafe-optional-chaining
       ...compositeLo?.units?.standardLos,
       // eslint-disable-next-line no-unsafe-optional-chaining
-      ...compositeLo?.units?.sides
+      ...compositeLo.units?.sides
     );
 

[Killed] BlockStatement
services/course/services/lo-tree.ts:105:44
       ...compositeLo?.units?.sides
     );
 
-    for (const childLo of compositeLo.los) {
-      childLo.parentLo = lo;
-      if (compositeLo.los) {
-        decorateLoTree(course, childLo);
-      }
-    }
+    for (const childLo of compositeLo.los) {}
   }
 }
killedBy: decorateLoTree() - Advanced Tests WHEN processing composite learning objects shall set parent references for nested children
statusReason: expected undefined to be { type: 'topic', …(9) } // Object.is equality

[Survived] BlockStatement
services/course/services/lo-tree.ts:107:28
 
     for (const childLo of compositeLo.los) {
       childLo.parentLo = lo;
-      if (compositeLo.los) {
-        decorateLoTree(course, childLo);
-      }
+      if (compositeLo.los) {}
     }
   }

[Survived] ConditionalExpression
services/course/services/lo-tree.ts:107:11
 
     for (const childLo of compositeLo.los) {
       childLo.parentLo = lo;
-      if (compositeLo.los) {
+      if (false) {
         decorateLoTree(course, childLo);
       }

[Killed] BlockStatement
services/course/services/lo-tree.ts:116:32
 
 export function injectCourseUrl(los: Lo[], id: string, url: string) {
   los.forEach((lo) => {
-    if (lo.type === "archive") {
-      const archive: Archive = lo as Archive;
-      archive.route = `https://${lo.route?.replace("/archive/{{COURSEURL}}", url)}/${archive.archiveFile}`;
-    } else {
+    if (lo.type === "archive") {} else {
       lo.route = lo.route?.replace("{{COURSEURL}}", id);
     }
killedBy: injectCourseUrl() WHEN processing archive routes should construct full archive URL with domain
statusReason: expected '/archive/{{COURSEURL}}' to be 'https://test-course.netlify.app/cours…' // Object.is equality

[Killed] EqualityOperator
services/course/services/lo-tree.ts:116:9
 
 export function injectCourseUrl(los: Lo[], id: string, url: string) {
   los.forEach((lo) => {
-    if (lo.type === "archive") {
+    if (lo.type !== "archive") {
       const archive: Archive = lo as Archive;
       archive.route = `https://${lo.route?.replace("/archive/{{COURSEURL}}", url)}/${archive.archiveFile}`;
killedBy: injectCourseUrl() WHEN processing learning object routes should replace {{COURSEURL}} placeholder in routes
statusReason: expected 'https:///topic/{{COURSEURL}}/intro/un…' to be '/topic/test-course/intro' // Object.is equality

[Survived] OptionalChaining
services/course/services/lo-tree.ts:118:34
   los.forEach((lo) => {
     if (lo.type === "archive") {
       const archive: Archive = lo as Archive;
-      archive.route = `https://${lo.route?.replace("/archive/{{COURSEURL}}", url)}/${archive.archiveFile}`;
+      archive.route = `https://${lo.route.replace("/archive/{{COURSEURL}}", url)}/${archive.archiveFile}`;
     } else {
       lo.route = lo.route?.replace("{{COURSEURL}}", id);

[Killed] StringLiteral
services/course/services/lo-tree.ts:118:52
   los.forEach((lo) => {
     if (lo.type === "archive") {
       const archive: Archive = lo as Archive;
-      archive.route = `https://${lo.route?.replace("/archive/{{COURSEURL}}", url)}/${archive.archiveFile}`;
+      archive.route = `https://${lo.route?.replace("", url)}/${archive.archiveFile}`;
     } else {
       lo.route = lo.route?.replace("{{COURSEURL}}", id);
killedBy: injectCourseUrl() WHEN processing archive routes should construct full archive URL with domain
statusReason: expected 'https://test-course.netlify.app/archi…' to be 'https://test-course.netlify.app/cours…' // Object.is equality

[Killed] BlockStatement
services/course/services/lo-tree.ts:119:12
     if (lo.type === "archive") {
       const archive: Archive = lo as Archive;
       archive.route = `https://${lo.route?.replace("/archive/{{COURSEURL}}", url)}/${archive.archiveFile}`;
-    } else {
-      lo.route = lo.route?.replace("{{COURSEURL}}", id);
-    }
+    } else {}
 
     lo.img = lo.img?.replace("{{COURSEURL}}", url);
killedBy: injectCourseUrl() WHEN processing learning object routes should replace {{COURSEURL}} placeholder in routes
statusReason: expected '/topic/{{COURSEURL}}/intro' to be '/topic/test-course/intro' // Object.is equality

[Survived] OptionalChaining
services/course/services/lo-tree.ts:120:18
       const archive: Archive = lo as Archive;
       archive.route = `https://${lo.route?.replace("/archive/{{COURSEURL}}", url)}/${archive.archiveFile}`;
     } else {
-      lo.route = lo.route?.replace("{{COURSEURL}}", id);
+      lo.route = lo.route.replace("{{COURSEURL}}", id);
     }
 

[Killed] OptionalChaining
services/course/services/lo-tree.ts:123:14
       lo.route = lo.route?.replace("{{COURSEURL}}", id);
     }
 
-    lo.img = lo.img?.replace("{{COURSEURL}}", url);
+    lo.img = lo.img.replace("{{COURSEURL}}", url);
     lo.video = lo.video?.replace("{{COURSEURL}}", id);
     if (lo.type == "talk" || lo.type == "paneltalk") {
killedBy: injectCourseUrl() WHEN processing learning object routes should replace {{COURSEURL}} placeholder in routes
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] OptionalChaining
services/course/services/lo-tree.ts:124:16
     }
 
     lo.img = lo.img?.replace("{{COURSEURL}}", url);
-    lo.video = lo.video?.replace("{{COURSEURL}}", id);
+    lo.video = lo.video.replace("{{COURSEURL}}", id);
     if (lo.type == "talk" || lo.type == "paneltalk") {
       const talk = lo as Talk;
killedBy: injectCourseUrl() WHEN processing learning object routes should replace {{COURSEURL}} placeholder in routes
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] StringLiteral
services/course/services/lo-tree.ts:124:34
     }
 
     lo.img = lo.img?.replace("{{COURSEURL}}", url);
-    lo.video = lo.video?.replace("{{COURSEURL}}", id);
+    lo.video = lo.video?.replace("", id);
     if (lo.type == "talk" || lo.type == "paneltalk") {
       const talk = lo as Talk;
killedBy: injectCourseUrl() WHEN processing learning object routes should replace {{COURSEURL}} in video paths
statusReason: expected 'test-coursehttps://{{COURSEURL}}/vide…' to be 'https://test-course/videos/intro.mp4' // Object.is equality

[Killed] EqualityOperator
services/course/services/lo-tree.ts:125:30
 
     lo.img = lo.img?.replace("{{COURSEURL}}", url);
     lo.video = lo.video?.replace("{{COURSEURL}}", id);
-    if (lo.type == "talk" || lo.type == "paneltalk") {
+    if (lo.type == "talk" || lo.type != "paneltalk") {
       const talk = lo as Talk;
       talk.pdf = talk.pdf?.replace("{{COURSEURL}}", url);
killedBy: injectCourseUrl() WHEN processing talk PDFs should handle paneltalk PDF paths
statusReason: expected 'https://{{COURSEURL}}/panel.pdf' to be 'https://test-course.netlify.app/panel…' // Object.is equality

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:125:9
 
     lo.img = lo.img?.replace("{{COURSEURL}}", url);
     lo.video = lo.video?.replace("{{COURSEURL}}", id);
-    if (lo.type == "talk" || lo.type == "paneltalk") {
+    if (false) {
       const talk = lo as Talk;
       talk.pdf = talk.pdf?.replace("{{COURSEURL}}", url);
killedBy: injectCourseUrl() WHEN processing talk PDFs should replace {{COURSEURL}} in talk PDF paths
statusReason: expected 'https://{{COURSEURL}}/talks/intro.pdf' to be 'https://test-course.netlify.app/talks…' // Object.is equality

[Survived] OptionalChaining
services/course/services/lo-tree.ts:127:18
     lo.video = lo.video?.replace("{{COURSEURL}}", id);
     if (lo.type == "talk" || lo.type == "paneltalk") {
       const talk = lo as Talk;
-      talk.pdf = talk.pdf?.replace("{{COURSEURL}}", url);
+      talk.pdf = talk.pdf.replace("{{COURSEURL}}", url);
     }
     if (lo.type === "tutorial") {

[Killed] BlockStatement
services/course/services/lo-tree.ts:129:33
       const talk = lo as Talk;
       talk.pdf = talk.pdf?.replace("{{COURSEURL}}", url);
     }
-    if (lo.type === "tutorial") {
-      const tutorial = lo as Tutorial;
-      if (tutorial.pdf) {
-        tutorial.pdf = tutorial.pdf?.replace("{{COURSEURL}}", url);
-      }
-    }
+    if (lo.type === "tutorial") {}
     if (lo.type == "lab") {
       const lab = lo as Lab;
killedBy: injectCourseUrl() WHEN processing lab and tutorial PDFs should replace {{COURSEURL}} in tutorial PDF paths
statusReason: expected 'https://{{COURSEURL}}/tutorials/tut1.…' to be 'https://test-course.netlify.app/tutor…' // Object.is equality

[Killed] EqualityOperator
services/course/services/lo-tree.ts:129:9
       const talk = lo as Talk;
       talk.pdf = talk.pdf?.replace("{{COURSEURL}}", url);
     }
-    if (lo.type === "tutorial") {
+    if (lo.type !== "tutorial") {
       const tutorial = lo as Tutorial;
       if (tutorial.pdf) {
killedBy: injectCourseUrl() WHEN processing lab and tutorial PDFs should replace {{COURSEURL}} in tutorial PDF paths
statusReason: expected 'https://{{COURSEURL}}/tutorials/tut1.…' to be 'https://test-course.netlify.app/tutor…' // Object.is equality

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:131:11
     }
     if (lo.type === "tutorial") {
       const tutorial = lo as Tutorial;
-      if (tutorial.pdf) {
+      if (false) {
         tutorial.pdf = tutorial.pdf?.replace("{{COURSEURL}}", url);
       }
killedBy: injectCourseUrl() WHEN processing lab and tutorial PDFs should replace {{COURSEURL}} in tutorial PDF paths
statusReason: expected 'https://{{COURSEURL}}/tutorials/tut1.…' to be 'https://test-course.netlify.app/tutor…' // Object.is equality

[Killed] BlockStatement
services/course/services/lo-tree.ts:131:25
     }
     if (lo.type === "tutorial") {
       const tutorial = lo as Tutorial;
-      if (tutorial.pdf) {
-        tutorial.pdf = tutorial.pdf?.replace("{{COURSEURL}}", url);
-      }
+      if (tutorial.pdf) {}
     }
     if (lo.type == "lab") {
killedBy: injectCourseUrl() WHEN processing lab and tutorial PDFs should replace {{COURSEURL}} in tutorial PDF paths
statusReason: expected 'https://{{COURSEURL}}/tutorials/tut1.…' to be 'https://test-course.netlify.app/tutor…' // Object.is equality

[Survived] OptionalChaining
services/course/services/lo-tree.ts:132:24
     if (lo.type === "tutorial") {
       const tutorial = lo as Tutorial;
       if (tutorial.pdf) {
-        tutorial.pdf = tutorial.pdf?.replace("{{COURSEURL}}", url);
+        tutorial.pdf = tutorial.pdf.replace("{{COURSEURL}}", url);
       }
     }

[Killed] EqualityOperator
services/course/services/lo-tree.ts:135:9
         tutorial.pdf = tutorial.pdf?.replace("{{COURSEURL}}", url);
       }
     }
-    if (lo.type == "lab") {
+    if (lo.type != "lab") {
       const lab = lo as Lab;
       lab.pdf = lab.pdf?.replace("{{COURSEURL}}", url);
killedBy: injectCourseUrl() WHEN processing lab and tutorial PDFs should replace {{COURSEURL}} in lab PDF paths
statusReason: expected 'https://{{COURSEURL}}/labs/lab1.pdf' to be 'https://test-course.netlify.app/labs/…' // Object.is equality

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:135:9
         tutorial.pdf = tutorial.pdf?.replace("{{COURSEURL}}", url);
       }
     }
-    if (lo.type == "lab") {
+    if (false) {
       const lab = lo as Lab;
       lab.pdf = lab.pdf?.replace("{{COURSEURL}}", url);
killedBy: injectCourseUrl() WHEN processing lab and tutorial PDFs should replace {{COURSEURL}} in lab PDF paths
statusReason: expected 'https://{{COURSEURL}}/labs/lab1.pdf' to be 'https://test-course.netlify.app/labs/…' // Object.is equality

[Survived] OptionalChaining
services/course/services/lo-tree.ts:137:17
     }
     if (lo.type == "lab") {
       const lab = lo as Lab;
-      lab.pdf = lab.pdf?.replace("{{COURSEURL}}", url);
+      lab.pdf = lab.pdf.replace("{{COURSEURL}}", url);
     }
 

[Killed] BlockStatement
services/course/services/lo-tree.ts:145:31
   });
 }
 
-function localizePath(lo: Lo) {
-  if (courseProtocol.value === "http://") {
-    lo.route = lo.route?.replace("https://", "http://");
-    lo.video = lo.video?.replace("https://", "http://");
-    lo.img = lo.img?.replace("https://", "http://");
-    if (lo.pdf) {
-      lo.pdf = lo?.pdf?.replace("https://", "http://");
-    }
-  }
-}
+function localizePath(lo: Lo) {}
 
 /**
killedBy: injectCourseUrl() - Protocol Handling WHEN courseProtocol is http:// shall convert https:// URLs to http://
statusReason: expected 'https://test.com/img.png' to contain 'http://'

[Killed] BlockStatement
services/course/services/lo-tree.ts:146:43
 }
 
 function localizePath(lo: Lo) {
-  if (courseProtocol.value === "http://") {
-    lo.route = lo.route?.replace("https://", "http://");
-    lo.video = lo.video?.replace("https://", "http://");
-    lo.img = lo.img?.replace("https://", "http://");
-    if (lo.pdf) {
-      lo.pdf = lo?.pdf?.replace("https://", "http://");
-    }
-  }
+  if (courseProtocol.value === "http://") {}
 }
 
killedBy: injectCourseUrl() - Protocol Handling WHEN courseProtocol is http:// shall convert https:// URLs to http://
statusReason: expected 'https://test.com/img.png' to contain 'http://'

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:146:7
 }
 
 function localizePath(lo: Lo) {
-  if (courseProtocol.value === "http://") {
+  if (true) {
     lo.route = lo.route?.replace("https://", "http://");
     lo.video = lo.video?.replace("https://", "http://");
killedBy: injectCourseUrl() WHEN processing learning object routes should replace {{COURSEURL}} in image paths
statusReason: expected 'http://test-course.netlify.app/img/lo…' to be 'https://test-course.netlify.app/img/l…' // Object.is equality

[Survived] OptionalChaining
services/course/services/lo-tree.ts:147:16
 
 function localizePath(lo: Lo) {
   if (courseProtocol.value === "http://") {
-    lo.route = lo.route?.replace("https://", "http://");
+    lo.route = lo.route.replace("https://", "http://");
     lo.video = lo.video?.replace("https://", "http://");
     lo.img = lo.img?.replace("https://", "http://");

[Survived] StringLiteral
services/course/services/lo-tree.ts:147:46
 
 function localizePath(lo: Lo) {
   if (courseProtocol.value === "http://") {
-    lo.route = lo.route?.replace("https://", "http://");
+    lo.route = lo.route?.replace("https://", "");
     lo.video = lo.video?.replace("https://", "http://");
     lo.img = lo.img?.replace("https://", "http://");

[Killed] OptionalChaining
services/course/services/lo-tree.ts:148:16
 function localizePath(lo: Lo) {
   if (courseProtocol.value === "http://") {
     lo.route = lo.route?.replace("https://", "http://");
-    lo.video = lo.video?.replace("https://", "http://");
+    lo.video = lo.video.replace("https://", "http://");
     lo.img = lo.img?.replace("https://", "http://");
     if (lo.pdf) {
killedBy: Course Service Integration Tests Feature: Course Loading WHEN a user navigates to /course/{courseId} shall fetch with correct protocol when courseProtocol is set
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] OptionalChaining
services/course/services/lo-tree.ts:149:14
   if (courseProtocol.value === "http://") {
     lo.route = lo.route?.replace("https://", "http://");
     lo.video = lo.video?.replace("https://", "http://");
-    lo.img = lo.img?.replace("https://", "http://");
+    lo.img = lo.img.replace("https://", "http://");
     if (lo.pdf) {
       lo.pdf = lo?.pdf?.replace("https://", "http://");
killedBy: Course Service Integration Tests Feature: Course Loading WHEN a user navigates to /course/{courseId} shall fetch with correct protocol when courseProtocol is set
statusReason: Cannot read properties of undefined (reading 'replace')

[Survived] StringLiteral
services/course/services/lo-tree.ts:149:30
   if (courseProtocol.value === "http://") {
     lo.route = lo.route?.replace("https://", "http://");
     lo.video = lo.video?.replace("https://", "http://");
-    lo.img = lo.img?.replace("https://", "http://");
+    lo.img = lo.img?.replace("", "http://");
     if (lo.pdf) {
       lo.pdf = lo?.pdf?.replace("https://", "http://");

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:150:9
     lo.route = lo.route?.replace("https://", "http://");
     lo.video = lo.video?.replace("https://", "http://");
     lo.img = lo.img?.replace("https://", "http://");
-    if (lo.pdf) {
+    if (false) {
       lo.pdf = lo?.pdf?.replace("https://", "http://");
     }
killedBy: injectCourseUrl() - Protocol Handling WHEN courseProtocol is http:// shall convert https:// URLs to http://
statusReason: expected 'https://{{COURSEURL}}/doc.pdf' to contain 'http://'

[Killed] BlockStatement
services/course/services/lo-tree.ts:150:17
     lo.route = lo.route?.replace("https://", "http://");
     lo.video = lo.video?.replace("https://", "http://");
     lo.img = lo.img?.replace("https://", "http://");
-    if (lo.pdf) {
-      lo.pdf = lo?.pdf?.replace("https://", "http://");
-    }
+    if (lo.pdf) {}
   }
 }
killedBy: injectCourseUrl() - Protocol Handling WHEN courseProtocol is http:// shall convert https:// URLs to http://
statusReason: expected 'https://{{COURSEURL}}/doc.pdf' to contain 'http://'

[Survived] OptionalChaining
services/course/services/lo-tree.ts:151:16
     lo.video = lo.video?.replace("https://", "http://");
     lo.img = lo.img?.replace("https://", "http://");
     if (lo.pdf) {
-      lo.pdf = lo?.pdf?.replace("https://", "http://");
+      lo.pdf = lo.pdf?.replace("https://", "http://");
     }
   }
