[Survived] OptionalChaining
services/course/services/lo-tree.ts:151:16
     lo.video = lo.video?.replace("https://", "http://");
     lo.img = lo.img?.replace("https://", "http://");
     if (lo.pdf) {
-      lo.pdf = lo?.pdf?.replace("https://", "http://");
+      lo.pdf = lo?.pdf.replace("https://", "http://");
     }
   }

[Killed] BlockStatement
services/course/services/lo-tree.ts:162:92
  * @param input - Course identifier (URL, domain, or ID)
  * @returns Object with normalized courseId and courseUrl
  */
-export function determineCourseUrl(input: string): { courseId: string; courseUrl: string } {
-  const urlPattern = /^(https?:\/\/)?([A-Za-z0-9.-]+\.[A-Za-z]{2,})(:[0-9]+)?(\/[A-Za-z0-9_.-]+)*(\/[A-Za-z0-9_.-]+\?[A-Za-z0-9_=-]+)?(#.*)?$/;
-  const isValidURL = urlPattern.test(input);
-
-  if (isValidURL) {
-    // Full URL provided (e.g., https://example.netlify.app)
-    const courseUrl = input;
-    const courseId = input.includes(".netlify.app") ? input.replace(".netlify.app", "") : input;
-    return { courseId, courseUrl };
-  }
-
-  // Course ID only - determine protocol and construct URL
-  const isLocalhost = input.startsWith("192") || input.startsWith("localhost");
-  if (isLocalhost) {
-    courseProtocol.value = "http://";
-    return { courseId: input, courseUrl: input };
-  }
-
-  // Default to Netlify subdomain
-  return { courseId: input, courseUrl: `${input}.netlify.app` };
-}
+export function determineCourseUrl(input: string): { courseId: string; courseUrl: string } {}
 
killedBy: Course Service Integration Tests Feature: Course Loading WHEN a user navigates to /course/{courseId} the Tutors Reader shall fetch tutors.json from the course URL
statusReason: Cannot destructure property 'courseId' of '(0 , determineCourseUrl)(...)' as it is undefined.

[Killed] Regex
services/course/services/lo-tree.ts:163:22
  * @returns Object with normalized courseId and courseUrl
  */
 export function determineCourseUrl(input: string): { courseId: string; courseUrl: string } {
-  const urlPattern = /^(https?:\/\/)?([A-Za-z0-9.-]+\.[A-Za-z]{2,})(:[0-9]+)?(\/[A-Za-z0-9_.-]+)*(\/[A-Za-z0-9_.-]+\?[A-Za-z0-9_=-]+)?(#.*)?$/;
+  const urlPattern = /^(https?:\/\/)?([A-Za-z0-9.-]+\.[A-Za-z]{2,})(:[0-9]+)?(\/[^A-Za-z0-9_.-]+)*(\/[A-Za-z0-9_.-]+\?[A-Za-z0-9_=-]+)?(#.*)?$/;
   const isValidURL = urlPattern.test(input);
 
killedBy: determineCourseUrl() WHEN a custom domain URL is provided should handle URLs with paths
statusReason: expected 'https://example.com/my-course.netlify…' to be 'https://example.com/my-course' // Object.is equality

[Killed] Regex
services/course/services/lo-tree.ts:163:22
  * @returns Object with normalized courseId and courseUrl
  */
 export function determineCourseUrl(input: string): { courseId: string; courseUrl: string } {
-  const urlPattern = /^(https?:\/\/)?([A-Za-z0-9.-]+\.[A-Za-z]{2,})(:[0-9]+)?(\/[A-Za-z0-9_.-]+)*(\/[A-Za-z0-9_.-]+\?[A-Za-z0-9_=-]+)?(#.*)?$/;
+  const urlPattern = /^(https?:\/\/)?([A-Za-z0-9.-]+\.[A-Za-z]{2,})(:[0-9]+)(\/[A-Za-z0-9_.-]+)*(\/[A-Za-z0-9_.-]+\?[A-Za-z0-9_=-]+)?(#.*)?$/;
   const isValidURL = urlPattern.test(input);
 
killedBy: Course Service Integration Tests Feature: Course URL Handling WHEN a Netlify domain courseId is provided shall extract courseId and construct proper URL
statusReason: expected "spy" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st spy call:

  [
-   StringContaining "my-course.netlify.app/tutors.json",

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:166:7
   const urlPattern = /^(https?:\/\/)?([A-Za-z0-9.-]+\.[A-Za-z]{2,})(:[0-9]+)?(\/[A-Za-z0-9_.-]+)*(\/[A-Za-z0-9_.-]+\?[A-Za-z0-9_=-]+)?(#.*)?$/;
   const isValidURL = urlPattern.test(input);
 
-  if (isValidURL) {
+  if (true) {
     // Full URL provided (e.g., https://example.netlify.app)
     const courseUrl = input;
killedBy: Course Service Integration Tests Feature: Course Loading WHEN a user navigates to /course/{courseId} the Tutors Reader shall fetch tutors.json from the course URL
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "https://test-course.netlify.app/tutors.json",

[Killed] BlockStatement
services/course/services/lo-tree.ts:166:19
   const urlPattern = /^(https?:\/\/)?([A-Za-z0-9.-]+\.[A-Za-z]{2,})(:[0-9]+)?(\/[A-Za-z0-9_.-]+)*(\/[A-Za-z0-9_.-]+\?[A-Za-z0-9_=-]+)?(#.*)?$/;
   const isValidURL = urlPattern.test(input);
 
-  if (isValidURL) {
-    // Full URL provided (e.g., https://example.netlify.app)
-    const courseUrl = input;
-    const courseId = input.includes(".netlify.app") ? input.replace(".netlify.app", "") : input;
-    return { courseId, courseUrl };
-  }
+  if (isValidURL) {}
 
   // Course ID only - determine protocol and construct URL
killedBy: Course Service Integration Tests Feature: Course URL Handling WHEN a Netlify domain courseId is provided shall extract courseId and construct proper URL
statusReason: expected "spy" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st spy call:

  [
-   StringContaining "my-course.netlify.app/tutors.json",

[Killed] ObjectLiteral
services/course/services/lo-tree.ts:170:12
     // Full URL provided (e.g., https://example.netlify.app)
     const courseUrl = input;
     const courseId = input.includes(".netlify.app") ? input.replace(".netlify.app", "") : input;
-    return { courseId, courseUrl };
+    return {};
   }
 
killedBy: Course Service Integration Tests Feature: Course URL Handling WHEN a Netlify domain courseId is provided shall extract courseId and construct proper URL
statusReason: expected "spy" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st spy call:

  [
-   StringContaining "my-course.netlify.app/tutors.json",

[Killed] MethodExpression
services/course/services/lo-tree.ts:174:23
   }
 
   // Course ID only - determine protocol and construct URL
-  const isLocalhost = input.startsWith("192") || input.startsWith("localhost");
+  const isLocalhost = input.endsWith("192") || input.startsWith("localhost");
   if (isLocalhost) {
     courseProtocol.value = "http://";
killedBy: determineCourseUrl() WHEN a localhost URL is provided should set protocol to http:// for IP addresses starting with 192
statusReason: expected '192.168.1.100:8080.netlify.app' to be '192.168.1.100:8080' // Object.is equality

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:174:23
   }
 
   // Course ID only - determine protocol and construct URL
-  const isLocalhost = input.startsWith("192") || input.startsWith("localhost");
+  const isLocalhost = false;
   if (isLocalhost) {
     courseProtocol.value = "http://";
killedBy: determineCourseUrl() WHEN a localhost URL is provided should set protocol to http:// for localhost
statusReason: expected 'localhost:3000.netlify.app' to be 'localhost:3000' // Object.is equality

[Killed] BlockStatement
services/course/services/lo-tree.ts:175:20
 
   // Course ID only - determine protocol and construct URL
   const isLocalhost = input.startsWith("192") || input.startsWith("localhost");
-  if (isLocalhost) {
-    courseProtocol.value = "http://";
-    return { courseId: input, courseUrl: input };
-  }
+  if (isLocalhost) {}
 
   // Default to Netlify subdomain
killedBy: determineCourseUrl() WHEN a localhost URL is provided should set protocol to http:// for localhost
statusReason: expected 'localhost:3000.netlify.app' to be 'localhost:3000' // Object.is equality

[Killed] ConditionalExpression
services/course/services/lo-tree.ts:175:7
 
   // Course ID only - determine protocol and construct URL
   const isLocalhost = input.startsWith("192") || input.startsWith("localhost");
-  if (isLocalhost) {
+  if (false) {
     courseProtocol.value = "http://";
     return { courseId: input, courseUrl: input };
killedBy: determineCourseUrl() WHEN a localhost URL is provided should set protocol to http:// for localhost
statusReason: expected 'localhost:3000.netlify.app' to be 'localhost:3000' // Object.is equality

[Killed] ObjectLiteral
services/course/services/lo-tree.ts:177:12
   const isLocalhost = input.startsWith("192") || input.startsWith("localhost");
   if (isLocalhost) {
     courseProtocol.value = "http://";
-    return { courseId: input, courseUrl: input };
+    return {};
   }
 
killedBy: determineCourseUrl() WHEN a localhost URL is provided should set protocol to http:// for localhost
statusReason: expected undefined to be 'localhost:3000' // Object.is equality

[Killed] StringLiteral
services/course/services/lo-tree.ts:181:40
   }
 
   // Default to Netlify subdomain
-  return { courseId: input, courseUrl: `${input}.netlify.app` };
+  return { courseId: input, courseUrl: `` };
 }
 
killedBy: determineCourseUrl() WHEN a plain course ID is provided should construct Netlify URL from courseId
statusReason: expected '' to be 'my-course.netlify.app' // Object.is equality
