[Killed] BlockStatement
services/course/services/course.svelte.ts:29:89
    * @param fetchFunction - Fetch implementation for HTTP requests
    * @returns Promise resolving to the loaded Course
    */
-  async getOrLoadCourse(courseId: string, fetchFunction: typeof fetch): Promise<Course> {
-    let course = this.courses.get(courseId);
-
-    if (!course) {
-      const { courseId: normalizedCourseId, courseUrl } = determineCourseUrl(courseId);
-      courseId = normalizedCourseId;
-
-      try {
-        const response = await fetchFunction(`${courseProtocol.value}${courseUrl}/tutors.json`);
-        if (!response.ok) {
-          throw new Error(`Fetch failed with status ${response.status}`);
-        }
-        const data = await response.json();
-        course = data as Course;
-        decorateCourseTree(course, courseId, courseUrl);
-        this.courses.set(courseId, course);
-      } catch (error) {
-        console.error(`Error fetching from URL: https://${courseUrl}/tutors.json`);
-        console.error(error);
-        throw error;
-      }
-    }
-
-    return course;
-  },
+  async getOrLoadCourse(courseId: string, fetchFunction: typeof fetch): Promise<Course> {},
 
   /**
killedBy: Course Service Integration Tests Feature: Course Loading WHEN a user navigates to /course/{courseId} the Tutors Reader shall fetch tutors.json from the course URL
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
services/course/services/course.svelte.ts:32:9
   async getOrLoadCourse(courseId: string, fetchFunction: typeof fetch): Promise<Course> {
     let course = this.courses.get(courseId);
 
-    if (!course) {
+    if (true) {
       const { courseId: normalizedCourseId, courseUrl } = determineCourseUrl(courseId);
       courseId = normalizedCourseId;
killedBy: Course Service Integration Tests Feature: Course Loading WHEN the same course is requested again the Tutors Reader shall return the cached version without fetching
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] BlockStatement
services/course/services/course.svelte.ts:32:18
   async getOrLoadCourse(courseId: string, fetchFunction: typeof fetch): Promise<Course> {
     let course = this.courses.get(courseId);
 
-    if (!course) {
-      const { courseId: normalizedCourseId, courseUrl } = determineCourseUrl(courseId);
-      courseId = normalizedCourseId;
-
-      try {
-        const response = await fetchFunction(`${courseProtocol.value}${courseUrl}/tutors.json`);
-        if (!response.ok) {
-          throw new Error(`Fetch failed with status ${response.status}`);
-        }
-        const data = await response.json();
-        course = data as Course;
-        decorateCourseTree(course, courseId, courseUrl);
-        this.courses.set(courseId, course);
-      } catch (error) {
-        console.error(`Error fetching from URL: https://${courseUrl}/tutors.json`);
-        console.error(error);
-        throw error;
-      }
-    }
+    if (!course) {}
 
     return course;
killedBy: Course Service Integration Tests Feature: Course Loading WHEN a user navigates to /course/{courseId} the Tutors Reader shall fetch tutors.json from the course URL
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
services/course/services/course.svelte.ts:36:11
       const { courseId: normalizedCourseId, courseUrl } = determineCourseUrl(courseId);
       courseId = normalizedCourseId;
 
-      try {
-        const response = await fetchFunction(`${courseProtocol.value}${courseUrl}/tutors.json`);
-        if (!response.ok) {
-          throw new Error(`Fetch failed with status ${response.status}`);
-        }
-        const data = await response.json();
-        course = data as Course;
-        decorateCourseTree(course, courseId, courseUrl);
-        this.courses.set(courseId, course);
-      } catch (error) {
+      try {} catch (error) {
         console.error(`Error fetching from URL: https://${courseUrl}/tutors.json`);
         console.error(error);
killedBy: Course Service Integration Tests Feature: Course Loading WHEN a user navigates to /course/{courseId} the Tutors Reader shall fetch tutors.json from the course URL
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
services/course/services/course.svelte.ts:37:46
       courseId = normalizedCourseId;
 
       try {
-        const response = await fetchFunction(`${courseProtocol.value}${courseUrl}/tutors.json`);
+        const response = await fetchFunction(``);
         if (!response.ok) {
           throw new Error(`Fetch failed with status ${response.status}`);
killedBy: Course Service Integration Tests Feature: Course Loading WHEN a user navigates to /course/{courseId} the Tutors Reader shall fetch tutors.json from the course URL
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "https://test-course.netlify.app/tutors.json",

[Killed] BooleanLiteral
services/course/services/course.svelte.ts:38:13
 
       try {
         const response = await fetchFunction(`${courseProtocol.value}${courseUrl}/tutors.json`);
-        if (!response.ok) {
+        if (response.ok) {
           throw new Error(`Fetch failed with status ${response.status}`);
         }
killedBy: Course Service Integration Tests Feature: Course Loading WHEN a user navigates to /course/{courseId} the Tutors Reader shall fetch tutors.json from the course URL
statusReason: Fetch failed with status undefined

[Killed] BlockStatement
services/course/services/course.svelte.ts:38:27
 
       try {
         const response = await fetchFunction(`${courseProtocol.value}${courseUrl}/tutors.json`);
-        if (!response.ok) {
-          throw new Error(`Fetch failed with status ${response.status}`);
-        }
+        if (!response.ok) {}
         const data = await response.json();
         course = data as Course;
killedBy: Course Service Integration Tests Feature: Course Loading IF the course JSON fetch fails THEN the Tutors Reader shall log the error and throw an exception
statusReason: expected [Function] to throw error including 'Fetch failed with status 404' but got 'response.json is not a function'

[Killed] StringLiteral
services/course/services/course.svelte.ts:39:27
       try {
         const response = await fetchFunction(`${courseProtocol.value}${courseUrl}/tutors.json`);
         if (!response.ok) {
-          throw new Error(`Fetch failed with status ${response.status}`);
+          throw new Error(``);
         }
         const data = await response.json();
killedBy: Course Service Integration Tests Feature: Course Loading IF the course JSON fetch fails THEN the Tutors Reader shall log the error and throw an exception
statusReason: expected [Function] to throw error including 'Fetch failed with status 404' but got ''

[Killed] BlockStatement
services/course/services/course.svelte.ts:45:23
         course = data as Course;
         decorateCourseTree(course, courseId, courseUrl);
         this.courses.set(courseId, course);
-      } catch (error) {
-        console.error(`Error fetching from URL: https://${courseUrl}/tutors.json`);
-        console.error(error);
-        throw error;
-      }
+      } catch (error) {}
     }
 
killedBy: Course Service Integration Tests Feature: Course Loading IF the course JSON fetch fails THEN the Tutors Reader shall log the error and throw an exception
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
services/course/services/course.svelte.ts:61:84
    * @param fetchFunction - Fetch implementation
    * @returns Promise resolving to the loaded Course
    */
-  async readCourse(courseId: string, fetchFunction: typeof fetch): Promise<Course> {
-    const course = await this.getOrLoadCourse(courseId, fetchFunction);
-    this.courseUrl.value = course.courseUrl;
-    currentCourse.value = course;
-    currentLo.value = course;
-    return course;
-  },
+  async readCourse(courseId: string, fetchFunction: typeof fetch): Promise<Course> {},
 
   /**
killedBy: Course Service Integration Tests Feature: Course State Management WHEN readCourse is called shall update currentCourse rune
statusReason: expected null not to be null

[Killed] BlockStatement
services/course/services/course.svelte.ts:76:96
    * @param fetchFunction - Fetch implementation
    * @returns Promise resolving to the topic
    */
-  async readTopic(courseId: string, topicId: string, fetchFunction: typeof fetch): Promise<Lo> {
-    const course = await this.readCourse(courseId, fetchFunction);
-    const topic = course.topicIndex.get(topicId);
-    if (topic) {
-      currentLo.value = topic;
-    }
-    return topic!;
-  },
+  async readTopic(courseId: string, topicId: string, fetchFunction: typeof fetch): Promise<Lo> {},
 
   /**
killedBy: Course Service Integration Tests Feature: Course State Management WHEN readTopic is called shall load the parent course first
statusReason: expected null not to be null

[Survived] ConditionalExpression
services/course/services/course.svelte.ts:79:9
   async readTopic(courseId: string, topicId: string, fetchFunction: typeof fetch): Promise<Lo> {
     const course = await this.readCourse(courseId, fetchFunction);
     const topic = course.topicIndex.get(topicId);
-    if (topic) {
+    if (false) {
       currentLo.value = topic;
     }

[Survived] ConditionalExpression
services/course/services/course.svelte.ts:79:9
   async readTopic(courseId: string, topicId: string, fetchFunction: typeof fetch): Promise<Lo> {
     const course = await this.readCourse(courseId, fetchFunction);
     const topic = course.topicIndex.get(topicId);
-    if (topic) {
+    if (true) {
       currentLo.value = topic;
     }

[NoCoverage] BlockStatement
services/course/services/course.svelte.ts:92:100
    * @param fetchFunction - Fetch implementation
    * @returns Promise resolving to LiveLab instance
    */
-  async readLab(courseId: string, labId: string, fetchFunction: typeof fetch): Promise<LabService> {
-    const course = await this.readCourse(courseId, fetchFunction);
-
-    const lastSegment = labId.substring(labId.lastIndexOf("/") + 1);
-    if (!lastSegment.startsWith("book")) {
-      labId = labId.slice(0, labId.lastIndexOf("/"));
-    }
-
-    let liveLab = this.labs.get(labId);
-    if (!liveLab) {
-      const lab = course.loIndex.get(labId) as Lab;
-      markdownService.convertLabToHtml(course, lab);
-      liveLab = new LiveLab(course, lab, labId);
-      this.labs.set(labId, liveLab);
-    }
-
-    currentLo.value = liveLab.lab;
-    return liveLab;
-  },
+  async readLab(courseId: string, labId: string, fetchFunction: typeof fetch): Promise<LabService> {},
 
   /**

[NoCoverage] ArithmeticOperator
services/course/services/course.svelte.ts:95:41
   async readLab(courseId: string, labId: string, fetchFunction: typeof fetch): Promise<LabService> {
     const course = await this.readCourse(courseId, fetchFunction);
 
-    const lastSegment = labId.substring(labId.lastIndexOf("/") + 1);
+    const lastSegment = labId.substring(labId.lastIndexOf("/") - 1);
     if (!lastSegment.startsWith("book")) {
       labId = labId.slice(0, labId.lastIndexOf("/"));

[NoCoverage] MethodExpression
services/course/services/course.svelte.ts:95:25
   async readLab(courseId: string, labId: string, fetchFunction: typeof fetch): Promise<LabService> {
     const course = await this.readCourse(courseId, fetchFunction);
 
-    const lastSegment = labId.substring(labId.lastIndexOf("/") + 1);
+    const lastSegment = labId;
     if (!lastSegment.startsWith("book")) {
       labId = labId.slice(0, labId.lastIndexOf("/"));

[NoCoverage] BooleanLiteral
services/course/services/course.svelte.ts:96:9
     const course = await this.readCourse(courseId, fetchFunction);
 
     const lastSegment = labId.substring(labId.lastIndexOf("/") + 1);
-    if (!lastSegment.startsWith("book")) {
+    if (lastSegment.startsWith("book")) {
       labId = labId.slice(0, labId.lastIndexOf("/"));
     }

[NoCoverage] MethodExpression
services/course/services/course.svelte.ts:96:10
     const course = await this.readCourse(courseId, fetchFunction);
 
     const lastSegment = labId.substring(labId.lastIndexOf("/") + 1);
-    if (!lastSegment.startsWith("book")) {
+    if (!lastSegment.endsWith("book")) {
       labId = labId.slice(0, labId.lastIndexOf("/"));
     }

[NoCoverage] MethodExpression
services/course/services/course.svelte.ts:97:15
 
     const lastSegment = labId.substring(labId.lastIndexOf("/") + 1);
     if (!lastSegment.startsWith("book")) {
-      labId = labId.slice(0, labId.lastIndexOf("/"));
+      labId = labId;
     }
 

[NoCoverage] BlockStatement
services/course/services/course.svelte.ts:101:19
     }
 
     let liveLab = this.labs.get(labId);
-    if (!liveLab) {
-      const lab = course.loIndex.get(labId) as Lab;
-      markdownService.convertLabToHtml(course, lab);
-      liveLab = new LiveLab(course, lab, labId);
-      this.labs.set(labId, liveLab);
-    }
+    if (!liveLab) {}
 
     currentLo.value = liveLab.lab;

[NoCoverage] BooleanLiteral
services/course/services/course.svelte.ts:101:9
     }
 
     let liveLab = this.labs.get(labId);
-    if (!liveLab) {
+    if (liveLab) {
       const lab = course.loIndex.get(labId) as Lab;
       markdownService.convertLabToHtml(course, lab);

[NoCoverage] BlockStatement
services/course/services/course.svelte.ts:119:94
    * @param fetchFunction - Fetch implementation
    * @returns Promise resolving to array of learning objects
    */
-  async readWall(courseId: string, type: string, fetchFunction: typeof fetch): Promise<Lo[]> {
-    const course = await this.readCourse(courseId, fetchFunction);
-    const wall = course.wallMap?.get(type);
-    return wall!;
-  },
+  async readWall(courseId: string, type: string, fetchFunction: typeof fetch): Promise<Lo[]> {},
 
   /**

[NoCoverage] OptionalChaining
services/course/services/course.svelte.ts:121:18
    */
   async readWall(courseId: string, type: string, fetchFunction: typeof fetch): Promise<Lo[]> {
     const course = await this.readCourse(courseId, fetchFunction);
-    const wall = course.wallMap?.get(type);
+    const wall = course.wallMap.get(type);
     return wall!;
   },

[NoCoverage] BlockStatement
services/course/services/course.svelte.ts:132:90
    * @param fetchFunction - Fetch implementation
    * @returns Promise resolving to the learning object
    */
-  async readLo(courseId: string, loId: string, fetchFunction: typeof fetch): Promise<Lo> {
-    const course = await this.readCourse(courseId, fetchFunction);
-    const lo = course.loIndex.get(loId);
-    if (lo) {
-      currentLo.value = lo;
-    }
-    if (lo?.type === "note") {
-      if (!this.notes.has(loId)) {
-        markdownService.convertNoteToHtml(course, lo as Note);
-        this.notes.set(loId, lo as Note);
-      }
-    }
-    return lo!;
-  },
+  async readLo(courseId: string, loId: string, fetchFunction: typeof fetch): Promise<Lo> {},
 
   /**

[NoCoverage] ConditionalExpression
services/course/services/course.svelte.ts:135:9
   async readLo(courseId: string, loId: string, fetchFunction: typeof fetch): Promise<Lo> {
     const course = await this.readCourse(courseId, fetchFunction);
     const lo = course.loIndex.get(loId);
-    if (lo) {
+    if (true) {
       currentLo.value = lo;
     }

[NoCoverage] ConditionalExpression
services/course/services/course.svelte.ts:135:9
   async readLo(courseId: string, loId: string, fetchFunction: typeof fetch): Promise<Lo> {
     const course = await this.readCourse(courseId, fetchFunction);
     const lo = course.loIndex.get(loId);
-    if (lo) {
+    if (false) {
       currentLo.value = lo;
     }

[NoCoverage] EqualityOperator
services/course/services/course.svelte.ts:138:9
     if (lo) {
       currentLo.value = lo;
     }
-    if (lo?.type === "note") {
+    if (lo?.type !== "note") {
       if (!this.notes.has(loId)) {
         markdownService.convertNoteToHtml(course, lo as Note);

[NoCoverage] BlockStatement
services/course/services/course.svelte.ts:138:30
     if (lo) {
       currentLo.value = lo;
     }
-    if (lo?.type === "note") {
-      if (!this.notes.has(loId)) {
-        markdownService.convertNoteToHtml(course, lo as Note);
-        this.notes.set(loId, lo as Note);
-      }
-    }
+    if (lo?.type === "note") {}
     return lo!;
   },

[NoCoverage] ConditionalExpression
services/course/services/course.svelte.ts:139:11
       currentLo.value = lo;
     }
     if (lo?.type === "note") {
-      if (!this.notes.has(loId)) {
+      if (false) {
         markdownService.convertNoteToHtml(course, lo as Note);
         this.notes.set(loId, lo as Note);

[NoCoverage] ConditionalExpression
services/course/services/course.svelte.ts:139:11
       currentLo.value = lo;
     }
     if (lo?.type === "note") {
-      if (!this.notes.has(loId)) {
+      if (true) {
         markdownService.convertNoteToHtml(course, lo as Note);
         this.notes.set(loId, lo as Note);

[NoCoverage] BlockStatement
services/course/services/course.svelte.ts:150:20
   /**
    * Refreshes all cached labs and notes, forcing markdown to HTML reconversion
    */
-  refreshAllLabs() {
-    for (const liveLab of this.labs.values()) {
-      markdownService.convertLabToHtml(liveLab.course, liveLab.lab, true);
-      liveLab.convertMdToHtml();
-      liveLab.refreshStep();
-    }
-    for (const note of this.notes.values()) {
-      markdownService.convertNoteToHtml(currentCourse.value!, note, true);
-    }
-  }
+  refreshAllLabs() {}
 };
 

[NoCoverage] BlockStatement
services/course/services/course.svelte.ts:151:47
    * Refreshes all cached labs and notes, forcing markdown to HTML reconversion
    */
   refreshAllLabs() {
-    for (const liveLab of this.labs.values()) {
-      markdownService.convertLabToHtml(liveLab.course, liveLab.lab, true);
-      liveLab.convertMdToHtml();
-      liveLab.refreshStep();
-    }
+    for (const liveLab of this.labs.values()) {}
     for (const note of this.notes.values()) {
       markdownService.convertNoteToHtml(currentCourse.value!, note, true);

[NoCoverage] BooleanLiteral
services/course/services/course.svelte.ts:152:69
    */
   refreshAllLabs() {
     for (const liveLab of this.labs.values()) {
-      markdownService.convertLabToHtml(liveLab.course, liveLab.lab, true);
+      markdownService.convertLabToHtml(liveLab.course, liveLab.lab, false);
       liveLab.convertMdToHtml();
       liveLab.refreshStep();

[NoCoverage] BlockStatement
services/course/services/course.svelte.ts:156:45
       liveLab.convertMdToHtml();
       liveLab.refreshStep();
     }
-    for (const note of this.notes.values()) {
-      markdownService.convertNoteToHtml(currentCourse.value!, note, true);
-    }
+    for (const note of this.notes.values()) {}
   }
 };

[NoCoverage] BooleanLiteral
services/course/services/course.svelte.ts:157:69
       liveLab.refreshStep();
     }
     for (const note of this.notes.values()) {
-      markdownService.convertNoteToHtml(currentCourse.value!, note, true);
+      markdownService.convertNoteToHtml(currentCourse.value!, note, false);
     }
   }
