[NoCoverage] StringLiteral
services/community/services/analytics.svelte.ts:14:12
 
 export const analyticsService: AnalyticsService = {
   /** Current learning object route being tracked */
-  loRoute: "",
+  loRoute: "Stryker was here!",
 
   /**

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:24:92
    * @param lo - Learning object being interacted with
    * @param student - Student performing the interaction
    */
-  learningEvent(course: Course, params: Record<string, string>, lo: Lo, student: TutorsId) {
-    try {
-      if (params.loid) {
-        const targetRouteParts = lo.route.split("/");
-        const trimmedTargetRoute = targetRouteParts.slice(0, 3).join("/");
-        this.loRoute = trimmedTargetRoute + "/" + params.loid;
-      } else {
-        this.loRoute = lo.route;
-      }
-      this.reportPageLoad(course, lo, student);
-    } catch (error: any) {
-      console.log(`TutorStore Error: ${error.message}`);
-    }
-  },
+  learningEvent(course: Course, params: Record<string, string>, lo: Lo, student: TutorsId) {},
 
   /**

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:25:9
    * @param student - Student performing the interaction
    */
   learningEvent(course: Course, params: Record<string, string>, lo: Lo, student: TutorsId) {
-    try {
-      if (params.loid) {
-        const targetRouteParts = lo.route.split("/");
-        const trimmedTargetRoute = targetRouteParts.slice(0, 3).join("/");
-        this.loRoute = trimmedTargetRoute + "/" + params.loid;
-      } else {
-        this.loRoute = lo.route;
-      }
-      this.reportPageLoad(course, lo, student);
-    } catch (error: any) {
+    try {} catch (error: any) {
       console.log(`TutorStore Error: ${error.message}`);
     }

[NoCoverage] ConditionalExpression
services/community/services/analytics.svelte.ts:26:11
    */
   learningEvent(course: Course, params: Record<string, string>, lo: Lo, student: TutorsId) {
     try {
-      if (params.loid) {
+      if (true) {
         const targetRouteParts = lo.route.split("/");
         const trimmedTargetRoute = targetRouteParts.slice(0, 3).join("/");

[NoCoverage] ConditionalExpression
services/community/services/analytics.svelte.ts:26:11
    */
   learningEvent(course: Course, params: Record<string, string>, lo: Lo, student: TutorsId) {
     try {
-      if (params.loid) {
+      if (false) {
         const targetRouteParts = lo.route.split("/");
         const trimmedTargetRoute = targetRouteParts.slice(0, 3).join("/");

[NoCoverage] StringLiteral
services/community/services/analytics.svelte.ts:27:49
   learningEvent(course: Course, params: Record<string, string>, lo: Lo, student: TutorsId) {
     try {
       if (params.loid) {
-        const targetRouteParts = lo.route.split("/");
+        const targetRouteParts = lo.route.split("");
         const trimmedTargetRoute = targetRouteParts.slice(0, 3).join("/");
         this.loRoute = trimmedTargetRoute + "/" + params.loid;

[NoCoverage] MethodExpression
services/community/services/analytics.svelte.ts:28:36
     try {
       if (params.loid) {
         const targetRouteParts = lo.route.split("/");
-        const trimmedTargetRoute = targetRouteParts.slice(0, 3).join("/");
+        const trimmedTargetRoute = targetRouteParts.join("/");
         this.loRoute = trimmedTargetRoute + "/" + params.loid;
       } else {

[NoCoverage] StringLiteral
services/community/services/analytics.svelte.ts:29:45
       if (params.loid) {
         const targetRouteParts = lo.route.split("/");
         const trimmedTargetRoute = targetRouteParts.slice(0, 3).join("/");
-        this.loRoute = trimmedTargetRoute + "/" + params.loid;
+        this.loRoute = trimmedTargetRoute + "" + params.loid;
       } else {
         this.loRoute = lo.route;

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:30:14
         const targetRouteParts = lo.route.split("/");
         const trimmedTargetRoute = targetRouteParts.slice(0, 3).join("/");
         this.loRoute = trimmedTargetRoute + "/" + params.loid;
-      } else {
-        this.loRoute = lo.route;
-      }
+      } else {}
       this.reportPageLoad(course, lo, student);
     } catch (error: any) {

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:34:26
         this.loRoute = lo.route;
       }
       this.reportPageLoad(course, lo, student);
-    } catch (error: any) {
-      console.log(`TutorStore Error: ${error.message}`);
-    }
+    } catch (error: any) {}
   },
 

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:46:61
    * @param lo - Learning object being viewed
    * @param student - Student viewing the content
    */
-  reportPageLoad(course: Course, lo: Lo, student: TutorsId) {
-    try {
-      storeStudentCourseLearningObjectInSupabase(course, this.loRoute, lo, student);
-    } catch (error: any) {
-      console.log(`TutorStore Error: ${error.message}`);
-    }
-  },
+  reportPageLoad(course: Course, lo: Lo, student: TutorsId) {},
 
   /**

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:47:9
    * @param student - Student viewing the content
    */
   reportPageLoad(course: Course, lo: Lo, student: TutorsId) {
-    try {
-      storeStudentCourseLearningObjectInSupabase(course, this.loRoute, lo, student);
-    } catch (error: any) {
+    try {} catch (error: any) {
       console.log(`TutorStore Error: ${error.message}`);
     }

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:49:26
   reportPageLoad(course: Course, lo: Lo, student: TutorsId) {
     try {
       storeStudentCourseLearningObjectInSupabase(course, this.loRoute, lo, student);
-    } catch (error: any) {
-      console.log(`TutorStore Error: ${error.message}`);
-    }
+    } catch (error: any) {}
   },
 

[NoCoverage] StringLiteral
services/community/services/analytics.svelte.ts:50:19
     try {
       storeStudentCourseLearningObjectInSupabase(course, this.loRoute, lo, student);
     } catch (error: any) {
-      console.log(`TutorStore Error: ${error.message}`);
+      console.log(``);
     }
   },

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:61:62
    * @param lo - Learning object being tracked
    * @param student - Student to update analytics for
    */
-  updatePageCount(course: Course, lo: Lo, student: TutorsId) {
-    try {
-      if (student) {
-        if (lo.route) updateLearningRecordsDuration(course.courseId, student.login, this.loRoute);
-        updateCalendarDuration(formatDate(new Date()), student.login, course.courseId);
-      }
-    } catch (error: any) {
-      console.error(`TutorStore Error: ${error.message}`);
-    }
-  },
+  updatePageCount(course: Course, lo: Lo, student: TutorsId) {},
 
   /**

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:62:9
    * @param student - Student to update analytics for
    */
   updatePageCount(course: Course, lo: Lo, student: TutorsId) {
-    try {
-      if (student) {
-        if (lo.route) updateLearningRecordsDuration(course.courseId, student.login, this.loRoute);
-        updateCalendarDuration(formatDate(new Date()), student.login, course.courseId);
-      }
-    } catch (error: any) {
+    try {} catch (error: any) {
       console.error(`TutorStore Error: ${error.message}`);
     }

[NoCoverage] ConditionalExpression
services/community/services/analytics.svelte.ts:63:11
    */
   updatePageCount(course: Course, lo: Lo, student: TutorsId) {
     try {
-      if (student) {
+      if (false) {
         if (lo.route) updateLearningRecordsDuration(course.courseId, student.login, this.loRoute);
         updateCalendarDuration(formatDate(new Date()), student.login, course.courseId);

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:63:20
    */
   updatePageCount(course: Course, lo: Lo, student: TutorsId) {
     try {
-      if (student) {
-        if (lo.route) updateLearningRecordsDuration(course.courseId, student.login, this.loRoute);
-        updateCalendarDuration(formatDate(new Date()), student.login, course.courseId);
-      }
+      if (student) {}
     } catch (error: any) {
       console.error(`TutorStore Error: ${error.message}`);

[NoCoverage] ConditionalExpression
services/community/services/analytics.svelte.ts:64:13
   updatePageCount(course: Course, lo: Lo, student: TutorsId) {
     try {
       if (student) {
-        if (lo.route) updateLearningRecordsDuration(course.courseId, student.login, this.loRoute);
+        if (false) updateLearningRecordsDuration(course.courseId, student.login, this.loRoute);
         updateCalendarDuration(formatDate(new Date()), student.login, course.courseId);
       }

[NoCoverage] ConditionalExpression
services/community/services/analytics.svelte.ts:64:13
   updatePageCount(course: Course, lo: Lo, student: TutorsId) {
     try {
       if (student) {
-        if (lo.route) updateLearningRecordsDuration(course.courseId, student.login, this.loRoute);
+        if (true) updateLearningRecordsDuration(course.courseId, student.login, this.loRoute);
         updateCalendarDuration(formatDate(new Date()), student.login, course.courseId);
       }

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:67:26
         if (lo.route) updateLearningRecordsDuration(course.courseId, student.login, this.loRoute);
         updateCalendarDuration(formatDate(new Date()), student.login, course.courseId);
       }
-    } catch (error: any) {
-      console.error(`TutorStore Error: ${error.message}`);
-    }
+    } catch (error: any) {}
   },
 

[NoCoverage] StringLiteral
services/community/services/analytics.svelte.ts:68:21
         updateCalendarDuration(formatDate(new Date()), student.login, course.courseId);
       }
     } catch (error: any) {
-      console.error(`TutorStore Error: ${error.message}`);
+      console.error(``);
     }
   },

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:78:53
    * @param courseId - Course being accessed
    * @param session - Authentication session data
    */
-  async updateLogin(courseId: string, session: any) {
-    try {
-      await addOrUpdateStudent(session.user);
-    } catch (error: any) {
-      console.log(`TutorStore Error: ${error.message}`);
-    }
-  }
+  async updateLogin(courseId: string, session: any) {}
 };
 

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:79:9
    * @param session - Authentication session data
    */
   async updateLogin(courseId: string, session: any) {
-    try {
-      await addOrUpdateStudent(session.user);
-    } catch (error: any) {
+    try {} catch (error: any) {
       console.log(`TutorStore Error: ${error.message}`);
     }

[NoCoverage] BlockStatement
services/community/services/analytics.svelte.ts:81:26
   async updateLogin(courseId: string, session: any) {
     try {
       await addOrUpdateStudent(session.user);
-    } catch (error: any) {
-      console.log(`TutorStore Error: ${error.message}`);
-    }
+    } catch (error: any) {}
   }
 };
