[NoCoverage] BlockStatement
services/community/services/catalogue.ts:5:24
 import { supabase } from "../utils/supabase-client";
 
 export const catalogueService: CatalogueService = {
-  async getCatalogue() {
-    try {
-      const { data, error } = await supabase.from("tutors-connect-courses").select("*").order("visited_at", { ascending: false });
-
-      if (error) {
-        throw error;
-      }
-
-      const catalogue = data as Array<CatalogueEntry>;
-      return catalogue;
-    } catch (error) {
-      console.error("Error fetching courses:", error);
-      return [];
-    }
-  },
+  async getCatalogue() {},
 
   async getCatalogueCount() {

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:6:9
 
 export const catalogueService: CatalogueService = {
   async getCatalogue() {
-    try {
-      const { data, error } = await supabase.from("tutors-connect-courses").select("*").order("visited_at", { ascending: false });
-
-      if (error) {
-        throw error;
-      }
-
-      const catalogue = data as Array<CatalogueEntry>;
-      return catalogue;
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error fetching courses:", error);
       return [];

[NoCoverage] BooleanLiteral
services/community/services/catalogue.ts:7:122
 export const catalogueService: CatalogueService = {
   async getCatalogue() {
     try {
-      const { data, error } = await supabase.from("tutors-connect-courses").select("*").order("visited_at", { ascending: false });
+      const { data, error } = await supabase.from("tutors-connect-courses").select("*").order("visited_at", { ascending: true });
 
       if (error) {

[NoCoverage] StringLiteral
services/community/services/catalogue.ts:7:84
 export const catalogueService: CatalogueService = {
   async getCatalogue() {
     try {
-      const { data, error } = await supabase.from("tutors-connect-courses").select("*").order("visited_at", { ascending: false });
+      const { data, error } = await supabase.from("tutors-connect-courses").select("").order("visited_at", { ascending: false });
 
       if (error) {

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:9:18
     try {
       const { data, error } = await supabase.from("tutors-connect-courses").select("*").order("visited_at", { ascending: false });
 
-      if (error) {
-        throw error;
-      }
+      if (error) {}
 
       const catalogue = data as Array<CatalogueEntry>;

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:15:21
 
       const catalogue = data as Array<CatalogueEntry>;
       return catalogue;
-    } catch (error) {
-      console.error("Error fetching courses:", error);
-      return [];
-    }
+    } catch (error) {}
   },
 

[NoCoverage] StringLiteral
services/community/services/catalogue.ts:16:21
       const catalogue = data as Array<CatalogueEntry>;
       return catalogue;
     } catch (error) {
-      console.error("Error fetching courses:", error);
+      console.error("", error);
       return [];
     }

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:21:29
     }
   },
 
-  async getCatalogueCount() {
-    try {
-      const { count, error } = await supabase.from("tutors-connect-courses").select("*", { count: "exact", head: true });
-
-      if (error) {
-        throw error;
-      }
-
-      return count || 0;
-    } catch (error) {
-      console.error("Error fetching course count:", error);
-      return 0;
-    }
-  },
+  async getCatalogueCount() {},
 
   async getStudentCount() {

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:22:9
   },
 
   async getCatalogueCount() {
-    try {
-      const { count, error } = await supabase.from("tutors-connect-courses").select("*", { count: "exact", head: true });
-
-      if (error) {
-        throw error;
-      }
-
-      return count || 0;
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error fetching course count:", error);
       return 0;

[NoCoverage] BooleanLiteral
services/community/services/catalogue.ts:23:114
 
   async getCatalogueCount() {
     try {
-      const { count, error } = await supabase.from("tutors-connect-courses").select("*", { count: "exact", head: true });
+      const { count, error } = await supabase.from("tutors-connect-courses").select("*", { count: "exact", head: false });
 
       if (error) {

[NoCoverage] ObjectLiteral
services/community/services/catalogue.ts:23:90
 
   async getCatalogueCount() {
     try {
-      const { count, error } = await supabase.from("tutors-connect-courses").select("*", { count: "exact", head: true });
+      const { count, error } = await supabase.from("tutors-connect-courses").select("*", {});
 
       if (error) {

[NoCoverage] LogicalOperator
services/community/services/catalogue.ts:29:14
         throw error;
       }
 
-      return count || 0;
+      return count && 0;
     } catch (error) {
       console.error("Error fetching course count:", error);

[NoCoverage] ConditionalExpression
services/community/services/catalogue.ts:29:14
         throw error;
       }
 
-      return count || 0;
+      return false;
     } catch (error) {
       console.error("Error fetching course count:", error);

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:30:21
       }
 
       return count || 0;
-    } catch (error) {
-      console.error("Error fetching course count:", error);
-      return 0;
-    }
+    } catch (error) {}
   },
 

[NoCoverage] StringLiteral
services/community/services/catalogue.ts:31:21
 
       return count || 0;
     } catch (error) {
-      console.error("Error fetching course count:", error);
+      console.error("", error);
       return 0;
     }

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:36:27
     }
   },
 
-  async getStudentCount() {
-    try {
-      const { count, error } = await supabase.from("tutors-connect-profiles").select("*", { count: "exact", head: true });
-
-      if (error) {
-        throw error;
-      }
-
-      return count || 0;
-    } catch (error) {
-      console.error("Error fetching course count:", error);
-      return 0;
-    }
-  },
+  async getStudentCount() {},
 
   async pruneCatalogue(fetchFunction: typeof fetch) {

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:37:9
   },
 
   async getStudentCount() {
-    try {
-      const { count, error } = await supabase.from("tutors-connect-profiles").select("*", { count: "exact", head: true });
-
-      if (error) {
-        throw error;
-      }
-
-      return count || 0;
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error fetching course count:", error);
       return 0;

[NoCoverage] BooleanLiteral
services/community/services/catalogue.ts:38:115
 
   async getStudentCount() {
     try {
-      const { count, error } = await supabase.from("tutors-connect-profiles").select("*", { count: "exact", head: true });
+      const { count, error } = await supabase.from("tutors-connect-profiles").select("*", { count: "exact", head: false });
 
       if (error) {

[NoCoverage] StringLiteral
services/community/services/catalogue.ts:38:86
 
   async getStudentCount() {
     try {
-      const { count, error } = await supabase.from("tutors-connect-profiles").select("*", { count: "exact", head: true });
+      const { count, error } = await supabase.from("tutors-connect-profiles").select("", { count: "exact", head: true });
 
       if (error) {

[NoCoverage] ConditionalExpression
services/community/services/catalogue.ts:44:14
         throw error;
       }
 
-      return count || 0;
+      return true;
     } catch (error) {
       console.error("Error fetching course count:", error);

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:51:53
     }
   },
 
-  async pruneCatalogue(fetchFunction: typeof fetch) {
-    const catalogue = await this.getCatalogue();
-    console.log(`Total courses: ${catalogue.length}`);
-    const invalidIds: string[] = [];
-    for (const course of catalogue) {
-      try {
-        const url = `https://${course.course_id}.netlify.app/tutors.json`;
-        const response = await fetchFunction(url, { method: "HEAD" });
-        if (!response.ok) {
-          invalidIds.push(course.course_id);
-        }
-      } catch {
-        invalidIds.push(course.course_id);
-      }
-    }
-    console.log(`Invalid IDs: ${invalidIds.join(", ")}`);
-    console.log(`Invalid count: ${invalidIds.length}`);
-
-    if (invalidIds.length > 0) {
-      await this.deleteCourses(invalidIds);
-    }
-  },
+  async pruneCatalogue(fetchFunction: typeof fetch) {},
 
   async deleteCourses(courseIds: string[]) {

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:55:37
     const catalogue = await this.getCatalogue();
     console.log(`Total courses: ${catalogue.length}`);
     const invalidIds: string[] = [];
-    for (const course of catalogue) {
-      try {
-        const url = `https://${course.course_id}.netlify.app/tutors.json`;
-        const response = await fetchFunction(url, { method: "HEAD" });
-        if (!response.ok) {
-          invalidIds.push(course.course_id);
-        }
-      } catch {
-        invalidIds.push(course.course_id);
-      }
-    }
+    for (const course of catalogue) {}
     console.log(`Invalid IDs: ${invalidIds.join(", ")}`);
     console.log(`Invalid count: ${invalidIds.length}`);

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:56:11
     console.log(`Total courses: ${catalogue.length}`);
     const invalidIds: string[] = [];
     for (const course of catalogue) {
-      try {
-        const url = `https://${course.course_id}.netlify.app/tutors.json`;
-        const response = await fetchFunction(url, { method: "HEAD" });
-        if (!response.ok) {
-          invalidIds.push(course.course_id);
-        }
-      } catch {
+      try {} catch {
         invalidIds.push(course.course_id);
       }

[NoCoverage] ConditionalExpression
services/community/services/catalogue.ts:59:13
       try {
         const url = `https://${course.course_id}.netlify.app/tutors.json`;
         const response = await fetchFunction(url, { method: "HEAD" });
-        if (!response.ok) {
+        if (false) {
           invalidIds.push(course.course_id);
         }

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:59:27
       try {
         const url = `https://${course.course_id}.netlify.app/tutors.json`;
         const response = await fetchFunction(url, { method: "HEAD" });
-        if (!response.ok) {
-          invalidIds.push(course.course_id);
-        }
+        if (!response.ok) {}
       } catch {
         invalidIds.push(course.course_id);

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:62:15
         if (!response.ok) {
           invalidIds.push(course.course_id);
         }
-      } catch {
-        invalidIds.push(course.course_id);
-      }
+      } catch {}
     }
     console.log(`Invalid IDs: ${invalidIds.join(", ")}`);

[NoCoverage] StringLiteral
services/community/services/catalogue.ts:66:49
         invalidIds.push(course.course_id);
       }
     }
-    console.log(`Invalid IDs: ${invalidIds.join(", ")}`);
+    console.log(`Invalid IDs: ${invalidIds.join("")}`);
     console.log(`Invalid count: ${invalidIds.length}`);
 

[NoCoverage] EqualityOperator
services/community/services/catalogue.ts:69:9
     console.log(`Invalid IDs: ${invalidIds.join(", ")}`);
     console.log(`Invalid count: ${invalidIds.length}`);
 
-    if (invalidIds.length > 0) {
+    if (invalidIds.length >= 0) {
       await this.deleteCourses(invalidIds);
     }

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:69:32
     console.log(`Invalid IDs: ${invalidIds.join(", ")}`);
     console.log(`Invalid count: ${invalidIds.length}`);
 
-    if (invalidIds.length > 0) {
-      await this.deleteCourses(invalidIds);
-    }
+    if (invalidIds.length > 0) {}
   },
 

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:74:44
     }
   },
 
-  async deleteCourses(courseIds: string[]) {
-    try {
-      const { error } = await supabase.from("tutors-connect-courses").delete().in("course_id", courseIds);
-
-      if (error) {
-        console.error("Error deleting courses:", error);
-        throw error;
-      }
-      console.log(`Successfully deleted ${courseIds.length} courses`);
-    } catch (error) {
-      console.error("Error in deleteCourses:", error);
-      throw error;
-    }
-  }
+  async deleteCourses(courseIds: string[]) {}
 };
 

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:75:9
   },
 
   async deleteCourses(courseIds: string[]) {
-    try {
-      const { error } = await supabase.from("tutors-connect-courses").delete().in("course_id", courseIds);
-
-      if (error) {
-        console.error("Error deleting courses:", error);
-        throw error;
-      }
-      console.log(`Successfully deleted ${courseIds.length} courses`);
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error in deleteCourses:", error);
       throw error;

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:78:18
     try {
       const { error } = await supabase.from("tutors-connect-courses").delete().in("course_id", courseIds);
 
-      if (error) {
-        console.error("Error deleting courses:", error);
-        throw error;
-      }
+      if (error) {}
       console.log(`Successfully deleted ${courseIds.length} courses`);
     } catch (error) {

[NoCoverage] BlockStatement
services/community/services/catalogue.ts:83:21
         throw error;
       }
       console.log(`Successfully deleted ${courseIds.length} courses`);
-    } catch (error) {
-      console.error("Error in deleteCourses:", error);
-      throw error;
-    }
+    } catch (error) {}
   }
 };

[NoCoverage] StringLiteral
services/community/services/catalogue.ts:84:21
       }
       console.log(`Successfully deleted ${courseIds.length} courses`);
     } catch (error) {
-      console.error("Error in deleteCourses:", error);
+      console.error("", error);
       throw error;
     }
