[NoCoverage] EqualityOperator
services/community/services/live.svelte.ts:17:5
 
 // Initialize global WebSocket connection if server URL is configured
 let partyKitAll = <PartySocket>{};
-if (PUBLIC_party_kit_main_room !== "XXX") {
+if (PUBLIC_party_kit_main_room === "XXX") {
   partyKitAll = new PartySocket({
     host: partyKitServer,

[NoCoverage] BlockStatement
services/community/services/live.svelte.ts:17:43
 
 // Initialize global WebSocket connection if server URL is configured
 let partyKitAll = <PartySocket>{};
-if (PUBLIC_party_kit_main_room !== "XXX") {
-  partyKitAll = new PartySocket({
-    host: partyKitServer,
-    room: "tutors-all-course-access"
-  });
-}
+if (PUBLIC_party_kit_main_room !== "XXX") {}
 
 export const liveService: LiveService = {

[NoCoverage] ObjectLiteral
services/community/services/live.svelte.ts:18:33
 // Initialize global WebSocket connection if server URL is configured
 let partyKitAll = <PartySocket>{};
 if (PUBLIC_party_kit_main_room !== "XXX") {
-  partyKitAll = new PartySocket({
-    host: partyKitServer,
-    room: "tutors-all-course-access"
-  });
+  partyKitAll = new PartySocket({});
 }
 

[NoCoverage] StringLiteral
services/community/services/live.svelte.ts:26:36
 
 export const liveService: LiveService = {
   // Initialize reactive state using Svelte runes
-  listeningForCourse: rune<string>(""),
+  listeningForCourse: rune<string>("Stryker was here!"),
   coursesOnline: rune<LoRecord[]>([]),
   studentsOnline: rune<LoRecord[]>([]),

[NoCoverage] BooleanLiteral
services/community/services/live.svelte.ts:36:17
 
   // Course-specific WebSocket connection - initialized on demand
   partyKitCourse: <PartySocket>{},
-  listeningAll: false,
+  listeningAll: true,
 
   studentListener(event: MessageEvent) {

[NoCoverage] BlockStatement
services/community/services/live.svelte.ts:38:40
   partyKitCourse: <PartySocket>{},
   listeningAll: false,
 
-  studentListener(event: MessageEvent) {
-    // Parse and extract student data
-    const data = JSON.parse(event.data);
-    const studentEvent = this.studentEventMap.get(data.user.id);
-
-    if (!studentEvent) {
-      // First time seeing this student
-      const latestLo = new LoRecord(data);
-      this.studentsOnline.value.push(latestLo);
-      this.studentEventMap.set(data.user.id, latestLo);
-
-    } else {
-      // Update existing student record
-      refreshLoRecord(studentEvent, data);
-    }
-  },
+  studentListener(event: MessageEvent) {},
 
   courseListener(event: MessageEvent) {

[NoCoverage] BlockStatement
services/community/services/live.svelte.ts:43:24
     const data = JSON.parse(event.data);
     const studentEvent = this.studentEventMap.get(data.user.id);
 
-    if (!studentEvent) {
-      // First time seeing this student
-      const latestLo = new LoRecord(data);
-      this.studentsOnline.value.push(latestLo);
-      this.studentEventMap.set(data.user.id, latestLo);
-
-    } else {
+    if (!studentEvent) {} else {
       // Update existing student record
       refreshLoRecord(studentEvent, data);

[NoCoverage] ConditionalExpression
services/community/services/live.svelte.ts:43:9
     const data = JSON.parse(event.data);
     const studentEvent = this.studentEventMap.get(data.user.id);
 
-    if (!studentEvent) {
+    if (true) {
       // First time seeing this student
       const latestLo = new LoRecord(data);

[NoCoverage] BlockStatement
services/community/services/live.svelte.ts:49:12
       this.studentsOnline.value.push(latestLo);
       this.studentEventMap.set(data.user.id, latestLo);
 
-    } else {
-      // Update existing student record
-      refreshLoRecord(studentEvent, data);
-    }
+    } else {}
   },
 

[NoCoverage] BlockStatement
services/community/services/live.svelte.ts:55:39
     }
   },
 
-  courseListener(event: MessageEvent) {
-    // Parse and extract course data
-    const data = JSON.parse(event.data);
-    const courseEvent = this.courseEventMap.get(data.courseId);
-
-    if (!courseEvent) {
-      // First activity in this course
-      const latestLo = new LoRecord(data);
-      this.coursesOnline.value.push(latestLo);
-      this.courseEventMap.set(data.courseId, latestLo);
-    } else {
-      // Update existing course activity
-      refreshLoRecord(courseEvent, data);
-    }
-  },
+  courseListener(event: MessageEvent) {},
 
   partyKitListener(event: MessageEvent) {

[NoCoverage] BlockStatement
services/community/services/live.svelte.ts:60:23
     const data = JSON.parse(event.data);
     const courseEvent = this.courseEventMap.get(data.courseId);
 
-    if (!courseEvent) {
-      // First activity in this course
-      const latestLo = new LoRecord(data);
-      this.coursesOnline.value.push(latestLo);
-      this.courseEventMap.set(data.courseId, latestLo);
-    } else {
+    if (!courseEvent) {} else {
       // Update existing course activity
       refreshLoRecord(courseEvent, data);

[NoCoverage] BooleanLiteral
services/community/services/live.svelte.ts:60:9
     const data = JSON.parse(event.data);
     const courseEvent = this.courseEventMap.get(data.courseId);
 
-    if (!courseEvent) {
+    if (courseEvent) {
       // First activity in this course
       const latestLo = new LoRecord(data);

[NoCoverage] BlockStatement
services/community/services/live.svelte.ts:65:12
       const latestLo = new LoRecord(data);
       this.coursesOnline.value.push(latestLo);
       this.courseEventMap.set(data.courseId, latestLo);
-    } else {
-      // Update existing course activity
-      refreshLoRecord(courseEvent, data);
-    }
+    } else {}
   },
 

[NoCoverage] BlockStatement
services/community/services/live.svelte.ts:71:41
     }
   },
 
-  partyKitListener(event: MessageEvent) {
-    this.courseListener(event);
-    this.studentListener(event);
-  },
+  partyKitListener(event: MessageEvent) {},
 
   startGlobalPresenceService() {

[NoCoverage] BlockStatement
services/community/services/live.svelte.ts:76:32
     this.studentListener(event);
   },
 
-  startGlobalPresenceService() {
-    // Only set up global listener once
-    if (!this.listeningAll) {
-      partyKitAll.addEventListener("message", this.partyKitListener.bind(this));
-      this.listeningAll = true;
-    }
-  },
+  startGlobalPresenceService() {},
 
   startCoursePresenceListener(courseId: string) {

[NoCoverage] ConditionalExpression
services/community/services/live.svelte.ts:78:9
 
   startGlobalPresenceService() {
     // Only set up global listener once
-    if (!this.listeningAll) {
+    if (false) {
       partyKitAll.addEventListener("message", this.partyKitListener.bind(this));
       this.listeningAll = true;

[NoCoverage] BlockStatement
services/community/services/live.svelte.ts:78:29
 
   startGlobalPresenceService() {
     // Only set up global listener once
-    if (!this.listeningAll) {
-      partyKitAll.addEventListener("message", this.partyKitListener.bind(this));
-      this.listeningAll = true;
-    }
+    if (!this.listeningAll) {}
   },
 

[NoCoverage] StringLiteral
services/community/services/live.svelte.ts:79:36
   startGlobalPresenceService() {
     // Only set up global listener once
     if (!this.listeningAll) {
-      partyKitAll.addEventListener("message", this.partyKitListener.bind(this));
+      partyKitAll.addEventListener("", this.partyKitListener.bind(this));
       this.listeningAll = true;
     }

[NoCoverage] BooleanLiteral
services/community/services/live.svelte.ts:80:27
     // Only set up global listener once
     if (!this.listeningAll) {
       partyKitAll.addEventListener("message", this.partyKitListener.bind(this));
-      this.listeningAll = true;
+      this.listeningAll = false;
     }
   },

[NoCoverage] BlockStatement
services/community/services/live.svelte.ts:84:49
     }
   },
 
-  startCoursePresenceListener(courseId: string) {
-    // Reset state for new course
-    this.listeningForCourse.value = courseId;
-    this.studentsOnline.value = [];
-    this.studentEventMap.clear();
-
-    // Create new WebSocket connection for course
-    this.partyKitCourse = new PartySocket({
-      host: partyKitServer,
-      room: courseId
-    });
-
-    // Bind message handler with correct 'this' context
-    this.partyKitCourse.addEventListener("message", this.studentListener.bind(this));
-  }
+  startCoursePresenceListener(courseId: string) {}
 };
 
