[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:27:40
   studentsOnline: rune<LoRecord[]>([]),
   studentEventMap: new Map<string, LoRecord>(),
 
-  studentListener(event: MessageEvent) {
-    // Parse JSON data from WebSocket message
-    const nextCourseEvent = JSON.parse(event.data);
-    // Only process events for current course and from other users
-    if (nextCourseEvent.courseId === this.listeningTo) {// && nextCourseEvent.user.id !== tutorsId.value?.login) {
-      const studentEvent = this.studentEventMap.get(nextCourseEvent.user.id);
-      if (!studentEvent) {
-        // First time seeing this student - add to online list
-        const latestLo = new LoRecord(nextCourseEvent);
-        this.studentsOnline.value.push(latestLo);
-        this.studentEventMap.set(nextCourseEvent.user.id, latestLo);
-      } else {
-        // Update existing student's activity
-        refreshLoRecord(studentEvent, nextCourseEvent);
-      }
-    }
-  },
+  studentListener(event: MessageEvent) {},
 
   connectToAllCourseAccess(): void {

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:31:56
     // Parse JSON data from WebSocket message
     const nextCourseEvent = JSON.parse(event.data);
     // Only process events for current course and from other users
-    if (nextCourseEvent.courseId === this.listeningTo) {// && nextCourseEvent.user.id !== tutorsId.value?.login) {
-      const studentEvent = this.studentEventMap.get(nextCourseEvent.user.id);
-      if (!studentEvent) {
-        // First time seeing this student - add to online list
-        const latestLo = new LoRecord(nextCourseEvent);
-        this.studentsOnline.value.push(latestLo);
-        this.studentEventMap.set(nextCourseEvent.user.id, latestLo);
-      } else {
-        // Update existing student's activity
-        refreshLoRecord(studentEvent, nextCourseEvent);
-      }
-    }
+    if (nextCourseEvent.courseId === this.listeningTo) {}
   },
 

[NoCoverage] EqualityOperator
services/community/services/presence.svelte.ts:31:9
     // Parse JSON data from WebSocket message
     const nextCourseEvent = JSON.parse(event.data);
     // Only process events for current course and from other users
-    if (nextCourseEvent.courseId === this.listeningTo) {// && nextCourseEvent.user.id !== tutorsId.value?.login) {
+    if (nextCourseEvent.courseId !== this.listeningTo) {// && nextCourseEvent.user.id !== tutorsId.value?.login) {
       const studentEvent = this.studentEventMap.get(nextCourseEvent.user.id);
       if (!studentEvent) {

[NoCoverage] ConditionalExpression
services/community/services/presence.svelte.ts:33:11
     // Only process events for current course and from other users
     if (nextCourseEvent.courseId === this.listeningTo) {// && nextCourseEvent.user.id !== tutorsId.value?.login) {
       const studentEvent = this.studentEventMap.get(nextCourseEvent.user.id);
-      if (!studentEvent) {
+      if (false) {
         // First time seeing this student - add to online list
         const latestLo = new LoRecord(nextCourseEvent);

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:33:26
     // Only process events for current course and from other users
     if (nextCourseEvent.courseId === this.listeningTo) {// && nextCourseEvent.user.id !== tutorsId.value?.login) {
       const studentEvent = this.studentEventMap.get(nextCourseEvent.user.id);
-      if (!studentEvent) {
-        // First time seeing this student - add to online list
-        const latestLo = new LoRecord(nextCourseEvent);
-        this.studentsOnline.value.push(latestLo);
-        this.studentEventMap.set(nextCourseEvent.user.id, latestLo);
-      } else {
+      if (!studentEvent) {} else {
         // Update existing student's activity
         refreshLoRecord(studentEvent, nextCourseEvent);

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:38:14
         const latestLo = new LoRecord(nextCourseEvent);
         this.studentsOnline.value.push(latestLo);
         this.studentEventMap.set(nextCourseEvent.user.id, latestLo);
-      } else {
-        // Update existing student's activity
-        refreshLoRecord(studentEvent, nextCourseEvent);
-      }
+      } else {}
     }
   },

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:45:36
     }
   },
 
-  connectToAllCourseAccess(): void {
-    // Create WebSocket connection to global activity room
-    this.partyKitAll = new PartySocket({
-      host: partyKitServer,
-      room: "tutors-all-course-access"
-    });
-  },
+  connectToAllCourseAccess(): void {},
 
   startPresenceListener(courseId: string) {

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:53:43
     });
   },
 
-  startPresenceListener(courseId: string) {
-    // Reset state before starting new listener
-    this.studentsOnline.value = [];
-    this.studentEventMap.clear();
-    this.listeningTo = courseId;
-
-    // Create course-specific WebSocket connection
-    this.partyKitCourse = new PartySocket({
-      host: partyKitServer,
-      room: courseId
-    });
-    // Bind event handler with correct 'this' context
-    this.partyKitCourse.addEventListener("message", this.studentListener.bind(this));
-  },
+  startPresenceListener(courseId: string) {},
 
   sendLoEvent(course: Course, lo: Lo, student: TutorsId) {

[NoCoverage] ObjectLiteral
services/community/services/presence.svelte.ts:60:43
     this.listeningTo = courseId;
 
     // Create course-specific WebSocket connection
-    this.partyKitCourse = new PartySocket({
-      host: partyKitServer,
-      room: courseId
-    });
+    this.partyKitCourse = new PartySocket({});
     // Bind event handler with correct 'this' context
     this.partyKitCourse.addEventListener("message", this.studentListener.bind(this));

[NoCoverage] StringLiteral
services/community/services/presence.svelte.ts:65:42
       room: courseId
     });
     // Bind event handler with correct 'this' context
-    this.partyKitCourse.addEventListener("message", this.studentListener.bind(this));
+    this.partyKitCourse.addEventListener("", this.studentListener.bind(this));
   },
 

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:68:58
     this.partyKitCourse.addEventListener("message", this.studentListener.bind(this));
   },
 
-  sendLoEvent(course: Course, lo: Lo, student: TutorsId) {
-    // Construct event data
-    const loRecord: LoRecord = {
-      courseId: course.courseId,
-      courseUrl: course.courseUrl,
-      img: lo.img,
-      title: lo.title,
-      courseTitle: course.title,
-      loRoute: lo.route,
-      user: getUser(student),
-      type: lo.type,
-      isPrivate: (course.properties?.private as unknown as number) === 1
-    };
-    if (lo.icon) {
-      loRecord.icon = lo.icon;
-    }
-    const loRecordJson = JSON.stringify(loRecord);
-    this.partyKitAll.send(loRecordJson);
-    this.partyKitCourse.room = course.courseId;
-    if (this.listeningTo !== "") {
-      this.partyKitCourse.send(loRecordJson);
-    }
-
-    void upsertTutorsConnectLatestLo(loRecord);
-  },
+  sendLoEvent(course: Course, lo: Lo, student: TutorsId) {},
 };
 

[NoCoverage] EqualityOperator
services/community/services/presence.svelte.ts:79:18
       loRoute: lo.route,
       user: getUser(student),
       type: lo.type,
-      isPrivate: (course.properties?.private as unknown as number) === 1
+      isPrivate: course.properties?.private as unknown as number !== 1
     };
     if (lo.icon) {

[NoCoverage] ConditionalExpression
services/community/services/presence.svelte.ts:79:18
       loRoute: lo.route,
       user: getUser(student),
       type: lo.type,
-      isPrivate: (course.properties?.private as unknown as number) === 1
+      isPrivate: false
     };
     if (lo.icon) {

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:81:18
       type: lo.type,
       isPrivate: (course.properties?.private as unknown as number) === 1
     };
-    if (lo.icon) {
-      loRecord.icon = lo.icon;
-    }
+    if (lo.icon) {}
     const loRecordJson = JSON.stringify(loRecord);
     this.partyKitAll.send(loRecordJson);

[NoCoverage] ConditionalExpression
services/community/services/presence.svelte.ts:81:9
       type: lo.type,
       isPrivate: (course.properties?.private as unknown as number) === 1
     };
-    if (lo.icon) {
+    if (true) {
       loRecord.icon = lo.icon;
     }

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:87:34
     const loRecordJson = JSON.stringify(loRecord);
     this.partyKitAll.send(loRecordJson);
     this.partyKitCourse.room = course.courseId;
-    if (this.listeningTo !== "") {
-      this.partyKitCourse.send(loRecordJson);
-    }
+    if (this.listeningTo !== "") {}
 
     void upsertTutorsConnectLatestLo(loRecord);

[NoCoverage] ConditionalExpression
services/community/services/presence.svelte.ts:87:9
     const loRecordJson = JSON.stringify(loRecord);
     this.partyKitAll.send(loRecordJson);
     this.partyKitCourse.room = course.courseId;
-    if (this.listeningTo !== "") {
+    if (true) {
       this.partyKitCourse.send(loRecordJson);
     }

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:100:75
  * @param loEvent - Existing record to update
  * @param nextLoEvent - New event data
  */
-export function refreshLoRecord(loEvent: LoRecord, nextLoEvent: LoRecord) {
-  loEvent.loRoute = `https://tutors.dev${nextLoEvent.loRoute}`;
-  loEvent.title = nextLoEvent.title;
-  loEvent.type = nextLoEvent.type;
-  loEvent.user = nextLoEvent.user;
-  if (nextLoEvent.icon) {
-    loEvent.icon = nextLoEvent.icon;
-    loEvent.img = undefined;
-  } else {
-    loEvent.img = nextLoEvent.img;
-    loEvent.icon = undefined;
-  }
-}
+export function refreshLoRecord(loEvent: LoRecord, nextLoEvent: LoRecord) {}
 
 /**

[NoCoverage] StringLiteral
services/community/services/presence.svelte.ts:101:21
  * @param nextLoEvent - New event data
  */
 export function refreshLoRecord(loEvent: LoRecord, nextLoEvent: LoRecord) {
-  loEvent.loRoute = `https://tutors.dev${nextLoEvent.loRoute}`;
+  loEvent.loRoute = ``;
   loEvent.title = nextLoEvent.title;
   loEvent.type = nextLoEvent.type;

[NoCoverage] ConditionalExpression
services/community/services/presence.svelte.ts:105:7
   loEvent.title = nextLoEvent.title;
   loEvent.type = nextLoEvent.type;
   loEvent.user = nextLoEvent.user;
-  if (nextLoEvent.icon) {
+  if (true) {
     loEvent.icon = nextLoEvent.icon;
     loEvent.img = undefined;

[NoCoverage] ConditionalExpression
services/community/services/presence.svelte.ts:105:7
   loEvent.title = nextLoEvent.title;
   loEvent.type = nextLoEvent.type;
   loEvent.user = nextLoEvent.user;
-  if (nextLoEvent.icon) {
+  if (false) {
     loEvent.icon = nextLoEvent.icon;
     loEvent.img = undefined;

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:108:10
   if (nextLoEvent.icon) {
     loEvent.icon = nextLoEvent.icon;
     loEvent.img = undefined;
-  } else {
-    loEvent.img = nextLoEvent.img;
-    loEvent.icon = undefined;
-  }
+  } else {}
 }
 

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:120:46
  * @param tutorsId - User identity information
  * @returns LoUser object for presence tracking
  */
-function getUser(tutorsId: TutorsId): LoUser {
-  const user: LoUser = {
-    fullName: "Anon",
-    avatar: "https://tutors.dev/logo.svg",
-    id: getTutorsTimeId(),
-    sentiment: "neutral"
-  };
-  if (tutorsId.share) {
-    user.fullName = tutorsId.name;
-    user.avatar = tutorsId.image;
-    user.id = tutorsId.login;
-    user.sentiment = tutorsId.sentiment ?? "neutral";
-  }
-  return user;
-}
+function getUser(tutorsId: TutorsId): LoUser {}
 
 /**

[NoCoverage] ObjectLiteral
services/community/services/presence.svelte.ts:121:24
  * @returns LoUser object for presence tracking
  */
 function getUser(tutorsId: TutorsId): LoUser {
-  const user: LoUser = {
-    fullName: "Anon",
-    avatar: "https://tutors.dev/logo.svg",
-    id: getTutorsTimeId(),
-    sentiment: "neutral"
-  };
+  const user: LoUser = {};
   if (tutorsId.share) {
     user.fullName = tutorsId.name;

[NoCoverage] ConditionalExpression
services/community/services/presence.svelte.ts:127:7
     id: getTutorsTimeId(),
     sentiment: "neutral"
   };
-  if (tutorsId.share) {
+  if (true) {
     user.fullName = tutorsId.name;
     user.avatar = tutorsId.image;

[NoCoverage] ConditionalExpression
services/community/services/presence.svelte.ts:127:7
     id: getTutorsTimeId(),
     sentiment: "neutral"
   };
-  if (tutorsId.share) {
+  if (false) {
     user.fullName = tutorsId.name;
     user.avatar = tutorsId.image;

[NoCoverage] LogicalOperator
services/community/services/presence.svelte.ts:131:22
     user.fullName = tutorsId.name;
     user.avatar = tutorsId.image;
     user.id = tutorsId.login;
-    user.sentiment = tutorsId.sentiment ?? "neutral";
+    user.sentiment = tutorsId.sentiment && "neutral";
   }
   return user;

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:140:33
  * Generates a unique identifier for anonymous users
  * @returns UUID v4 string
  */
-function generateTutorsTimeId() {
-  return "xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx".replace(/[xy]/g, (c) => {
-    const r = (Math.random() * 16) | 0;
-    const v = c === "x" ? r : (r & 0x3) | 0x8;
-    return v.toString(16);
-  });
-}
+function generateTutorsTimeId() {}
 
 /**

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:141:73
  * @returns UUID v4 string
  */
 function generateTutorsTimeId() {
-  return "xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx".replace(/[xy]/g, (c) => {
-    const r = (Math.random() * 16) | 0;
-    const v = c === "x" ? r : (r & 0x3) | 0x8;
-    return v.toString(16);
-  });
+  return "xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx".replace(/[xy]/g, (c) => {});
 }
 

[NoCoverage] ArithmeticOperator
services/community/services/presence.svelte.ts:142:16
  */
 function generateTutorsTimeId() {
   return "xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx".replace(/[xy]/g, (c) => {
-    const r = (Math.random() * 16) | 0;
+    const r = (Math.random() / 16) | 0;
     const v = c === "x" ? r : (r & 0x3) | 0x8;
     return v.toString(16);

[NoCoverage] ConditionalExpression
services/community/services/presence.svelte.ts:143:15
 function generateTutorsTimeId() {
   return "xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx".replace(/[xy]/g, (c) => {
     const r = (Math.random() * 16) | 0;
-    const v = c === "x" ? r : (r & 0x3) | 0x8;
+    const v = true ? r : (r & 0x3) | 0x8;
     return v.toString(16);
   });

[NoCoverage] ConditionalExpression
services/community/services/presence.svelte.ts:143:15
 function generateTutorsTimeId() {
   return "xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx".replace(/[xy]/g, (c) => {
     const r = (Math.random() * 16) | 0;
-    const v = c === "x" ? r : (r & 0x3) | 0x8;
+    const v = false ? r : (r & 0x3) | 0x8;
     return v.toString(16);
   });

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:152:28
  * Gets or creates a persistent anonymous user identifier
  * @returns Stored or new UUID
  */
-function getTutorsTimeId() {
-  if (!window.localStorage.tutorsTimeId) {
-    window.localStorage.tutorsTimeId = generateTutorsTimeId();
-  }
-  return window.localStorage.tutorsTimeId;
-}
+function getTutorsTimeId() {}
 

[NoCoverage] BlockStatement
services/community/services/presence.svelte.ts:153:42
  * @returns Stored or new UUID
  */
 function getTutorsTimeId() {
-  if (!window.localStorage.tutorsTimeId) {
-    window.localStorage.tutorsTimeId = generateTutorsTimeId();
-  }
+  if (!window.localStorage.tutorsTimeId) {}
   return window.localStorage.tutorsTimeId;
 }

[NoCoverage] BooleanLiteral
services/community/services/presence.svelte.ts:153:7
  * @returns Stored or new UUID
  */
 function getTutorsTimeId() {
-  if (!window.localStorage.tutorsTimeId) {
+  if (window.localStorage.tutorsTimeId) {
     window.localStorage.tutorsTimeId = generateTutorsTimeId();
   }
