[NoCoverage] StringLiteral
lib/services/community/types.svelte.ts:20:30
  */
 export class LoRecord {
   courseId: string = $state("");
-  courseUrl: string = $state("");
+  courseUrl: string = $state("Stryker was here!");
   courseTitle: string = $state("");
   loRoute: string = $state("");

[NoCoverage] StringLiteral
lib/services/community/types.svelte.ts:23:26
   courseUrl: string = $state("");
   courseTitle: string = $state("");
   loRoute: string = $state("");
-  title: string = $state("");
+  title: string = $state("Stryker was here!");
   img?: string = $state("");
   icon?: IconType = $state();

[NoCoverage] BooleanLiteral
lib/services/community/types.svelte.ts:26:31
   title: string = $state("");
   img?: string = $state("");
   icon?: IconType = $state();
-  isPrivate: boolean = $state(false);
+  isPrivate: boolean = $state(true);
   user?: LoUser = $state<LoUser | undefined>();
   type: string = $state("");

[NoCoverage] StringLiteral
lib/services/community/types.svelte.ts:28:25
   icon?: IconType = $state();
   isPrivate: boolean = $state(false);
   user?: LoUser = $state<LoUser | undefined>();
-  type: string = $state("");
+  type: string = $state("Stryker was here!");
 
   constructor(data: any) {

[NoCoverage] BlockStatement
lib/services/community/types.svelte.ts:30:26
   user?: LoUser = $state<LoUser | undefined>();
   type: string = $state("");
 
-  constructor(data: any) {
-    Object.assign(this, data);
-  }
+  constructor(data: any) {}
 }
 
