[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:17:5
 
 export let supabase: SupabaseClient;
 
-if (PUBLIC_ANON_MODE !== "TRUE") {
+if (false) {
   supabase = createClient(PUBLIC_SUPABASE_URL, PUBLIC_SUPABASE_ANON_KEY);
 }

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:17:5
 
 export let supabase: SupabaseClient;
 
-if (PUBLIC_ANON_MODE !== "TRUE") {
+if (true) {
   supabase = createClient(PUBLIC_SUPABASE_URL, PUBLIC_SUPABASE_ANON_KEY);
 }

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:22:47
 }
 
 
-export function localYyyyMmDd(d = new Date()) {
-  const y = d.getFullYear();
-  const m = String(d.getMonth() + 1).padStart(2, "0");
-  const day = String(d.getDate()).padStart(2, "0");
-  return `${y}-${m}-${day}`;
-}
+export function localYyyyMmDd(d = new Date()) {}
 
 export function instantLocalYmd(iso: string | null | undefined): string | null {

[NoCoverage] ArithmeticOperator
services/community/utils/supabase-client.ts:24:20
 
 export function localYyyyMmDd(d = new Date()) {
   const y = d.getFullYear();
-  const m = String(d.getMonth() + 1).padStart(2, "0");
+  const m = String(d.getMonth() - 1).padStart(2, "0");
   const day = String(d.getDate()).padStart(2, "0");
   return `${y}-${m}-${day}`;

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:29:80
   return `${y}-${m}-${day}`;
 }
 
-export function instantLocalYmd(iso: string | null | undefined): string | null {
-  if (!iso?.trim()) return null;
-  try {
-    const d = new Date(iso.trim());
-    if (!Number.isFinite(d.getTime())) return null;
-    return localYyyyMmDd(d);
-  } catch {
-    return null;
-  }
-}
+export function instantLocalYmd(iso: string | null | undefined): string | null {}
 
 function startOfLocalMondayWeek(d: Date): number {

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:30:7
 }
 
 export function instantLocalYmd(iso: string | null | undefined): string | null {
-  if (!iso?.trim()) return null;
+  if (false) return null;
   try {
     const d = new Date(iso.trim());

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:30:7
 }
 
 export function instantLocalYmd(iso: string | null | undefined): string | null {
-  if (!iso?.trim()) return null;
+  if (true) return null;
   try {
     const d = new Date(iso.trim());

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:31:7
 
 export function instantLocalYmd(iso: string | null | undefined): string | null {
   if (!iso?.trim()) return null;
-  try {
-    const d = new Date(iso.trim());
-    if (!Number.isFinite(d.getTime())) return null;
-    return localYyyyMmDd(d);
-  } catch {
+  try {} catch {
     return null;
   }

[NoCoverage] MethodExpression
services/community/utils/supabase-client.ts:32:24
 export function instantLocalYmd(iso: string | null | undefined): string | null {
   if (!iso?.trim()) return null;
   try {
-    const d = new Date(iso.trim());
+    const d = new Date(iso);
     if (!Number.isFinite(d.getTime())) return null;
     return localYyyyMmDd(d);

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:33:9
   if (!iso?.trim()) return null;
   try {
     const d = new Date(iso.trim());
-    if (!Number.isFinite(d.getTime())) return null;
+    if (false) return null;
     return localYyyyMmDd(d);
   } catch {

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:33:9
   if (!iso?.trim()) return null;
   try {
     const d = new Date(iso.trim());
-    if (!Number.isFinite(d.getTime())) return null;
+    if (true) return null;
     return localYyyyMmDd(d);
   } catch {

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:35:11
     const d = new Date(iso.trim());
     if (!Number.isFinite(d.getTime())) return null;
     return localYyyyMmDd(d);
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:40:50
   }
 }
 
-function startOfLocalMondayWeek(d: Date): number {
-  const copy = new Date(d.getFullYear(), d.getMonth(), d.getDate());
-  const day = copy.getDay();
-  const diff = day === 0 ? -6 : 1 - day;
-  copy.setDate(copy.getDate() + diff);
-  copy.setHours(0, 0, 0, 0);
-  return copy.getTime();
-}
+function startOfLocalMondayWeek(d: Date): number {}
 
 /** Local calendar day match (same semantics as `localYyyyMmDd` / `instantLocalYmd`). */

[NoCoverage] UnaryOperator
services/community/utils/supabase-client.ts:43:28
 function startOfLocalMondayWeek(d: Date): number {
   const copy = new Date(d.getFullYear(), d.getMonth(), d.getDate());
   const day = copy.getDay();
-  const diff = day === 0 ? -6 : 1 - day;
+  const diff = day === 0 ? +6 : 1 - day;
   copy.setDate(copy.getDate() + diff);
   copy.setHours(0, 0, 0, 0);

[NoCoverage] EqualityOperator
services/community/utils/supabase-client.ts:43:16
 function startOfLocalMondayWeek(d: Date): number {
   const copy = new Date(d.getFullYear(), d.getMonth(), d.getDate());
   const day = copy.getDay();
-  const diff = day === 0 ? -6 : 1 - day;
+  const diff = day !== 0 ? -6 : 1 - day;
   copy.setDate(copy.getDate() + diff);
   copy.setHours(0, 0, 0, 0);

[NoCoverage] ArithmeticOperator
services/community/utils/supabase-client.ts:44:16
   const copy = new Date(d.getFullYear(), d.getMonth(), d.getDate());
   const day = copy.getDay();
   const diff = day === 0 ? -6 : 1 - day;
-  copy.setDate(copy.getDate() + diff);
+  copy.setDate(copy.getDate() - diff);
   copy.setHours(0, 0, 0, 0);
   return copy.getTime();

[NoCoverage] MethodExpression
services/community/utils/supabase-client.ts:44:3
   const copy = new Date(d.getFullYear(), d.getMonth(), d.getDate());
   const day = copy.getDay();
   const diff = day === 0 ? -6 : 1 - day;
-  copy.setDate(copy.getDate() + diff);
+  copy.setTime(copy.getDate() + diff);
   copy.setHours(0, 0, 0, 0);
   return copy.getTime();

[NoCoverage] MethodExpression
services/community/utils/supabase-client.ts:45:3
   const day = copy.getDay();
   const diff = day === 0 ? -6 : 1 - day;
   copy.setDate(copy.getDate() + diff);
-  copy.setHours(0, 0, 0, 0);
+  copy.setMinutes(0, 0, 0, 0);
   return copy.getTime();
 }

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:53:12
 export function isReceivedAtOnLocalDay(
   iso: string | null | undefined,
   ref = new Date()
-): boolean {
-  const ymd = instantLocalYmd(iso);
-  if (!ymd) return false;
-  return ymd === localYyyyMmDd(ref);
-}
+): boolean {}
 
 /** Local week starting Monday, through Sunday. */

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:55:7
   ref = new Date()
 ): boolean {
   const ymd = instantLocalYmd(iso);
-  if (!ymd) return false;
+  if (false) return false;
   return ymd === localYyyyMmDd(ref);
 }

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:55:7
   ref = new Date()
 ): boolean {
   const ymd = instantLocalYmd(iso);
-  if (!ymd) return false;
+  if (ymd) return false;
   return ymd === localYyyyMmDd(ref);
 }

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:56:10
 ): boolean {
   const ymd = instantLocalYmd(iso);
   if (!ymd) return false;
-  return ymd === localYyyyMmDd(ref);
+  return true;
 }
 

[NoCoverage] EqualityOperator
services/community/utils/supabase-client.ts:56:10
 ): boolean {
   const ymd = instantLocalYmd(iso);
   if (!ymd) return false;
-  return ymd === localYyyyMmDd(ref);
+  return ymd !== localYyyyMmDd(ref);
 }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:63:12
 export function isReceivedAtInLocalWeek(
   iso: string | null | undefined,
   ref = new Date()
-): boolean {
-  if (!iso?.trim()) return false;
-  const d = new Date(iso.trim());
-  if (!Number.isFinite(d.getTime())) return false;
-  return startOfLocalMondayWeek(d) === startOfLocalMondayWeek(ref);
-}
+): boolean {}
 
 export function isReceivedAtInLocalMonth(

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:64:7
   iso: string | null | undefined,
   ref = new Date()
 ): boolean {
-  if (!iso?.trim()) return false;
+  if (true) return false;
   const d = new Date(iso.trim());
   if (!Number.isFinite(d.getTime())) return false;

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:64:7
   iso: string | null | undefined,
   ref = new Date()
 ): boolean {
-  if (!iso?.trim()) return false;
+  if (false) return false;
   const d = new Date(iso.trim());
   if (!Number.isFinite(d.getTime())) return false;

[NoCoverage] MethodExpression
services/community/utils/supabase-client.ts:65:22
   ref = new Date()
 ): boolean {
   if (!iso?.trim()) return false;
-  const d = new Date(iso.trim());
+  const d = new Date(iso);
   if (!Number.isFinite(d.getTime())) return false;
   return startOfLocalMondayWeek(d) === startOfLocalMondayWeek(ref);

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:66:7
 ): boolean {
   if (!iso?.trim()) return false;
   const d = new Date(iso.trim());
-  if (!Number.isFinite(d.getTime())) return false;
+  if (Number.isFinite(d.getTime())) return false;
   return startOfLocalMondayWeek(d) === startOfLocalMondayWeek(ref);
 }

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:66:7
 ): boolean {
   if (!iso?.trim()) return false;
   const d = new Date(iso.trim());
-  if (!Number.isFinite(d.getTime())) return false;
+  if (false) return false;
   return startOfLocalMondayWeek(d) === startOfLocalMondayWeek(ref);
 }

[NoCoverage] EqualityOperator
services/community/utils/supabase-client.ts:67:10
   if (!iso?.trim()) return false;
   const d = new Date(iso.trim());
   if (!Number.isFinite(d.getTime())) return false;
-  return startOfLocalMondayWeek(d) === startOfLocalMondayWeek(ref);
+  return startOfLocalMondayWeek(d) !== startOfLocalMondayWeek(ref);
 }
 

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:67:10
   if (!iso?.trim()) return false;
   const d = new Date(iso.trim());
   if (!Number.isFinite(d.getTime())) return false;
-  return startOfLocalMondayWeek(d) === startOfLocalMondayWeek(ref);
+  return true;
 }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:73:12
 export function isReceivedAtInLocalMonth(
   iso: string | null | undefined,
   ref = new Date()
-): boolean {
-  if (!iso?.trim()) return false;
-  const d = new Date(iso.trim());
-  if (!Number.isFinite(d.getTime())) return false;
-  return d.getFullYear() === ref.getFullYear() && d.getMonth() === ref.getMonth();
-}
+): boolean {}
 
 export function isReceivedAtInLocalYear(

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:74:28
   iso: string | null | undefined,
   ref = new Date()
 ): boolean {
-  if (!iso?.trim()) return false;
+  if (!iso?.trim()) return true;
   const d = new Date(iso.trim());
   if (!Number.isFinite(d.getTime())) return false;

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:76:45
 ): boolean {
   if (!iso?.trim()) return false;
   const d = new Date(iso.trim());
-  if (!Number.isFinite(d.getTime())) return false;
+  if (!Number.isFinite(d.getTime())) return true;
   return d.getFullYear() === ref.getFullYear() && d.getMonth() === ref.getMonth();
 }

[NoCoverage] EqualityOperator
services/community/utils/supabase-client.ts:77:10
   if (!iso?.trim()) return false;
   const d = new Date(iso.trim());
   if (!Number.isFinite(d.getTime())) return false;
-  return d.getFullYear() === ref.getFullYear() && d.getMonth() === ref.getMonth();
+  return d.getFullYear() !== ref.getFullYear() && d.getMonth() === ref.getMonth();
 }
 

[NoCoverage] LogicalOperator
services/community/utils/supabase-client.ts:77:10
   if (!iso?.trim()) return false;
   const d = new Date(iso.trim());
   if (!Number.isFinite(d.getTime())) return false;
-  return d.getFullYear() === ref.getFullYear() && d.getMonth() === ref.getMonth();
+  return d.getFullYear() === ref.getFullYear() || d.getMonth() === ref.getMonth();
 }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:83:12
 export function isReceivedAtInLocalYear(
   iso: string | null | undefined,
   ref = new Date()
-): boolean {
-  if (!iso?.trim()) return false;
-  const d = new Date(iso.trim());
-  if (!Number.isFinite(d.getTime())) return false;
-  return d.getFullYear() === ref.getFullYear();
-}
+): boolean {}
 
 /**

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:86:7
 ): boolean {
   if (!iso?.trim()) return false;
   const d = new Date(iso.trim());
-  if (!Number.isFinite(d.getTime())) return false;
+  if (true) return false;
   return d.getFullYear() === ref.getFullYear();
 }

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:87:10
   if (!iso?.trim()) return false;
   const d = new Date(iso.trim());
   if (!Number.isFinite(d.getTime())) return false;
-  return d.getFullYear() === ref.getFullYear();
+  return false;
 }
 

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:87:10
   if (!iso?.trim()) return false;
   const d = new Date(iso.trim());
   if (!Number.isFinite(d.getTime())) return false;
-  return d.getFullYear() === ref.getFullYear();
+  return true;
 }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:94:84
  * Upsert latest Lo snapshot for (course, student) into tutors-connect-latest.
  * Fire-and-forget from presence; does not throw.
  */
-export async function upsertTutorsConnectLatestLo(loRecord: object): Promise<void> {
-  if (PUBLIC_ANON_MODE === "TRUE" || typeof supabase === "undefined") return;
-
-  const rec = loRecord as { courseId?: string; user?: { id?: string } };
-  const courseId = rec.courseId?.trim();
-  const studentId = rec.user?.id?.trim();
-  if (!courseId || !studentId) return;
-
-  const { error } = await supabase.from("tutors-connect-latest").upsert(
-    {
-      course_id: courseId,
-      student_id: studentId,
-      payload: loRecord,
-      received_at: new Date().toISOString(),
-    },
-    { onConflict: "course_id,student_id" }
-  );
-
-  if (error) {
-    console.error("upsertTutorsConnectLatestLo failed:", error);
-  }
-}
+export async function upsertTutorsConnectLatestLo(loRecord: object): Promise<void> {}
 
 

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:95:38
  * Fire-and-forget from presence; does not throw.
  */
 export async function upsertTutorsConnectLatestLo(loRecord: object): Promise<void> {
-  if (PUBLIC_ANON_MODE === "TRUE" || typeof supabase === "undefined") return;
+  if (PUBLIC_ANON_MODE === "TRUE" || false) return;
 
   const rec = loRecord as { courseId?: string; user?: { id?: string } };

[NoCoverage] LogicalOperator
services/community/utils/supabase-client.ts:95:7
  * Fire-and-forget from presence; does not throw.
  */
 export async function upsertTutorsConnectLatestLo(loRecord: object): Promise<void> {
-  if (PUBLIC_ANON_MODE === "TRUE" || typeof supabase === "undefined") return;
+  if (PUBLIC_ANON_MODE === "TRUE" && typeof supabase === "undefined") return;
 
   const rec = loRecord as { courseId?: string; user?: { id?: string } };

[NoCoverage] MethodExpression
services/community/utils/supabase-client.ts:98:20
   if (PUBLIC_ANON_MODE === "TRUE" || typeof supabase === "undefined") return;
 
   const rec = loRecord as { courseId?: string; user?: { id?: string } };
-  const courseId = rec.courseId?.trim();
+  const courseId = rec.courseId;
   const studentId = rec.user?.id?.trim();
   if (!courseId || !studentId) return;

[NoCoverage] OptionalChaining
services/community/utils/supabase-client.ts:98:20
   if (PUBLIC_ANON_MODE === "TRUE" || typeof supabase === "undefined") return;
 
   const rec = loRecord as { courseId?: string; user?: { id?: string } };
-  const courseId = rec.courseId?.trim();
+  const courseId = rec.courseId.trim();
   const studentId = rec.user?.id?.trim();
   if (!courseId || !studentId) return;

[NoCoverage] OptionalChaining
services/community/utils/supabase-client.ts:99:21
 
   const rec = loRecord as { courseId?: string; user?: { id?: string } };
   const courseId = rec.courseId?.trim();
-  const studentId = rec.user?.id?.trim();
+  const studentId = rec.user?.id.trim();
   if (!courseId || !studentId) return;
 

[NoCoverage] OptionalChaining
services/community/utils/supabase-client.ts:99:21
 
   const rec = loRecord as { courseId?: string; user?: { id?: string } };
   const courseId = rec.courseId?.trim();
-  const studentId = rec.user?.id?.trim();
+  const studentId = rec.user.id?.trim();
   if (!courseId || !studentId) return;
 

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:100:20
   const rec = loRecord as { courseId?: string; user?: { id?: string } };
   const courseId = rec.courseId?.trim();
   const studentId = rec.user?.id?.trim();
-  if (!courseId || !studentId) return;
+  if (!courseId || studentId) return;
 
   const { error } = await supabase.from("tutors-connect-latest").upsert(

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:100:7
   const rec = loRecord as { courseId?: string; user?: { id?: string } };
   const courseId = rec.courseId?.trim();
   const studentId = rec.user?.id?.trim();
-  if (!courseId || !studentId) return;
+  if (courseId || !studentId) return;
 
   const { error } = await supabase.from("tutors-connect-latest").upsert(

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:102:41
   const studentId = rec.user?.id?.trim();
   if (!courseId || !studentId) return;
 
-  const { error } = await supabase.from("tutors-connect-latest").upsert(
+  const { error } = await supabase.from("").upsert(
     {
       course_id: courseId,

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:109:19
       payload: loRecord,
       received_at: new Date().toISOString(),
     },
-    { onConflict: "course_id,student_id" }
+    { onConflict: "" }
   );
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:112:14
     { onConflict: "course_id,student_id" }
   );
 
-  if (error) {
-    console.error("upsertTutorsConnectLatestLo failed:", error);
-  }
+  if (error) {}
 }
 

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:113:19
   );
 
   if (error) {
-    console.error("upsertTutorsConnectLatestLo failed:", error);
+    console.error("", error);
   }
 }

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:125:38
  */
 export async function getTutorsConnectLatestLosByCourseId(
   courseId: string
-): Promise<TutorsConnectLatestRow[]> {
-  if (PUBLIC_ANON_MODE === "TRUE" || typeof supabase === "undefined") return [];
-
-  const id = courseId?.trim();
-  if (!id) return [];
-
-  const { data, error } = await supabase
-    .from("tutors-connect-latest")
-    .select("course_id, student_id, payload, received_at")
-    .eq("course_id", id)
-    .order("received_at", { ascending: false });
-
-  if (error) {
-    console.error("getTutorsConnectLatestLosByCourseId failed:", error);
-    return [];
-  }
-
-  return (data ?? []) as TutorsConnectLatestRow[];
-}
+): Promise<TutorsConnectLatestRow[]> {}
 
 /**

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:126:38
 export async function getTutorsConnectLatestLosByCourseId(
   courseId: string
 ): Promise<TutorsConnectLatestRow[]> {
-  if (PUBLIC_ANON_MODE === "TRUE" || typeof supabase === "undefined") return [];
+  if (PUBLIC_ANON_MODE === "TRUE" || false) return [];
 
   const id = courseId?.trim();

[NoCoverage] EqualityOperator
services/community/utils/supabase-client.ts:126:7
 export async function getTutorsConnectLatestLosByCourseId(
   courseId: string
 ): Promise<TutorsConnectLatestRow[]> {
-  if (PUBLIC_ANON_MODE === "TRUE" || typeof supabase === "undefined") return [];
+  if (PUBLIC_ANON_MODE !== "TRUE" || typeof supabase === "undefined") return [];
 
   const id = courseId?.trim();

[NoCoverage] OptionalChaining
services/community/utils/supabase-client.ts:128:14
 ): Promise<TutorsConnectLatestRow[]> {
   if (PUBLIC_ANON_MODE === "TRUE" || typeof supabase === "undefined") return [];
 
-  const id = courseId?.trim();
+  const id = courseId.trim();
   if (!id) return [];
 

[NoCoverage] MethodExpression
services/community/utils/supabase-client.ts:128:14
 ): Promise<TutorsConnectLatestRow[]> {
   if (PUBLIC_ANON_MODE === "TRUE" || typeof supabase === "undefined") return [];
 
-  const id = courseId?.trim();
+  const id = courseId;
   if (!id) return [];
 

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:129:7
   if (PUBLIC_ANON_MODE === "TRUE" || typeof supabase === "undefined") return [];
 
   const id = courseId?.trim();
-  if (!id) return [];
+  if (id) return [];
 
   const { data, error } = await supabase

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:129:7
   if (PUBLIC_ANON_MODE === "TRUE" || typeof supabase === "undefined") return [];
 
   const id = courseId?.trim();
-  if (!id) return [];
+  if (true) return [];
 
   const { data, error } = await supabase

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:132:11
   if (!id) return [];
 
   const { data, error } = await supabase
-    .from("tutors-connect-latest")
+    .from("")
     .select("course_id, student_id, payload, received_at")
     .eq("course_id", id)

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:135:40
     .from("tutors-connect-latest")
     .select("course_id, student_id, payload, received_at")
     .eq("course_id", id)
-    .order("received_at", { ascending: false });
+    .order("received_at", { ascending: true });
 
   if (error) {

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:154:127
  * @param loId - Identifier of the learning object
  * @returns Promise resolving to the number of increments
  */
-export async function getNumOfLearningRecordsIncrements(fieldName: string, courseId: string, studentId: string, loId: string) {
-  if (!courseId || !studentId || !loId) return 0;
-
-  const { data: student, error } = await supabase.rpc("get_count_learning_records", {
-    field_name: fieldName,
-    course_base: courseId,
-    user_name: studentId,
-    lo_key: loId
-  });
-
-  if (error) {
-    console.error("Error fetching student interaction:", error);
-    return 0;
-  }
-  return student ? student[0].increment + 1 : 1;
-}
+export async function getNumOfLearningRecordsIncrements(fieldName: string, courseId: string, studentId: string, loId: string) {}
 
 /**

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:155:20
  * @returns Promise resolving to the number of increments
  */
 export async function getNumOfLearningRecordsIncrements(fieldName: string, courseId: string, studentId: string, loId: string) {
-  if (!courseId || !studentId || !loId) return 0;
+  if (!courseId || studentId || !loId) return 0;
 
   const { data: student, error } = await supabase.rpc("get_count_learning_records", {

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:155:7
  * @returns Promise resolving to the number of increments
  */
 export async function getNumOfLearningRecordsIncrements(fieldName: string, courseId: string, studentId: string, loId: string) {
-  if (!courseId || !studentId || !loId) return 0;
+  if (false) return 0;
 
   const { data: student, error } = await supabase.rpc("get_count_learning_records", {

[NoCoverage] ObjectLiteral
services/community/utils/supabase-client.ts:157:85
 export async function getNumOfLearningRecordsIncrements(fieldName: string, courseId: string, studentId: string, loId: string) {
   if (!courseId || !studentId || !loId) return 0;
 
-  const { data: student, error } = await supabase.rpc("get_count_learning_records", {
-    field_name: fieldName,
-    course_base: courseId,
-    user_name: studentId,
-    lo_key: loId
-  });
+  const { data: student, error } = await supabase.rpc("get_count_learning_records", {});
 
   if (error) {

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:164:14
     lo_key: loId
   });
 
-  if (error) {
-    console.error("Error fetching student interaction:", error);
-    return 0;
-  }
+  if (error) {}
   return student ? student[0].increment + 1 : 1;
 }

[NoCoverage] ArithmeticOperator
services/community/utils/supabase-client.ts:168:20
     console.error("Error fetching student interaction:", error);
     return 0;
   }
-  return student ? student[0].increment + 1 : 1;
+  return student ? student[0].increment - 1 : 1;
 }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:180:104
  * @param loId - Identifier of the learning object
  * @param lo - Learning object data
  */
-export async function manageStudentCourseLo(courseId: string, studentId: string, loId: string, lo: Lo) {
-  const durationPromise = getNumOfLearningRecordsIncrements("duration", courseId, studentId, loId);
-  const countPromise = getNumOfLearningRecordsIncrements("count", courseId, studentId, loId);
-  const [duration, count] = await Promise.all([durationPromise, countPromise]);
-  const { error } = await supabase.from("learning_records").upsert(
-    {
-      course_id: courseId,
-      student_id: studentId,
-      lo_id: loId,
-      date_last_accessed: new Date().toISOString(),
-      duration: duration,
-      count: count,
-      type: lo.type
-    },
-    {
-      onConflict: "student_id, course_id, lo_id",
-      ignoreDuplicates: false
-    }
-  );
-  if (error) {
-    console.log(error);
-    throw error;
-  }
-}
+export async function manageStudentCourseLo(courseId: string, studentId: string, loId: string, lo: Lo) {}
 
 /**

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:184:41
   const durationPromise = getNumOfLearningRecordsIncrements("duration", courseId, studentId, loId);
   const countPromise = getNumOfLearningRecordsIncrements("count", courseId, studentId, loId);
   const [duration, count] = await Promise.all([durationPromise, countPromise]);
-  const { error } = await supabase.from("learning_records").upsert(
+  const { error } = await supabase.from("").upsert(
     {
       course_id: courseId,

[NoCoverage] ObjectLiteral
services/community/utils/supabase-client.ts:185:5
   const countPromise = getNumOfLearningRecordsIncrements("count", courseId, studentId, loId);
   const [duration, count] = await Promise.all([durationPromise, countPromise]);
   const { error } = await supabase.from("learning_records").upsert(
-    {
-      course_id: courseId,
-      student_id: studentId,
-      lo_id: loId,
-      date_last_accessed: new Date().toISOString(),
-      duration: duration,
-      count: count,
-      type: lo.type
-    },
+    {},
     {
       onConflict: "student_id, course_id, lo_id",

[NoCoverage] ObjectLiteral
services/community/utils/supabase-client.ts:194:5
       count: count,
       type: lo.type
     },
-    {
-      onConflict: "student_id, course_id, lo_id",
-      ignoreDuplicates: false
-    }
+    {}
   );
   if (error) {

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:195:19
       type: lo.type
     },
     {
-      onConflict: "student_id, course_id, lo_id",
+      onConflict: "",
       ignoreDuplicates: false
     }

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:196:25
     },
     {
       onConflict: "student_id, course_id, lo_id",
-      ignoreDuplicates: false
+      ignoreDuplicates: true
     }
   );

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:199:7
       ignoreDuplicates: false
     }
   );
-  if (error) {
+  if (true) {
     console.log(error);
     throw error;

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:199:7
       ignoreDuplicates: false
     }
   );
-  if (error) {
+  if (false) {
     console.log(error);
     throw error;

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:210:48
  * @param date - Date to format
  * @returns Formatted date string
  */
-export function formatDate(date: Date): string {
-  const d = new Date(date);
-  const year = d.getFullYear().toString();
-  let month = (d.getMonth() + 1).toString();
-  let day = d.getDate().toString();
-  if (month.length < 2) month = "0" + month;
-  if (day.length < 2) day = "0" + day;
-  return [year, month, day].join("-");
-}
+export function formatDate(date: Date): string {}
 
 /**

[NoCoverage] ArithmeticOperator
services/community/utils/supabase-client.ts:213:16
 export function formatDate(date: Date): string {
   const d = new Date(date);
   const year = d.getFullYear().toString();
-  let month = (d.getMonth() + 1).toString();
+  let month = (d.getMonth() - 1).toString();
   let day = d.getDate().toString();
   if (month.length < 2) month = "0" + month;

[NoCoverage] EqualityOperator
services/community/utils/supabase-client.ts:215:7
   const year = d.getFullYear().toString();
   let month = (d.getMonth() + 1).toString();
   let day = d.getDate().toString();
-  if (month.length < 2) month = "0" + month;
+  if (month.length <= 2) month = "0" + month;
   if (day.length < 2) day = "0" + day;
   return [year, month, day].join("-");

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:215:7
   const year = d.getFullYear().toString();
   let month = (d.getMonth() + 1).toString();
   let day = d.getDate().toString();
-  if (month.length < 2) month = "0" + month;
+  if (true) month = "0" + month;
   if (day.length < 2) day = "0" + day;
   return [year, month, day].join("-");
