[NoCoverage] EqualityOperator
services/community/utils/supabase-client.ts:216:7
   let month = (d.getMonth() + 1).toString();
   let day = d.getDate().toString();
   if (month.length < 2) month = "0" + month;
-  if (day.length < 2) day = "0" + day;
+  if (day.length <= 2) day = "0" + day;
   return [year, month, day].join("-");
 }

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:216:7
   let month = (d.getMonth() + 1).toString();
   let day = d.getDate().toString();
   if (month.length < 2) month = "0" + month;
-  if (day.length < 2) day = "0" + day;
+  if (true) day = "0" + day;
   return [year, month, day].join("-");
 }

[NoCoverage] ArrayDeclaration
services/community/utils/supabase-client.ts:217:10
   let day = d.getDate().toString();
   if (month.length < 2) month = "0" + month;
   if (day.length < 2) day = "0" + day;
-  return [year, month, day].join("-");
+  return [].join("-");
 }
 

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:217:34
   let day = d.getDate().toString();
   if (month.length < 2) month = "0" + month;
   if (day.length < 2) day = "0" + day;
-  return [year, month, day].join("-");
+  return [year, month, day].join("");
 }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:227:98
  * @param studentId - Identifier of the student
  * @param courseId - Identifier of the course
  */
-export const updateCalendarDuration = async (id: string, studentId: string, courseId: string) => {
-  if (!id || !studentId || !courseId) return;
-  await supabase.rpc("increment_calendar", {
-    field_name: "timeactive",
-    row_id: id,
-    student_id_value: studentId,
-    course_id_value: courseId
-  });
-};
+export const updateCalendarDuration = async (id: string, studentId: string, courseId: string) => {};
 
 /**

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:228:7
  * @param courseId - Identifier of the course
  */
 export const updateCalendarDuration = async (id: string, studentId: string, courseId: string) => {
-  if (!id || !studentId || !courseId) return;
+  if (true) return;
   await supabase.rpc("increment_calendar", {
     field_name: "timeactive",

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:228:7
  * @param courseId - Identifier of the course
  */
 export const updateCalendarDuration = async (id: string, studentId: string, courseId: string) => {
-  if (!id || !studentId || !courseId) return;
+  if (false) return;
   await supabase.rpc("increment_calendar", {
     field_name: "timeactive",

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:229:22
  */
 export const updateCalendarDuration = async (id: string, studentId: string, courseId: string) => {
   if (!id || !studentId || !courseId) return;
-  await supabase.rpc("increment_calendar", {
+  await supabase.rpc("", {
     field_name: "timeactive",
     row_id: id,

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:245:109
  * @param courseId - Identifier of the course
  * @returns Promise resolving to the duration value
  */
-export async function getCalendarDuration(id: string, studentId: string, courseId: string): Promise<number> {
-  const { data } = await supabase.from("calendar").select("timeactive").eq("id", id).eq("studentid", studentId).eq("courseid", courseId).maybeSingle();
-  return data?.timeactive ? data.timeactive + 1 : 1;
-}
+export async function getCalendarDuration(id: string, studentId: string, courseId: string): Promise<number> {}
 
 /**

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:246:89
  * @returns Promise resolving to the duration value
  */
 export async function getCalendarDuration(id: string, studentId: string, courseId: string): Promise<number> {
-  const { data } = await supabase.from("calendar").select("timeactive").eq("id", id).eq("studentid", studentId).eq("courseid", courseId).maybeSingle();
+  const { data } = await supabase.from("calendar").select("timeactive").eq("id", id).eq("", studentId).eq("courseid", courseId).maybeSingle();
   return data?.timeactive ? data.timeactive + 1 : 1;
 }

[NoCoverage] ArithmeticOperator
services/community/utils/supabase-client.ts:247:29
  */
 export async function getCalendarDuration(id: string, studentId: string, courseId: string): Promise<number> {
   const { data } = await supabase.from("calendar").select("timeactive").eq("id", id).eq("studentid", studentId).eq("courseid", courseId).maybeSingle();
-  return data?.timeactive ? data.timeactive + 1 : 1;
+  return data?.timeactive ? data.timeactive - 1 : 1;
 }
 

[NoCoverage] OptionalChaining
services/community/utils/supabase-client.ts:247:10
  */
 export async function getCalendarDuration(id: string, studentId: string, courseId: string): Promise<number> {
   const { data } = await supabase.from("calendar").select("timeactive").eq("id", id).eq("studentid", studentId).eq("courseid", courseId).maybeSingle();
-  return data?.timeactive ? data.timeactive + 1 : 1;
+  return data.timeactive ? data.timeactive + 1 : 1;
 }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:258:106
  * @param courseId - Identifier of the course
  * @returns Promise resolving to the count value
  */
-export async function getCalendarCount(id: string, studentId: string, courseId: string): Promise<number> {
-  const { data } = await supabase.from("calendar").select("pageloads").eq("id", id).eq("studentid", studentId).eq("courseid", courseId).maybeSingle();
-  return data?.pageloads ? data.pageloads + 1 : 1;
-}
+export async function getCalendarCount(id: string, studentId: string, courseId: string): Promise<number> {}
 
 /**

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:259:40
  * @returns Promise resolving to the count value
  */
 export async function getCalendarCount(id: string, studentId: string, courseId: string): Promise<number> {
-  const { data } = await supabase.from("calendar").select("pageloads").eq("id", id).eq("studentid", studentId).eq("courseid", courseId).maybeSingle();
+  const { data } = await supabase.from("").select("pageloads").eq("id", id).eq("studentid", studentId).eq("courseid", courseId).maybeSingle();
   return data?.pageloads ? data.pageloads + 1 : 1;
 }

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:259:75
  * @returns Promise resolving to the count value
  */
 export async function getCalendarCount(id: string, studentId: string, courseId: string): Promise<number> {
-  const { data } = await supabase.from("calendar").select("pageloads").eq("id", id).eq("studentid", studentId).eq("courseid", courseId).maybeSingle();
+  const { data } = await supabase.from("calendar").select("pageloads").eq("", id).eq("studentid", studentId).eq("courseid", courseId).maybeSingle();
   return data?.pageloads ? data.pageloads + 1 : 1;
 }

[NoCoverage] OptionalChaining
services/community/utils/supabase-client.ts:260:10
  */
 export async function getCalendarCount(id: string, studentId: string, courseId: string): Promise<number> {
   const { data } = await supabase.from("calendar").select("pageloads").eq("id", id).eq("studentid", studentId).eq("courseid", courseId).maybeSingle();
-  return data?.pageloads ? data.pageloads + 1 : 1;
+  return data.pageloads ? data.pageloads + 1 : 1;
 }
 

[NoCoverage] ArithmeticOperator
services/community/utils/supabase-client.ts:260:28
  */
 export async function getCalendarCount(id: string, studentId: string, courseId: string): Promise<number> {
   const { data } = await supabase.from("calendar").select("pageloads").eq("id", id).eq("studentid", studentId).eq("courseid", courseId).maybeSingle();
-  return data?.pageloads ? data.pageloads + 1 : 1;
+  return data?.pageloads ? data.pageloads - 1 : 1;
 }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:271:97
  * @param id - Identifier for the record
  * @returns Promise resolving to the total duration
  */
-export async function getDurationTotal(key: string, table: string, id: string): Promise<number> {
-  const { data } = await supabase.from(table).select("duration").eq(key, id).single();
-  return data?.duration || 1;
-}
+export async function getDurationTotal(key: string, table: string, id: string): Promise<number> {}
 
 /**

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:272:54
  * @returns Promise resolving to the total duration
  */
 export async function getDurationTotal(key: string, table: string, id: string): Promise<number> {
-  const { data } = await supabase.from(table).select("duration").eq(key, id).single();
+  const { data } = await supabase.from(table).select("").eq(key, id).single();
   return data?.duration || 1;
 }

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:273:10
  */
 export async function getDurationTotal(key: string, table: string, id: string): Promise<number> {
   const { data } = await supabase.from(table).select("duration").eq(key, id).single();
-  return data?.duration || 1;
+  return false;
 }
 

[NoCoverage] LogicalOperator
services/community/utils/supabase-client.ts:273:10
  */
 export async function getDurationTotal(key: string, table: string, id: string): Promise<number> {
   const { data } = await supabase.from(table).select("duration").eq(key, id).single();
-  return data?.duration || 1;
+  return data?.duration && 1;
 }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:282:83
  * @param studentId - Identifier of the student
  * @param courseId - Identifier of the course
  */
-export async function insertOrUpdateCalendar(studentId: string, courseId: string) {
-  if (!studentId || !courseId) return;
-  const durationPromise = getCalendarDuration(formatDate(new Date()), studentId, courseId);
-  const countPromise = getCalendarCount(formatDate(new Date()), studentId, courseId);
-  const [timeActive, pageLoads] = await Promise.all([durationPromise, countPromise]);
-  await supabase.from("calendar").upsert(
-    {
-      id: formatDate(new Date()),
-      studentid: studentId,
-      timeactive: timeActive,
-      pageloads: pageLoads,
-      courseid: courseId
-    },
-    {
-      onConflict: "id, studentid, courseid"
-    }
-  );
-}
+export async function insertOrUpdateCalendar(studentId: string, courseId: string) {}
 
 /**

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:283:21
  * @param courseId - Identifier of the course
  */
 export async function insertOrUpdateCalendar(studentId: string, courseId: string) {
-  if (!studentId || !courseId) return;
+  if (!studentId || courseId) return;
   const durationPromise = getCalendarDuration(formatDate(new Date()), studentId, courseId);
   const countPromise = getCalendarCount(formatDate(new Date()), studentId, courseId);

[NoCoverage] LogicalOperator
services/community/utils/supabase-client.ts:283:7
  * @param courseId - Identifier of the course
  */
 export async function insertOrUpdateCalendar(studentId: string, courseId: string) {
-  if (!studentId || !courseId) return;
+  if (!studentId && !courseId) return;
   const durationPromise = getCalendarDuration(formatDate(new Date()), studentId, courseId);
   const countPromise = getCalendarCount(formatDate(new Date()), studentId, courseId);

[NoCoverage] ArrayDeclaration
services/community/utils/supabase-client.ts:286:53
   if (!studentId || !courseId) return;
   const durationPromise = getCalendarDuration(formatDate(new Date()), studentId, courseId);
   const countPromise = getCalendarCount(formatDate(new Date()), studentId, courseId);
-  const [timeActive, pageLoads] = await Promise.all([durationPromise, countPromise]);
+  const [timeActive, pageLoads] = await Promise.all([]);
   await supabase.from("calendar").upsert(
     {

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:309:104
  * @param loId - Identifier of the learning object
  * @param lo - Learning object data
  */
-export async function handleInteractionData(courseId: string, studentId: string, loId: string, lo: Lo) {
-  if (!courseId || !studentId || !loId) return;
-  await manageStudentCourseLo(courseId, studentId, loId, lo);
-}
+export async function handleInteractionData(courseId: string, studentId: string, loId: string, lo: Lo) {}
 
 /**

[NoCoverage] LogicalOperator
services/community/utils/supabase-client.ts:310:7
  * @param lo - Learning object data
  */
 export async function handleInteractionData(courseId: string, studentId: string, loId: string, lo: Lo) {
-  if (!courseId || !studentId || !loId) return;
+  if (!courseId && !studentId || !loId) return;
   await manageStudentCourseLo(courseId, studentId, loId, lo);
 }

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:310:20
  * @param lo - Learning object data
  */
 export async function handleInteractionData(courseId: string, studentId: string, loId: string, lo: Lo) {
-  if (!courseId || !studentId || !loId) return;
+  if (!courseId || studentId || !loId) return;
   await manageStudentCourseLo(courseId, studentId, loId, lo);
 }

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:322:123
  * @param lo - Learning object data
  * @param student - Student data
  */
-export async function storeStudentCourseLearningObjectInSupabase(course: Course, loid: string, lo: Lo, student: TutorsId) {
-  //   const loTitle = getLoTitle(params)
-  //if (userDetails?.user_metadata?.full_name === "Anon") return;
-  // await insertOrUpdateCourse(course);
-  // await addOrUpdateStudent(userDetails);
-  // await addOrUpdateLo(loid, lo, lo.title);
-  await handleInteractionData(course.courseId, student.login, loid, lo);
-  await insertOrUpdateCalendar(student.login, course.courseId);
-}
+export async function storeStudentCourseLearningObjectInSupabase(course: Course, loid: string, lo: Lo, student: TutorsId) {}
 
 /**

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:339:104
  * @param studentId - Identifier of the student
  * @param loId - Identifier of the learning object
  */
-export async function updateLearningRecordsDuration(courseId: string, studentId: string, loId: string) {
-  const numOfDuration = await getNumOfLearningRecordsIncrements("duration", courseId, studentId, loId);
-  await supabase.from("learning_records").update({ duration: numOfDuration }).eq("student_id", studentId).eq("course_id", courseId).eq("lo_id", loId);
-}
+export async function updateLearningRecordsDuration(courseId: string, studentId: string, loId: string) {}
 
 /**

[NoCoverage] ObjectLiteral
services/community/utils/supabase-client.ts:341:50
  */
 export async function updateLearningRecordsDuration(courseId: string, studentId: string, loId: string) {
   const numOfDuration = await getNumOfLearningRecordsIncrements("duration", courseId, studentId, loId);
-  await supabase.from("learning_records").update({ duration: numOfDuration }).eq("student_id", studentId).eq("course_id", courseId).eq("lo_id", loId);
+  await supabase.from("learning_records").update({}).eq("student_id", studentId).eq("course_id", courseId).eq("lo_id", loId);
 }
 

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:341:23
  */
 export async function updateLearningRecordsDuration(courseId: string, studentId: string, loId: string) {
   const numOfDuration = await getNumOfLearningRecordsIncrements("duration", courseId, studentId, loId);
-  await supabase.from("learning_records").update({ duration: numOfDuration }).eq("student_id", studentId).eq("course_id", courseId).eq("lo_id", loId);
+  await supabase.from("").update({ duration: numOfDuration }).eq("student_id", studentId).eq("course_id", courseId).eq("lo_id", loId);
 }
 

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:350:7
  * @param student - Student data to store
  */
 export async function addOrUpdateStudent(student: TutorsId) {
-  if (!student) return;
+  if (true) return;
 
   try {

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:350:7
  * @param student - Student data to store
  */
 export async function addOrUpdateStudent(student: TutorsId) {
-  if (!student) return;
+  if (false) return;
 
   try {

[NoCoverage] LogicalOperator
services/community/utils/supabase-client.ts:356:9
     let fullName = student.name;
     
     // If name is null or empty, fetch from GitHub API
-    if (!fullName && student.login) {
+    if (!fullName || student.login) {
       try {
         const response = await fetch(`https://api.github.com/users/${student.login}`);

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:356:37
     let fullName = student.name;
     
     // If name is null or empty, fetch from GitHub API
-    if (!fullName && student.login) {
-      try {
-        const response = await fetch(`https://api.github.com/users/${student.login}`);
-        if (response.ok) {
-          const githubUser = await response.json();
-          fullName = githubUser.name || student.login;
-        } else {
-          // Fallback to login if API call fails
-          fullName = student.login;
-        }
-      } catch (fetchError) {
-        console.error("Failed to fetch GitHub user:", fetchError);
-        // Fallback to login if API call fails
-        fullName = student.login;
-      }
-    }
+    if (!fullName && student.login) {}
 
     const row: {

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:357:11
     
     // If name is null or empty, fetch from GitHub API
     if (!fullName && student.login) {
-      try {
-        const response = await fetch(`https://api.github.com/users/${student.login}`);
-        if (response.ok) {
-          const githubUser = await response.json();
-          fullName = githubUser.name || student.login;
-        } else {
-          // Fallback to login if API call fails
-          fullName = student.login;
-        }
-      } catch (fetchError) {
+      try {} catch (fetchError) {
         console.error("Failed to fetch GitHub user:", fetchError);
         // Fallback to login if API call fails

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:359:13
     if (!fullName && student.login) {
       try {
         const response = await fetch(`https://api.github.com/users/${student.login}`);
-        if (response.ok) {
+        if (true) {
           const githubUser = await response.json();
           fullName = githubUser.name || student.login;

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:359:26
     if (!fullName && student.login) {
       try {
         const response = await fetch(`https://api.github.com/users/${student.login}`);
-        if (response.ok) {
-          const githubUser = await response.json();
-          fullName = githubUser.name || student.login;
-        } else {
+        if (response.ok) {} else {
           // Fallback to login if API call fails
           fullName = student.login;

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:361:22
         const response = await fetch(`https://api.github.com/users/${student.login}`);
         if (response.ok) {
           const githubUser = await response.json();
-          fullName = githubUser.name || student.login;
+          fullName = false;
         } else {
           // Fallback to login if API call fails

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:361:22
         const response = await fetch(`https://api.github.com/users/${student.login}`);
         if (response.ok) {
           const githubUser = await response.json();
-          fullName = githubUser.name || student.login;
+          fullName = true;
         } else {
           // Fallback to login if API call fails

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:362:16
         if (response.ok) {
           const githubUser = await response.json();
           fullName = githubUser.name || student.login;
-        } else {
-          // Fallback to login if API call fails
-          fullName = student.login;
-        }
+        } else {}
       } catch (fetchError) {
         console.error("Failed to fetch GitHub user:", fetchError);

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:366:28
           // Fallback to login if API call fails
           fullName = student.login;
         }
-      } catch (fetchError) {
-        console.error("Failed to fetch GitHub user:", fetchError);
-        // Fallback to login if API call fails
-        fullName = student.login;
-      }
+      } catch (fetchError) {}
     }
 

[NoCoverage] EqualityOperator
services/community/utils/supabase-client.ts:389:9
       date_last_accessed: new Date().toISOString(),
       sentiment: student.sentiment
     };
-    if (student.share === "true") {
+    if (student.share !== "true") {
       row.online_status = "online";
     } else if (student.share === "false") {

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:389:35
       date_last_accessed: new Date().toISOString(),
       sentiment: student.sentiment
     };
-    if (student.share === "true") {
-      row.online_status = "online";
-    } else if (student.share === "false") {
+    if (student.share === "true") {} else if (student.share === "false") {
       row.online_status = "offline";
     }

[NoCoverage] EqualityOperator
services/community/utils/supabase-client.ts:391:16
     };
     if (student.share === "true") {
       row.online_status = "online";
-    } else if (student.share === "false") {
+    } else if (student.share !== "false") {
       row.online_status = "offline";
     }

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:391:16
     };
     if (student.share === "true") {
       row.online_status = "online";
-    } else if (student.share === "false") {
+    } else if (false) {
       row.online_status = "offline";
     }

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:392:27
     if (student.share === "true") {
       row.online_status = "online";
     } else if (student.share === "false") {
-      row.online_status = "offline";
+      row.online_status = "";
     }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:397:16
 
     const { error } = await supabase.from("tutors-connect-users").upsert(row);
 
-    if (error) {
-      console.error("Upsert failed:", error);
-      throw error;
-    }
+    if (error) {}
   } catch (error) {
     console.error("An error occurred in addOrUpdateUserProfile:", error);

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:401:19
       console.error("Upsert failed:", error);
       throw error;
     }
-  } catch (error) {
-    console.error("An error occurred in addOrUpdateUserProfile:", error);
-    throw error;
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:407:82
   }
 }
 
-function normalizeStoredSentiment(raw: string | null | undefined): string | null {
-  if (raw == null || !String(raw).trim()) return null;
-  const s = String(raw).trim();
-  return (COURSE_SENTIMENT_IDS as readonly string[]).includes(s) ? s : null;
-}
+function normalizeStoredSentiment(raw: string | null | undefined): string | null {}
 
 /**

[NoCoverage] EqualityOperator
services/community/utils/supabase-client.ts:408:7
 }
 
 function normalizeStoredSentiment(raw: string | null | undefined): string | null {
-  if (raw == null || !String(raw).trim()) return null;
+  if (raw != null || !String(raw).trim()) return null;
   const s = String(raw).trim();
   return (COURSE_SENTIMENT_IDS as readonly string[]).includes(s) ? s : null;

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:408:7
 }
 
 function normalizeStoredSentiment(raw: string | null | undefined): string | null {
-  if (raw == null || !String(raw).trim()) return null;
+  if (true) return null;
   const s = String(raw).trim();
   return (COURSE_SENTIMENT_IDS as readonly string[]).includes(s) ? s : null;

[NoCoverage] MethodExpression
services/community/utils/supabase-client.ts:409:13
 
 function normalizeStoredSentiment(raw: string | null | undefined): string | null {
   if (raw == null || !String(raw).trim()) return null;
-  const s = String(raw).trim();
+  const s = String(raw);
   return (COURSE_SENTIMENT_IDS as readonly string[]).includes(s) ? s : null;
 }

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:418:95
  * @param githubId - Student GitHub login (primary key for the row)
  * @returns Stored sentiment if present and valid per {@link COURSE_SENTIMENT_IDS}, otherwise null (includes no row).
  */
-export async function getTutorsConnectUserSentiment(githubId: string): Promise<string | null> {
-  if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return null;
-
-  const { data, error } = await supabase
-    .from("tutors-connect-users")
-    .select("sentiment")
-    .eq("github_id", githubId)
-    .maybeSingle();
-
-  if (error) {
-    console.error("getTutorsConnectUserSentiment failed:", error);
-    throw error;
-  }
-  if (!data) return null;
-  return normalizeStoredSentiment((data as { sentiment: string | null }).sentiment);
-}
+export async function getTutorsConnectUserSentiment(githubId: string): Promise<string | null> {}
 
 /**

[NoCoverage] EqualityOperator
services/community/utils/supabase-client.ts:419:7
  * @returns Stored sentiment if present and valid per {@link COURSE_SENTIMENT_IDS}, otherwise null (includes no row).
  */
 export async function getTutorsConnectUserSentiment(githubId: string): Promise<string | null> {
-  if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return null;
+  if (PUBLIC_ANON_MODE !== "TRUE" || !githubId) return null;
 
   const { data, error } = await supabase

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:419:7
  * @returns Stored sentiment if present and valid per {@link COURSE_SENTIMENT_IDS}, otherwise null (includes no row).
  */
 export async function getTutorsConnectUserSentiment(githubId: string): Promise<string | null> {
-  if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return null;
+  if (false) return null;
 
   const { data, error } = await supabase

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:428:19
     .maybeSingle();
 
   if (error) {
-    console.error("getTutorsConnectUserSentiment failed:", error);
+    console.error("", error);
     throw error;
   }

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:431:7
     console.error("getTutorsConnectUserSentiment failed:", error);
     throw error;
   }
-  if (!data) return null;
+  if (true) return null;
   return normalizeStoredSentiment((data as { sentiment: string | null }).sentiment);
 }

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:431:7
     console.error("getTutorsConnectUserSentiment failed:", error);
     throw error;
   }
-  if (!data) return null;
+  if (data) return null;
   return normalizeStoredSentiment((data as { sentiment: string | null }).sentiment);
 }

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:440:93
  * @param githubId - Student GitHub login (primary key for the row)
  * @param sentiment - Current mood string
  */
-export async function updateTutorsConnectUserSentiment(githubId: string, sentiment: string) {
-  if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return;
-
-  const { error } = await supabase
-    .from("tutors-connect-users")
-    .update({
-      sentiment,
-      date_last_accessed: new Date().toISOString()
-    })
-    .eq("github_id", githubId);
-
-  if (error) {
-    console.error("updateTutorsConnectUserSentiment failed:", error);
-    throw error;
-  }
-}
+export async function updateTutorsConnectUserSentiment(githubId: string, sentiment: string) {}
 
 /**

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:441:7
  * @param sentiment - Current mood string
  */
 export async function updateTutorsConnectUserSentiment(githubId: string, sentiment: string) {
-  if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return;
+  if (true) return;
 
   const { error } = await supabase

[NoCoverage] BooleanLiteral
services/community/utils/supabase-client.ts:441:38
  * @param sentiment - Current mood string
  */
 export async function updateTutorsConnectUserSentiment(githubId: string, sentiment: string) {
-  if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return;
+  if (PUBLIC_ANON_MODE === "TRUE" || githubId) return;
 
   const { error } = await supabase

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:444:11
   if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return;
 
   const { error } = await supabase
-    .from("tutors-connect-users")
+    .from("")
     .update({
       sentiment,

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:451:14
     })
     .eq("github_id", githubId);
 
-  if (error) {
-    console.error("updateTutorsConnectUserSentiment failed:", error);
-    throw error;
-  }
+  if (error) {}
 }
 
