[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:462:98
  * @param githubId - Student GitHub login (primary key for the row)
  * @returns Stored online_status if present, otherwise null (includes no row).
  */
-export async function getTutorsConnectUserOnlineStatus(githubId: string): Promise<string | null> {
-  if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return null;
-
-  const { data, error } = await supabase
-    .from("tutors-connect-users")
-    .select("online_status")
-    .eq("github_id", githubId)
-    .maybeSingle();
-
-  if (error) {
-    console.error("getTutorsConnectShare failed:", error);
-    throw error;
-  }
-  if (!data) return null;
-  const raw = (data as { online_status: string | null }).online_status;
-  if (raw == null || !String(raw).trim()) return null;
-  return String(raw).trim();
-}
+export async function getTutorsConnectUserOnlineStatus(githubId: string): Promise<string | null> {}
 
 /**

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:463:7
  * @returns Stored online_status if present, otherwise null (includes no row).
  */
 export async function getTutorsConnectUserOnlineStatus(githubId: string): Promise<string | null> {
-  if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return null;
+  if (false) return null;
 
   const { data, error } = await supabase

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:463:7
  * @returns Stored online_status if present, otherwise null (includes no row).
  */
 export async function getTutorsConnectUserOnlineStatus(githubId: string): Promise<string | null> {
-  if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return null;
+  if (false || !githubId) return null;
 
   const { data, error } = await supabase

[NoCoverage] StringLiteral
services/community/utils/supabase-client.ts:468:9
   const { data, error } = await supabase
     .from("tutors-connect-users")
     .select("online_status")
-    .eq("github_id", githubId)
+    .eq("", githubId)
     .maybeSingle();
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:471:14
     .eq("github_id", githubId)
     .maybeSingle();
 
-  if (error) {
-    console.error("getTutorsConnectShare failed:", error);
-    throw error;
-  }
+  if (error) {}
   if (!data) return null;
   const raw = (data as { online_status: string | null }).online_status;

[NoCoverage] EqualityOperator
services/community/utils/supabase-client.ts:477:7
   }
   if (!data) return null;
   const raw = (data as { online_status: string | null }).online_status;
-  if (raw == null || !String(raw).trim()) return null;
+  if (raw != null || !String(raw).trim()) return null;
   return String(raw).trim();
 }

[NoCoverage] LogicalOperator
services/community/utils/supabase-client.ts:477:7
   }
   if (!data) return null;
   const raw = (data as { online_status: string | null }).online_status;
-  if (raw == null || !String(raw).trim()) return null;
+  if (raw == null && !String(raw).trim()) return null;
   return String(raw).trim();
 }

[NoCoverage] MethodExpression
services/community/utils/supabase-client.ts:478:10
   if (!data) return null;
   const raw = (data as { online_status: string | null }).online_status;
   if (raw == null || !String(raw).trim()) return null;
-  return String(raw).trim();
+  return String(raw);
 }
 

[NoCoverage] BlockStatement
services/community/utils/supabase-client.ts:484:113
 /**
  * Sets online_status on tutors-connect-users (mirrors share: visible / sharing = online).
  */
-export async function updateTutorsConnectUserOnlineStatus(githubId: string, onlineStatus: "online" | "offline") {
-  if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return;
-
-  const { error } = await supabase
-    .from("tutors-connect-users")
-    .update({
-      online_status: onlineStatus,
-      date_last_accessed: new Date().toISOString()
-    })
-    .eq("github_id", githubId);
-
-  if (error) {
-    console.error("updateTutorsConnectUserOnlineStatus failed:", error);
-    throw error;
-  }
-}
+export async function updateTutorsConnectUserOnlineStatus(githubId: string, onlineStatus: "online" | "offline") {}
 
 

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:485:7
  * Sets online_status on tutors-connect-users (mirrors share: visible / sharing = online).
  */
 export async function updateTutorsConnectUserOnlineStatus(githubId: string, onlineStatus: "online" | "offline") {
-  if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return;
+  if (false) return;
 
   const { error } = await supabase

[NoCoverage] ConditionalExpression
services/community/utils/supabase-client.ts:485:7
  * Sets online_status on tutors-connect-users (mirrors share: visible / sharing = online).
  */
 export async function updateTutorsConnectUserOnlineStatus(githubId: string, onlineStatus: "online" | "offline") {
-  if (PUBLIC_ANON_MODE === "TRUE" || !githubId) return;
+  if (false || !githubId) return;
 
   const { error } = await supabase
