[NoCoverage] BooleanLiteral
services/connect/services/connect.svelte.ts:31:16
 } from "$lib/services/community/utils/supabase-client";
 
 /** Global anonymous mode flag, controlled by environment variable */
-let anonMode = false;
+let anonMode = true;
 
 /** Global flag to disable analytics in case of database issues*/

[NoCoverage] BooleanLiteral
services/connect/services/connect.svelte.ts:34:31
 let anonMode = false;
 
 /** Global flag to disable analytics in case of database issues*/
-export let analyticsEnabled = true;
+export let analyticsEnabled = false;
 
 if (PUBLIC_ANON_MODE === "TRUE") {

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:36:5
 /** Global flag to disable analytics in case of database issues*/
 export let analyticsEnabled = true;
 
-if (PUBLIC_ANON_MODE === "TRUE") {
+if (false) {
   anonMode = true;
 }

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:36:5
 /** Global flag to disable analytics in case of database issues*/
 export let analyticsEnabled = true;
 
-if (PUBLIC_ANON_MODE === "TRUE") {
+if (true) {
   anonMode = true;
 }

[NoCoverage] BooleanLiteral
services/connect/services/connect.svelte.ts:37:14
 export let analyticsEnabled = true;
 
 if (PUBLIC_ANON_MODE === "TRUE") {
-  anonMode = true;
+  anonMode = false;
 }
 

[NoCoverage] BooleanLiteral
services/connect/services/connect.svelte.ts:46:13
   /** Timer ID for analytics updates */
   intervalId: null,
   /** Local anonymous mode flag */
-  anonMode: false,
+  anonMode: true,
 
   /**

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:53:38
    * @param redirectStr - URL to redirect to after successful authentication
    * @returns Promise from auth provider
    */
-  async connect(redirectStr: string) {
-    return await signIn("github", { callbackUrl: redirectStr });
-  },
+  async connect(redirectStr: string) {},
 
   /**

[NoCoverage] ObjectLiteral
services/connect/services/connect.svelte.ts:54:35
    * @returns Promise from auth provider
    */
   async connect(redirectStr: string) {
-    return await signIn("github", { callbackUrl: redirectStr });
+    return await signIn("github", {});
   },
 

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:63:35
    * @param user - User identity to reconnect
    */
 
-  async reconnect(user: TutorsId) {
-    if (anonMode) return;
-    presenceService.connectToAllCourseAccess();
-    if (user) {
-      this.profile = supabaseProfile;
-      tutorsId.value = user;
-      tutorsId.value.sentiment! = await getTutorsConnectUserSentiment(user.login) ?? "neutral";
-      tutorsId.value.share = await getTutorsConnectUserOnlineStatus(user.login) ?? "online";
-      addOrUpdateStudent(user);
-      if (browser) {
-        if (!localStorage.share) {
-          localStorage.share = true;
-        }
-        tutorsId.value.share = localStorage.share;
-        if (localStorage.loginCourse) {
-          const courseId = localStorage.loginCourse;
-          localStorage.removeItem("loginCourse");
-          goto(`/course/${courseId}`);
-        }
-      }
-    }
-  },
+  async reconnect(user: TutorsId) {},
 
   /**

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:64:9
    */
 
   async reconnect(user: TutorsId) {
-    if (anonMode) return;
+    if (false) return;
     presenceService.connectToAllCourseAccess();
     if (user) {

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:64:9
    */
 
   async reconnect(user: TutorsId) {
-    if (anonMode) return;
+    if (true) return;
     presenceService.connectToAllCourseAccess();
     if (user) {

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:66:9
   async reconnect(user: TutorsId) {
     if (anonMode) return;
     presenceService.connectToAllCourseAccess();
-    if (user) {
+    if (true) {
       this.profile = supabaseProfile;
       tutorsId.value = user;

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:66:15
   async reconnect(user: TutorsId) {
     if (anonMode) return;
     presenceService.connectToAllCourseAccess();
-    if (user) {
-      this.profile = supabaseProfile;
-      tutorsId.value = user;
-      tutorsId.value.sentiment! = await getTutorsConnectUserSentiment(user.login) ?? "neutral";
-      tutorsId.value.share = await getTutorsConnectUserOnlineStatus(user.login) ?? "online";
-      addOrUpdateStudent(user);
-      if (browser) {
-        if (!localStorage.share) {
-          localStorage.share = true;
-        }
-        tutorsId.value.share = localStorage.share;
-        if (localStorage.loginCourse) {
-          const courseId = localStorage.loginCourse;
-          localStorage.removeItem("loginCourse");
-          goto(`/course/${courseId}`);
-        }
-      }
-    }
+    if (user) {}
   },
 

[NoCoverage] LogicalOperator
services/connect/services/connect.svelte.ts:69:35
     if (user) {
       this.profile = supabaseProfile;
       tutorsId.value = user;
-      tutorsId.value.sentiment! = await getTutorsConnectUserSentiment(user.login) ?? "neutral";
+      tutorsId.value.sentiment! = (await getTutorsConnectUserSentiment(user.login)) && "neutral";
       tutorsId.value.share = await getTutorsConnectUserOnlineStatus(user.login) ?? "online";
       addOrUpdateStudent(user);

[NoCoverage] LogicalOperator
services/connect/services/connect.svelte.ts:70:30
       this.profile = supabaseProfile;
       tutorsId.value = user;
       tutorsId.value.sentiment! = await getTutorsConnectUserSentiment(user.login) ?? "neutral";
-      tutorsId.value.share = await getTutorsConnectUserOnlineStatus(user.login) ?? "online";
+      tutorsId.value.share = (await getTutorsConnectUserOnlineStatus(user.login)) && "online";
       addOrUpdateStudent(user);
       if (browser) {

[NoCoverage] StringLiteral
services/connect/services/connect.svelte.ts:70:84
       this.profile = supabaseProfile;
       tutorsId.value = user;
       tutorsId.value.sentiment! = await getTutorsConnectUserSentiment(user.login) ?? "neutral";
-      tutorsId.value.share = await getTutorsConnectUserOnlineStatus(user.login) ?? "online";
+      tutorsId.value.share = await getTutorsConnectUserOnlineStatus(user.login) ?? "";
       addOrUpdateStudent(user);
       if (browser) {

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:72:11
       tutorsId.value.sentiment! = await getTutorsConnectUserSentiment(user.login) ?? "neutral";
       tutorsId.value.share = await getTutorsConnectUserOnlineStatus(user.login) ?? "online";
       addOrUpdateStudent(user);
-      if (browser) {
+      if (false) {
         if (!localStorage.share) {
           localStorage.share = true;

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:72:20
       tutorsId.value.sentiment! = await getTutorsConnectUserSentiment(user.login) ?? "neutral";
       tutorsId.value.share = await getTutorsConnectUserOnlineStatus(user.login) ?? "online";
       addOrUpdateStudent(user);
-      if (browser) {
-        if (!localStorage.share) {
-          localStorage.share = true;
-        }
-        tutorsId.value.share = localStorage.share;
-        if (localStorage.loginCourse) {
-          const courseId = localStorage.loginCourse;
-          localStorage.removeItem("loginCourse");
-          goto(`/course/${courseId}`);
-        }
-      }
+      if (browser) {}
     }
   },

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:73:13
       tutorsId.value.share = await getTutorsConnectUserOnlineStatus(user.login) ?? "online";
       addOrUpdateStudent(user);
       if (browser) {
-        if (!localStorage.share) {
+        if (true) {
           localStorage.share = true;
         }

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:73:13
       tutorsId.value.share = await getTutorsConnectUserOnlineStatus(user.login) ?? "online";
       addOrUpdateStudent(user);
       if (browser) {
-        if (!localStorage.share) {
+        if (false) {
           localStorage.share = true;
         }

[NoCoverage] BooleanLiteral
services/connect/services/connect.svelte.ts:74:32
       addOrUpdateStudent(user);
       if (browser) {
         if (!localStorage.share) {
-          localStorage.share = true;
+          localStorage.share = false;
         }
         tutorsId.value.share = localStorage.share;

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:77:13
           localStorage.share = true;
         }
         tutorsId.value.share = localStorage.share;
-        if (localStorage.loginCourse) {
+        if (true) {
           const courseId = localStorage.loginCourse;
           localStorage.removeItem("loginCourse");

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:77:13
           localStorage.share = true;
         }
         tutorsId.value.share = localStorage.share;
-        if (localStorage.loginCourse) {
+        if (false) {
           const courseId = localStorage.loginCourse;
           localStorage.removeItem("loginCourse");

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:90:35
    * Terminates user session
    * @param redirectStr - URL to redirect to after logout
    */
-  disconnect(redirectStr: string) {
-    signOut({ callbackUrl: redirectStr });
-  },
+  disconnect(redirectStr: string) {},
 
   /**

[NoCoverage] ObjectLiteral
services/connect/services/connect.svelte.ts:91:13
    * @param redirectStr - URL to redirect to after logout
    */
   disconnect(redirectStr: string) {
-    signOut({ callbackUrl: redirectStr });
+    signOut({});
   },
 

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:98:17
    * Toggles user's content sharing preference
    * Updates both local storage and current session
    */
-  toggleShare() {
-    if (tutorsId.value && browser) {
-      if (tutorsId.value.share === "true") {
-        localStorage.share = tutorsId.value.share = "false";
-      } else {
-        localStorage.share = tutorsId.value.share = "true";
-      }
-      const login = tutorsId.value.login;
-      if (login && !anonMode) {
-        const onlineStatus = tutorsId.value.share === "true" ? "online" : "offline";
-        void updateTutorsConnectUserOnlineStatus(login, onlineStatus).catch((err) => console.error(err));
-      }
-    }
-  },
+  toggleShare() {},
 
   async updateSentiment(sentiment: string) {

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:99:9
    * Updates both local storage and current session
    */
   toggleShare() {
-    if (tutorsId.value && browser) {
+    if (true) {
       if (tutorsId.value.share === "true") {
         localStorage.share = tutorsId.value.share = "false";

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:99:36
    * Updates both local storage and current session
    */
   toggleShare() {
-    if (tutorsId.value && browser) {
-      if (tutorsId.value.share === "true") {
-        localStorage.share = tutorsId.value.share = "false";
-      } else {
-        localStorage.share = tutorsId.value.share = "true";
-      }
-      const login = tutorsId.value.login;
-      if (login && !anonMode) {
-        const onlineStatus = tutorsId.value.share === "true" ? "online" : "offline";
-        void updateTutorsConnectUserOnlineStatus(login, onlineStatus).catch((err) => console.error(err));
-      }
-    }
+    if (tutorsId.value && browser) {}
   },
 

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:100:44
    */
   toggleShare() {
     if (tutorsId.value && browser) {
-      if (tutorsId.value.share === "true") {
-        localStorage.share = tutorsId.value.share = "false";
-      } else {
+      if (tutorsId.value.share === "true") {} else {
         localStorage.share = tutorsId.value.share = "true";
       }

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:100:11
    */
   toggleShare() {
     if (tutorsId.value && browser) {
-      if (tutorsId.value.share === "true") {
+      if (true) {
         localStorage.share = tutorsId.value.share = "false";
       } else {

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:102:14
     if (tutorsId.value && browser) {
       if (tutorsId.value.share === "true") {
         localStorage.share = tutorsId.value.share = "false";
-      } else {
-        localStorage.share = tutorsId.value.share = "true";
-      }
+      } else {}
       const login = tutorsId.value.login;
       if (login && !anonMode) {

[NoCoverage] StringLiteral
services/connect/services/connect.svelte.ts:103:53
       if (tutorsId.value.share === "true") {
         localStorage.share = tutorsId.value.share = "false";
       } else {
-        localStorage.share = tutorsId.value.share = "true";
+        localStorage.share = tutorsId.value.share = "";
       }
       const login = tutorsId.value.login;

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:106:31
         localStorage.share = tutorsId.value.share = "true";
       }
       const login = tutorsId.value.login;
-      if (login && !anonMode) {
-        const onlineStatus = tutorsId.value.share === "true" ? "online" : "offline";
-        void updateTutorsConnectUserOnlineStatus(login, onlineStatus).catch((err) => console.error(err));
-      }
+      if (login && !anonMode) {}
     }
   },

[NoCoverage] LogicalOperator
services/connect/services/connect.svelte.ts:106:11
         localStorage.share = tutorsId.value.share = "true";
       }
       const login = tutorsId.value.login;
-      if (login && !anonMode) {
+      if (login || !anonMode) {
         const onlineStatus = tutorsId.value.share === "true" ? "online" : "offline";
         void updateTutorsConnectUserOnlineStatus(login, onlineStatus).catch((err) => console.error(err));

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:107:30
       }
       const login = tutorsId.value.login;
       if (login && !anonMode) {
-        const onlineStatus = tutorsId.value.share === "true" ? "online" : "offline";
+        const onlineStatus = false ? "online" : "offline";
         void updateTutorsConnectUserOnlineStatus(login, onlineStatus).catch((err) => console.error(err));
       }

[NoCoverage] EqualityOperator
services/connect/services/connect.svelte.ts:107:30
       }
       const login = tutorsId.value.login;
       if (login && !anonMode) {
-        const onlineStatus = tutorsId.value.share === "true" ? "online" : "offline";
+        const onlineStatus = tutorsId.value.share !== "true" ? "online" : "offline";
         void updateTutorsConnectUserOnlineStatus(login, onlineStatus).catch((err) => console.error(err));
       }

[NoCoverage] ArrowFunction
services/connect/services/connect.svelte.ts:108:77
       const login = tutorsId.value.login;
       if (login && !anonMode) {
         const onlineStatus = tutorsId.value.share === "true" ? "online" : "offline";
-        void updateTutorsConnectUserOnlineStatus(login, onlineStatus).catch((err) => console.error(err));
+        void updateTutorsConnectUserOnlineStatus(login, onlineStatus).catch(() => undefined);
       }
     }

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:113:44
     }
   },
 
-  async updateSentiment(sentiment: string) {
-    const s = sentiment;
-    if (browser) {
-      localStorage.sentiment = s;
-    }
-    if (anonMode) return;
-    if (tutorsId.value) {
-      tutorsId.value = { ...tutorsId.value, sentiment: s };
-    }
-    const login = tutorsId.value?.login;
-    if (login) {
-      await updateTutorsConnectUserSentiment(login, s);
-    }
-  },
+  async updateSentiment(sentiment: string) {},
 
   /**

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:115:18
 
   async updateSentiment(sentiment: string) {
     const s = sentiment;
-    if (browser) {
-      localStorage.sentiment = s;
-    }
+    if (browser) {}
     if (anonMode) return;
     if (tutorsId.value) {

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:115:9
 
   async updateSentiment(sentiment: string) {
     const s = sentiment;
-    if (browser) {
+    if (false) {
       localStorage.sentiment = s;
     }

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:118:9
     if (browser) {
       localStorage.sentiment = s;
     }
-    if (anonMode) return;
+    if (true) return;
     if (tutorsId.value) {
       tutorsId.value = { ...tutorsId.value, sentiment: s };

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:118:9
     if (browser) {
       localStorage.sentiment = s;
     }
-    if (anonMode) return;
+    if (false) return;
     if (tutorsId.value) {
       tutorsId.value = { ...tutorsId.value, sentiment: s };

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:119:25
       localStorage.sentiment = s;
     }
     if (anonMode) return;
-    if (tutorsId.value) {
-      tutorsId.value = { ...tutorsId.value, sentiment: s };
-    }
+    if (tutorsId.value) {}
     const login = tutorsId.value?.login;
     if (login) {

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:119:9
       localStorage.sentiment = s;
     }
     if (anonMode) return;
-    if (tutorsId.value) {
+    if (false) {
       tutorsId.value = { ...tutorsId.value, sentiment: s };
     }

[NoCoverage] OptionalChaining
services/connect/services/connect.svelte.ts:122:19
     if (tutorsId.value) {
       tutorsId.value = { ...tutorsId.value, sentiment: s };
     }
-    const login = tutorsId.value?.login;
+    const login = tutorsId.value.login;
     if (login) {
       await updateTutorsConnectUserSentiment(login, s);

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:123:16
       tutorsId.value = { ...tutorsId.value, sentiment: s };
     }
     const login = tutorsId.value?.login;
-    if (login) {
-      await updateTutorsConnectUserSentiment(login, s);
-    }
+    if (login) {}
   },
 

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:123:9
       tutorsId.value = { ...tutorsId.value, sentiment: s };
     }
     const login = tutorsId.value?.login;
-    if (login) {
+    if (false) {
       await updateTutorsConnectUserSentiment(login, s);
     }

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:133:31
    * Handles auth redirects for protected courses
    * @param course - Course being visited
    */
-  courseVisit(course: Course) {
-    if (anonMode) return;
-    if (analyticsEnabled) {
-      updateCourseList(course);
-      this.profile.logCourseVisit(course);
-    }
-    presenceService.startPresenceListener(course.courseId);
-    if (course.authLevel! > 0 && !tutorsId.value?.login) {
-      localStorage.loginCourse = course.courseId;
-      goto(`/auth`);
-    }
-  },
+  courseVisit(course: Course) {},
 
   /**

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:134:9
    * @param course - Course being visited
    */
   courseVisit(course: Course) {
-    if (anonMode) return;
+    if (true) return;
     if (analyticsEnabled) {
       updateCourseList(course);

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:134:9
    * @param course - Course being visited
    */
   courseVisit(course: Course) {
-    if (anonMode) return;
+    if (false) return;
     if (analyticsEnabled) {
       updateCourseList(course);

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:135:9
    */
   courseVisit(course: Course) {
     if (anonMode) return;
-    if (analyticsEnabled) {
+    if (true) {
       updateCourseList(course);
       this.profile.logCourseVisit(course);

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:135:9
    */
   courseVisit(course: Course) {
     if (anonMode) return;
-    if (analyticsEnabled) {
+    if (false) {
       updateCourseList(course);
       this.profile.logCourseVisit(course);

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:140:58
       this.profile.logCourseVisit(course);
     }
     presenceService.startPresenceListener(course.courseId);
-    if (course.authLevel! > 0 && !tutorsId.value?.login) {
-      localStorage.loginCourse = course.courseId;
-      goto(`/auth`);
-    }
+    if (course.authLevel! > 0 && !tutorsId.value?.login) {}
   },
 

[NoCoverage] EqualityOperator
services/connect/services/connect.svelte.ts:140:9
       this.profile.logCourseVisit(course);
     }
     presenceService.startPresenceListener(course.courseId);
-    if (course.authLevel! > 0 && !tutorsId.value?.login) {
+    if (course.authLevel! >= 0 && !tutorsId.value?.login) {
       localStorage.loginCourse = course.courseId;
       goto(`/auth`);

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:150:43
    * Adds course to user's favorites
    * @param courseId - Course to favorite
    */
-  async favouriteCourse(courseId: string) {
-    await this.profile.favouriteCourse(courseId);
-  },
+  async favouriteCourse(courseId: string) {},
 
   /**

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:158:45
    * Removes course from user's favorites
    * @param courseId - Course to unfavorite
    */
-  async unfavouriteCourse(courseId: string) {
-    await this.profile.unfavouriteCourse(courseId);
-  },
+  async unfavouriteCourse(courseId: string) {},
 
   /**

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:166:45
    * Deletes a course visit record
    * @param courseId - Course visit to delete
    */
-  async deleteCourseVisit(courseId: string) {
-    await this.profile.deleteCourseVisit(courseId);
-  },
+  async deleteCourseVisit(courseId: string) {},
 
   /**

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:174:45
    * Retrieves user's course visit history
    * @returns Promise resolving to array of course visits
    */
-  getCourseVisits(): Promise<CourseVisit[]> {
-    return this.profile.getCourseVisits();
-  },
+  getCourseVisits(): Promise<CourseVisit[]> {},
 
   /**

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:182:55
    * Records a learning event and broadcasts if sharing enabled
    * @param params - Event parameters to record
    */
-  learningEvent(params: Record<string, string>): void {
-    if (anonMode) return;
-    if (currentCourse.value && currentLo.value && tutorsId.value) {
-      if (analyticsEnabled) analyticsService.learningEvent(currentCourse.value, params, currentLo.value, tutorsId.value);
-      if (tutorsId.value.share === "true" && !currentCourse.value.isPrivate) {
-        presenceService.sendLoEvent(currentCourse.value, currentLo.value, tutorsId.value);
-      }
-    }
-  },
+  learningEvent(params: Record<string, string>): void {},
 
   /**

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:183:9
    * @param params - Event parameters to record
    */
   learningEvent(params: Record<string, string>): void {
-    if (anonMode) return;
+    if (false) return;
     if (currentCourse.value && currentLo.value && tutorsId.value) {
       if (analyticsEnabled) analyticsService.learningEvent(currentCourse.value, params, currentLo.value, tutorsId.value);

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:183:9
    * @param params - Event parameters to record
    */
   learningEvent(params: Record<string, string>): void {
-    if (anonMode) return;
+    if (true) return;
     if (currentCourse.value && currentLo.value && tutorsId.value) {
       if (analyticsEnabled) analyticsService.learningEvent(currentCourse.value, params, currentLo.value, tutorsId.value);

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:184:9
    */
   learningEvent(params: Record<string, string>): void {
     if (anonMode) return;
-    if (currentCourse.value && currentLo.value && tutorsId.value) {
+    if (false) {
       if (analyticsEnabled) analyticsService.learningEvent(currentCourse.value, params, currentLo.value, tutorsId.value);
       if (tutorsId.value.share === "true" && !currentCourse.value.isPrivate) {

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:184:67
    */
   learningEvent(params: Record<string, string>): void {
     if (anonMode) return;
-    if (currentCourse.value && currentLo.value && tutorsId.value) {
-      if (analyticsEnabled) analyticsService.learningEvent(currentCourse.value, params, currentLo.value, tutorsId.value);
-      if (tutorsId.value.share === "true" && !currentCourse.value.isPrivate) {
-        presenceService.sendLoEvent(currentCourse.value, currentLo.value, tutorsId.value);
-      }
-    }
+    if (currentCourse.value && currentLo.value && tutorsId.value) {}
   },
 

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:185:11
   learningEvent(params: Record<string, string>): void {
     if (anonMode) return;
     if (currentCourse.value && currentLo.value && tutorsId.value) {
-      if (analyticsEnabled) analyticsService.learningEvent(currentCourse.value, params, currentLo.value, tutorsId.value);
+      if (true) analyticsService.learningEvent(currentCourse.value, params, currentLo.value, tutorsId.value);
       if (tutorsId.value.share === "true" && !currentCourse.value.isPrivate) {
         presenceService.sendLoEvent(currentCourse.value, currentLo.value, tutorsId.value);

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:185:11
   learningEvent(params: Record<string, string>): void {
     if (anonMode) return;
     if (currentCourse.value && currentLo.value && tutorsId.value) {
-      if (analyticsEnabled) analyticsService.learningEvent(currentCourse.value, params, currentLo.value, tutorsId.value);
+      if (false) analyticsService.learningEvent(currentCourse.value, params, currentLo.value, tutorsId.value);
       if (tutorsId.value.share === "true" && !currentCourse.value.isPrivate) {
         presenceService.sendLoEvent(currentCourse.value, currentLo.value, tutorsId.value);

[NoCoverage] EqualityOperator
services/connect/services/connect.svelte.ts:186:11
     if (anonMode) return;
     if (currentCourse.value && currentLo.value && tutorsId.value) {
       if (analyticsEnabled) analyticsService.learningEvent(currentCourse.value, params, currentLo.value, tutorsId.value);
-      if (tutorsId.value.share === "true" && !currentCourse.value.isPrivate) {
+      if (tutorsId.value.share !== "true" && !currentCourse.value.isPrivate) {
         presenceService.sendLoEvent(currentCourse.value, currentLo.value, tutorsId.value);
       }

[NoCoverage] BooleanLiteral
services/connect/services/connect.svelte.ts:186:46
     if (anonMode) return;
     if (currentCourse.value && currentLo.value && tutorsId.value) {
       if (analyticsEnabled) analyticsService.learningEvent(currentCourse.value, params, currentLo.value, tutorsId.value);
-      if (tutorsId.value.share === "true" && !currentCourse.value.isPrivate) {
+      if (tutorsId.value.share === "true" && currentCourse.value.isPrivate) {
         presenceService.sendLoEvent(currentCourse.value, currentLo.value, tutorsId.value);
       }

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:196:16
    * Starts periodic analytics update timer
    * Updates page counts every 30 seconds when page is visible
    */
-  startTimer() {
-    if (anonMode) return;
-    this.intervalId = setInterval(() => {
-      if (!document.hidden && currentCourse.value && currentLo.value && tutorsId.value) {
-        if (analyticsEnabled) analyticsService.updatePageCount(currentCourse.value, currentLo.value, tutorsId.value);
-      }
-    }, 30 * 1000);
-  },
+  startTimer() {},
 
   /**

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:197:9
    * Updates page counts every 30 seconds when page is visible
    */
   startTimer() {
-    if (anonMode) return;
+    if (false) return;
     this.intervalId = setInterval(() => {
       if (!document.hidden && currentCourse.value && currentLo.value && tutorsId.value) {

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:197:9
    * Updates page counts every 30 seconds when page is visible
    */
   startTimer() {
-    if (anonMode) return;
+    if (true) return;
     this.intervalId = setInterval(() => {
       if (!document.hidden && currentCourse.value && currentLo.value && tutorsId.value) {

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:198:41
    */
   startTimer() {
     if (anonMode) return;
-    this.intervalId = setInterval(() => {
-      if (!document.hidden && currentCourse.value && currentLo.value && tutorsId.value) {
-        if (analyticsEnabled) analyticsService.updatePageCount(currentCourse.value, currentLo.value, tutorsId.value);
-      }
-    }, 30 * 1000);
+    this.intervalId = setInterval(() => {}, 30 * 1000);
   },
 

[NoCoverage] BooleanLiteral
services/connect/services/connect.svelte.ts:199:11
   startTimer() {
     if (anonMode) return;
     this.intervalId = setInterval(() => {
-      if (!document.hidden && currentCourse.value && currentLo.value && tutorsId.value) {
+      if (document.hidden && currentCourse.value && currentLo.value && tutorsId.value) {
         if (analyticsEnabled) analyticsService.updatePageCount(currentCourse.value, currentLo.value, tutorsId.value);
       }
