[NoCoverage] LogicalOperator
services/connect/services/connect.svelte.ts:199:11
   startTimer() {
     if (anonMode) return;
     this.intervalId = setInterval(() => {
-      if (!document.hidden && currentCourse.value && currentLo.value && tutorsId.value) {
+      if (!document.hidden && currentCourse.value || currentLo.value && tutorsId.value) {
         if (analyticsEnabled) analyticsService.updatePageCount(currentCourse.value, currentLo.value, tutorsId.value);
       }

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:200:13
     if (anonMode) return;
     this.intervalId = setInterval(() => {
       if (!document.hidden && currentCourse.value && currentLo.value && tutorsId.value) {
-        if (analyticsEnabled) analyticsService.updatePageCount(currentCourse.value, currentLo.value, tutorsId.value);
+        if (false) analyticsService.updatePageCount(currentCourse.value, currentLo.value, tutorsId.value);
       }
     }, 30 * 1000);

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:200:13
     if (anonMode) return;
     this.intervalId = setInterval(() => {
       if (!document.hidden && currentCourse.value && currentLo.value && tutorsId.value) {
-        if (analyticsEnabled) analyticsService.updatePageCount(currentCourse.value, currentLo.value, tutorsId.value);
+        if (true) analyticsService.updatePageCount(currentCourse.value, currentLo.value, tutorsId.value);
       }
     }, 30 * 1000);

[NoCoverage] ArithmeticOperator
services/connect/services/connect.svelte.ts:202:8
       if (!document.hidden && currentCourse.value && currentLo.value && tutorsId.value) {
         if (analyticsEnabled) analyticsService.updatePageCount(currentCourse.value, currentLo.value, tutorsId.value);
       }
-    }, 30 * 1000);
+    }, 30 / 1000);
   },
 

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:208:15
   /**
    * Stops analytics update timer
    */
-  stopTimer() {
-    if (this.intervalId) {
-      clearInterval(this.intervalId);
-      this.intervalId = null;
-    }
-  },
+  stopTimer() {},
 
   checkWhiteList(): void {

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:209:9
    * Stops analytics update timer
    */
   stopTimer() {
-    if (this.intervalId) {
+    if (true) {
       clearInterval(this.intervalId);
       this.intervalId = null;

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:209:9
    * Stops analytics update timer
    */
   stopTimer() {
-    if (this.intervalId) {
+    if (false) {
       clearInterval(this.intervalId);
       this.intervalId = null;

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:215:26
     }
   },
 
-  checkWhiteList(): void {
-    const enrollment = currentCourse.value?.enrollment;
-    if (enrollment?.whitelist && enrollment.whitelist.length > 0) {
-      if (!tutorsId.value?.login) {
-        goto(`/`);
-      } else {
-        if (!enrollment.whitelist.includes(tutorsId.value.login)) {
-          goto(`/`);
-        }
-      }
-    }
-  }
+  checkWhiteList(): void {}
 };
 

[NoCoverage] OptionalChaining
services/connect/services/connect.svelte.ts:216:24
   },
 
   checkWhiteList(): void {
-    const enrollment = currentCourse.value?.enrollment;
+    const enrollment = currentCourse.value.enrollment;
     if (enrollment?.whitelist && enrollment.whitelist.length > 0) {
       if (!tutorsId.value?.login) {

[NoCoverage] OptionalChaining
services/connect/services/connect.svelte.ts:217:9
 
   checkWhiteList(): void {
     const enrollment = currentCourse.value?.enrollment;
-    if (enrollment?.whitelist && enrollment.whitelist.length > 0) {
+    if (enrollment.whitelist && enrollment.whitelist.length > 0) {
       if (!tutorsId.value?.login) {
         goto(`/`);

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:217:67
 
   checkWhiteList(): void {
     const enrollment = currentCourse.value?.enrollment;
-    if (enrollment?.whitelist && enrollment.whitelist.length > 0) {
-      if (!tutorsId.value?.login) {
-        goto(`/`);
-      } else {
-        if (!enrollment.whitelist.includes(tutorsId.value.login)) {
-          goto(`/`);
-        }
-      }
-    }
+    if (enrollment?.whitelist && enrollment.whitelist.length > 0) {}
   }
 };

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:218:11
   checkWhiteList(): void {
     const enrollment = currentCourse.value?.enrollment;
     if (enrollment?.whitelist && enrollment.whitelist.length > 0) {
-      if (!tutorsId.value?.login) {
+      if (false) {
         goto(`/`);
       } else {

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:218:11
   checkWhiteList(): void {
     const enrollment = currentCourse.value?.enrollment;
     if (enrollment?.whitelist && enrollment.whitelist.length > 0) {
-      if (!tutorsId.value?.login) {
+      if (true) {
         goto(`/`);
       } else {

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:220:14
     if (enrollment?.whitelist && enrollment.whitelist.length > 0) {
       if (!tutorsId.value?.login) {
         goto(`/`);
-      } else {
-        if (!enrollment.whitelist.includes(tutorsId.value.login)) {
-          goto(`/`);
-        }
-      }
+      } else {}
     }
   }

[NoCoverage] ConditionalExpression
services/connect/services/connect.svelte.ts:221:13
       if (!tutorsId.value?.login) {
         goto(`/`);
       } else {
-        if (!enrollment.whitelist.includes(tutorsId.value.login)) {
+        if (true) {
           goto(`/`);
         }

[NoCoverage] BlockStatement
services/connect/services/connect.svelte.ts:221:67
       if (!tutorsId.value?.login) {
         goto(`/`);
       } else {
-        if (!enrollment.whitelist.includes(tutorsId.value.login)) {
-          goto(`/`);
-        }
+        if (!enrollment.whitelist.includes(tutorsId.value.login)) {}
       }
     }
