[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:18:18
    * Loads course visit data from local storage into memory
    * Only executes in browser environment
    */
-  reload(): void {
-    if (browser && localStorage.courseVisits) {
-      this.courseVisits = JSON.parse(localStorage.courseVisits);
-    }
-  },
+  reload(): void {},
   /**
    * Persists current course visit data to local storage

[NoCoverage] ConditionalExpression
services/connect/services/localStorageProfile.ts:19:9
    * Only executes in browser environment
    */
   reload(): void {
-    if (browser && localStorage.courseVisits) {
+    if (true) {
       this.courseVisits = JSON.parse(localStorage.courseVisits);
     }

[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:19:47
    * Only executes in browser environment
    */
   reload(): void {
-    if (browser && localStorage.courseVisits) {
-      this.courseVisits = JSON.parse(localStorage.courseVisits);
-    }
+    if (browser && localStorage.courseVisits) {}
   },
   /**

[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:27:16
    * Persists current course visit data to local storage
    * Only executes in browser environment
    */
-  save(): void {
-    if (browser) localStorage.courseVisits = JSON.stringify(this.courseVisits);
-  },
+  save(): void {},
 
   /**

[NoCoverage] ConditionalExpression
services/connect/services/localStorageProfile.ts:28:9
    * Only executes in browser environment
    */
   save(): void {
-    if (browser) localStorage.courseVisits = JSON.stringify(this.courseVisits);
+    if (false) localStorage.courseVisits = JSON.stringify(this.courseVisits);
   },
 

[NoCoverage] ConditionalExpression
services/connect/services/localStorageProfile.ts:28:9
    * Only executes in browser environment
    */
   save(): void {
-    if (browser) localStorage.courseVisits = JSON.stringify(this.courseVisits);
+    if (true) localStorage.courseVisits = JSON.stringify(this.courseVisits);
   },
 

[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:37:34
    * Updates visit count and timestamp if course already exists
    * @param course - The course being visited
    */
-  logCourseVisit(course: Course) {
-    this.reload();
-    const visit = this.courseVisits.find((c) => c.id === course.courseId);
-    if (visit) {
-      visit.visits++;
-      visit.lastVisit = new Date();
-    } else {
-      const courseVisit: CourseVisit = {
-        id: course.courseId,
-        title: course.title,
-        lastVisit: new Date(),
-        credits: course.properties.credits,
-        visits: 1
-      };
-      if (course.properties.icon) {
-        courseVisit.icon = course.properties.icon as unknown as IconType;
-      } else {
-        courseVisit.image = course.img;
-      }
-      this.courseVisits.unshift(courseVisit);
-    }
-    this.save();
-  },
+  logCourseVisit(course: Course) {},
 
   /**

[NoCoverage] ConditionalExpression
services/connect/services/localStorageProfile.ts:39:49
    */
   logCourseVisit(course: Course) {
     this.reload();
-    const visit = this.courseVisits.find((c) => c.id === course.courseId);
+    const visit = this.courseVisits.find((c) => false);
     if (visit) {
       visit.visits++;

[NoCoverage] EqualityOperator
services/connect/services/localStorageProfile.ts:39:49
    */
   logCourseVisit(course: Course) {
     this.reload();
-    const visit = this.courseVisits.find((c) => c.id === course.courseId);
+    const visit = this.courseVisits.find((c) => c.id !== course.courseId);
     if (visit) {
       visit.visits++;

[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:40:16
   logCourseVisit(course: Course) {
     this.reload();
     const visit = this.courseVisits.find((c) => c.id === course.courseId);
-    if (visit) {
-      visit.visits++;
-      visit.lastVisit = new Date();
-    } else {
+    if (visit) {} else {
       const courseVisit: CourseVisit = {
         id: course.courseId,

[NoCoverage] ConditionalExpression
services/connect/services/localStorageProfile.ts:40:9
   logCourseVisit(course: Course) {
     this.reload();
     const visit = this.courseVisits.find((c) => c.id === course.courseId);
-    if (visit) {
+    if (true) {
       visit.visits++;
       visit.lastVisit = new Date();

[NoCoverage] UpdateOperator
services/connect/services/localStorageProfile.ts:41:7
     this.reload();
     const visit = this.courseVisits.find((c) => c.id === course.courseId);
     if (visit) {
-      visit.visits++;
+      visit.visits--;
       visit.lastVisit = new Date();
     } else {

[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:43:12
     if (visit) {
       visit.visits++;
       visit.lastVisit = new Date();
-    } else {
-      const courseVisit: CourseVisit = {
-        id: course.courseId,
-        title: course.title,
-        lastVisit: new Date(),
-        credits: course.properties.credits,
-        visits: 1
-      };
-      if (course.properties.icon) {
-        courseVisit.icon = course.properties.icon as unknown as IconType;
-      } else {
-        courseVisit.image = course.img;
-      }
-      this.courseVisits.unshift(courseVisit);
-    }
+    } else {}
     this.save();
   },

[NoCoverage] ConditionalExpression
services/connect/services/localStorageProfile.ts:51:11
         credits: course.properties.credits,
         visits: 1
       };
-      if (course.properties.icon) {
+      if (false) {
         courseVisit.icon = course.properties.icon as unknown as IconType;
       } else {

[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:51:35
         credits: course.properties.credits,
         visits: 1
       };
-      if (course.properties.icon) {
-        courseVisit.icon = course.properties.icon as unknown as IconType;
-      } else {
+      if (course.properties.icon) {} else {
         courseVisit.image = course.img;
       }

[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:53:14
       };
       if (course.properties.icon) {
         courseVisit.icon = course.properties.icon as unknown as IconType;
-      } else {
-        courseVisit.image = course.img;
-      }
+      } else {}
       this.courseVisits.unshift(courseVisit);
     }

[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:65:39
    * Removes a course visit record from local storage
    * @param courseId - Identifier of course to remove
    */
-  deleteCourseVisit(courseId: string) {
-    this.reload();
-    this.courseVisits = this.courseVisits.filter((c) => c.id !== courseId);
-    if (browser) localStorage.courseVisits = JSON.stringify(this.courseVisits);
-    this.save();
-  },
+  deleteCourseVisit(courseId: string) {},
 
   /**

[NoCoverage] ConditionalExpression
services/connect/services/localStorageProfile.ts:67:57
    */
   deleteCourseVisit(courseId: string) {
     this.reload();
-    this.courseVisits = this.courseVisits.filter((c) => c.id !== courseId);
+    this.courseVisits = this.courseVisits.filter((c) => false);
     if (browser) localStorage.courseVisits = JSON.stringify(this.courseVisits);
     this.save();

[NoCoverage] ArrowFunction
services/connect/services/localStorageProfile.ts:67:50
    */
   deleteCourseVisit(courseId: string) {
     this.reload();
-    this.courseVisits = this.courseVisits.filter((c) => c.id !== courseId);
+    this.courseVisits = this.courseVisits.filter(() => undefined);
     if (browser) localStorage.courseVisits = JSON.stringify(this.courseVisits);
     this.save();

[NoCoverage] ConditionalExpression
services/connect/services/localStorageProfile.ts:68:9
   deleteCourseVisit(courseId: string) {
     this.reload();
     this.courseVisits = this.courseVisits.filter((c) => c.id !== courseId);
-    if (browser) localStorage.courseVisits = JSON.stringify(this.courseVisits);
+    if (false) localStorage.courseVisits = JSON.stringify(this.courseVisits);
     this.save();
   },

[NoCoverage] ConditionalExpression
services/connect/services/localStorageProfile.ts:68:9
   deleteCourseVisit(courseId: string) {
     this.reload();
     this.courseVisits = this.courseVisits.filter((c) => c.id !== courseId);
-    if (browser) localStorage.courseVisits = JSON.stringify(this.courseVisits);
+    if (true) localStorage.courseVisits = JSON.stringify(this.courseVisits);
     this.save();
   },

[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:76:45
    * Retrieves all course visit records from local storage
    * @returns Promise resolving to array of course visits
    */
-  getCourseVisits(): Promise<CourseVisit[]> {
-    this.reload();
-    return this.courseVisits;
-  },
+  getCourseVisits(): Promise<CourseVisit[]> {},
 
   /**

[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:85:37
    * Marks a course as favorite in local storage
    * @param courseId - Identifier of course to favorite
    */
-  favouriteCourse(courseId: string) {
-    this.reload();
-    const courseVisit = this.courseVisits.find((c) => c.id === courseId);
-    if (courseVisit) {
-      courseVisit.favourite = true;
-    }
-    this.save();
-  },
+  favouriteCourse(courseId: string) {},
 
   /**

[NoCoverage] EqualityOperator
services/connect/services/localStorageProfile.ts:87:55
    */
   favouriteCourse(courseId: string) {
     this.reload();
-    const courseVisit = this.courseVisits.find((c) => c.id === courseId);
+    const courseVisit = this.courseVisits.find((c) => c.id !== courseId);
     if (courseVisit) {
       courseVisit.favourite = true;

[NoCoverage] ConditionalExpression
services/connect/services/localStorageProfile.ts:87:55
    */
   favouriteCourse(courseId: string) {
     this.reload();
-    const courseVisit = this.courseVisits.find((c) => c.id === courseId);
+    const courseVisit = this.courseVisits.find((c) => false);
     if (courseVisit) {
       courseVisit.favourite = true;

[NoCoverage] ConditionalExpression
services/connect/services/localStorageProfile.ts:88:9
   favouriteCourse(courseId: string) {
     this.reload();
     const courseVisit = this.courseVisits.find((c) => c.id === courseId);
-    if (courseVisit) {
+    if (false) {
       courseVisit.favourite = true;
     }

[NoCoverage] ConditionalExpression
services/connect/services/localStorageProfile.ts:88:9
   favouriteCourse(courseId: string) {
     this.reload();
     const courseVisit = this.courseVisits.find((c) => c.id === courseId);
-    if (courseVisit) {
+    if (true) {
       courseVisit.favourite = true;
     }

[NoCoverage] BooleanLiteral
services/connect/services/localStorageProfile.ts:89:31
     this.reload();
     const courseVisit = this.courseVisits.find((c) => c.id === courseId);
     if (courseVisit) {
-      courseVisit.favourite = true;
+      courseVisit.favourite = false;
     }
     this.save();

[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:98:39
    * Removes favorite status from a course in local storage
    * @param courseId - Identifier of course to unfavorite
    */
-  unfavouriteCourse(courseId: string) {
-    this.reload();
-    const courseVisit = this.courseVisits.find((c) => c.id === courseId);
-    if (courseVisit) {
-      courseVisit.favourite = false;
-    }
-    this.save();
-  }
+  unfavouriteCourse(courseId: string) {}
 };
 

[NoCoverage] BlockStatement
services/connect/services/localStorageProfile.ts:101:22
   unfavouriteCourse(courseId: string) {
     this.reload();
     const courseVisit = this.courseVisits.find((c) => c.id === courseId);
-    if (courseVisit) {
-      courseVisit.favourite = false;
-    }
+    if (courseVisit) {}
     this.save();
   }

[NoCoverage] BooleanLiteral
services/connect/services/localStorageProfile.ts:102:31
     this.reload();
     const courseVisit = this.courseVisits.find((c) => c.id === courseId);
     if (courseVisit) {
-      courseVisit.favourite = false;
+      courseVisit.favourite = true;
     }
     this.save();
