[NoCoverage] BlockStatement
services/connect/services/supabaseProfile.svelte.ts:22:18
    * Only retrieves data if user is authenticated
    * @async
    */
-  async reload() {
-    if (tutorsId.value?.login) {
-      const { data: profile } = await supabase.from("tutors-connect-profiles").select("profile").eq("tutorId", tutorsId.value?.login);
-      if (profile.length > 0) {
-        this.courseVisits = profile[0].profile as unknown as CourseVisit[];
-      }
-    }
-  },
+  async reload() {},
 
   /**

[NoCoverage] OptionalChaining
services/connect/services/supabaseProfile.svelte.ts:23:9
    * @async
    */
   async reload() {
-    if (tutorsId.value?.login) {
+    if (tutorsId.value.login) {
       const { data: profile } = await supabase.from("tutors-connect-profiles").select("profile").eq("tutorId", tutorsId.value?.login);
       if (profile.length > 0) {

[NoCoverage] ConditionalExpression
services/connect/services/supabaseProfile.svelte.ts:23:9
    * @async
    */
   async reload() {
-    if (tutorsId.value?.login) {
+    if (false) {
       const { data: profile } = await supabase.from("tutors-connect-profiles").select("profile").eq("tutorId", tutorsId.value?.login);
       if (profile.length > 0) {

[NoCoverage] OptionalChaining
services/connect/services/supabaseProfile.svelte.ts:24:112
    */
   async reload() {
     if (tutorsId.value?.login) {
-      const { data: profile } = await supabase.from("tutors-connect-profiles").select("profile").eq("tutorId", tutorsId.value?.login);
+      const { data: profile } = await supabase.from("tutors-connect-profiles").select("profile").eq("tutorId", tutorsId.value.login);
       if (profile.length > 0) {
         this.courseVisits = profile[0].profile as unknown as CourseVisit[];

[NoCoverage] StringLiteral
services/connect/services/supabaseProfile.svelte.ts:24:87
    */
   async reload() {
     if (tutorsId.value?.login) {
-      const { data: profile } = await supabase.from("tutors-connect-profiles").select("profile").eq("tutorId", tutorsId.value?.login);
+      const { data: profile } = await supabase.from("tutors-connect-profiles").select("").eq("tutorId", tutorsId.value?.login);
       if (profile.length > 0) {
         this.courseVisits = profile[0].profile as unknown as CourseVisit[];

[NoCoverage] ConditionalExpression
services/connect/services/supabaseProfile.svelte.ts:25:11
   async reload() {
     if (tutorsId.value?.login) {
       const { data: profile } = await supabase.from("tutors-connect-profiles").select("profile").eq("tutorId", tutorsId.value?.login);
-      if (profile.length > 0) {
+      if (true) {
         this.courseVisits = profile[0].profile as unknown as CourseVisit[];
       }

[NoCoverage] BlockStatement
services/connect/services/supabaseProfile.svelte.ts:25:31
   async reload() {
     if (tutorsId.value?.login) {
       const { data: profile } = await supabase.from("tutors-connect-profiles").select("profile").eq("tutorId", tutorsId.value?.login);
-      if (profile.length > 0) {
-        this.courseVisits = profile[0].profile as unknown as CourseVisit[];
-      }
+      if (profile.length > 0) {}
     }
   },

[NoCoverage] BlockStatement
services/connect/services/supabaseProfile.svelte.ts:36:16
    * Only saves if user is authenticated
    * @async
    */
-  async save() {
-    const id = tutorsId.value?.login;
-    if (id) {
-      const { error } = await supabase.from("tutors-connect-profiles").upsert({ tutorId: tutorsId.value?.login, profile: this.courseVisits });
-      if (error) {
-        console.log(error);
-      }
-    }
-  },
+  async save() {},
 
   /**

[NoCoverage] OptionalChaining
services/connect/services/supabaseProfile.svelte.ts:37:16
    * @async
    */
   async save() {
-    const id = tutorsId.value?.login;
+    const id = tutorsId.value.login;
     if (id) {
       const { error } = await supabase.from("tutors-connect-profiles").upsert({ tutorId: tutorsId.value?.login, profile: this.courseVisits });

[NoCoverage] BlockStatement
services/connect/services/supabaseProfile.svelte.ts:38:13
    */
   async save() {
     const id = tutorsId.value?.login;
-    if (id) {
-      const { error } = await supabase.from("tutors-connect-profiles").upsert({ tutorId: tutorsId.value?.login, profile: this.courseVisits });
-      if (error) {
-        console.log(error);
-      }
-    }
+    if (id) {}
   },
 

[NoCoverage] ConditionalExpression
services/connect/services/supabaseProfile.svelte.ts:38:9
    */
   async save() {
     const id = tutorsId.value?.login;
-    if (id) {
+    if (false) {
       const { error } = await supabase.from("tutors-connect-profiles").upsert({ tutorId: tutorsId.value?.login, profile: this.courseVisits });
       if (error) {

[NoCoverage] OptionalChaining
services/connect/services/supabaseProfile.svelte.ts:39:90
   async save() {
     const id = tutorsId.value?.login;
     if (id) {
-      const { error } = await supabase.from("tutors-connect-profiles").upsert({ tutorId: tutorsId.value?.login, profile: this.courseVisits });
+      const { error } = await supabase.from("tutors-connect-profiles").upsert({ tutorId: tutorsId.value.login, profile: this.courseVisits });
       if (error) {
         console.log(error);

[NoCoverage] ObjectLiteral
services/connect/services/supabaseProfile.svelte.ts:39:79
   async save() {
     const id = tutorsId.value?.login;
     if (id) {
-      const { error } = await supabase.from("tutors-connect-profiles").upsert({ tutorId: tutorsId.value?.login, profile: this.courseVisits });
+      const { error } = await supabase.from("tutors-connect-profiles").upsert({});
       if (error) {
         console.log(error);

[NoCoverage] BlockStatement
services/connect/services/supabaseProfile.svelte.ts:40:18
     const id = tutorsId.value?.login;
     if (id) {
       const { error } = await supabase.from("tutors-connect-profiles").upsert({ tutorId: tutorsId.value?.login, profile: this.courseVisits });
-      if (error) {
-        console.log(error);
-      }
+      if (error) {}
     }
   },

[NoCoverage] ConditionalExpression
services/connect/services/supabaseProfile.svelte.ts:40:11
     const id = tutorsId.value?.login;
     if (id) {
       const { error } = await supabase.from("tutors-connect-profiles").upsert({ tutorId: tutorsId.value?.login, profile: this.courseVisits });
-      if (error) {
+      if (true) {
         console.log(error);
       }

[NoCoverage] BlockStatement
services/connect/services/supabaseProfile.svelte.ts:53:40
    * @async
    * @param course - The course being visited
    */
-  async logCourseVisit(course: Course) {
-    await this.reload();
-    const visit = this.courseVisits.find((c) => c.id === course.courseId);
-    if (visit) {
-      visit.visits++;
-      visit.lastVisit = new Date();
-    } else {
-      const courseVisit: CourseVisit = {
-        id: course.courseId,
-        title: course.title,
-        lastVisit: new Date(),
-        credits: course.properties.credits,
-        visits: 1
-      };
-      if (course.properties.icon) {
-        courseVisit.icon = course.properties.icon as unknown as IconType;
-      } else {
-        courseVisit.image = course.img;
-      }
-      this.courseVisits.unshift(courseVisit);
-    }
-    await this.save();
-  },
+  async logCourseVisit(course: Course) {},
 
   /**

[NoCoverage] ConditionalExpression
services/connect/services/supabaseProfile.svelte.ts:55:49
    */
   async logCourseVisit(course: Course) {
     await this.reload();
-    const visit = this.courseVisits.find((c) => c.id === course.courseId);
+    const visit = this.courseVisits.find((c) => false);
     if (visit) {
       visit.visits++;

[NoCoverage] ConditionalExpression
services/connect/services/supabaseProfile.svelte.ts:55:49
    */
   async logCourseVisit(course: Course) {
     await this.reload();
-    const visit = this.courseVisits.find((c) => c.id === course.courseId);
+    const visit = this.courseVisits.find((c) => true);
     if (visit) {
       visit.visits++;

[NoCoverage] ConditionalExpression
services/connect/services/supabaseProfile.svelte.ts:56:9
   async logCourseVisit(course: Course) {
     await this.reload();
     const visit = this.courseVisits.find((c) => c.id === course.courseId);
-    if (visit) {
+    if (false) {
       visit.visits++;
       visit.lastVisit = new Date();

[NoCoverage] ObjectLiteral
services/connect/services/supabaseProfile.svelte.ts:60:40
       visit.visits++;
       visit.lastVisit = new Date();
     } else {
-      const courseVisit: CourseVisit = {
-        id: course.courseId,
-        title: course.title,
-        lastVisit: new Date(),
-        credits: course.properties.credits,
-        visits: 1
-      };
+      const courseVisit: CourseVisit = {};
       if (course.properties.icon) {
         courseVisit.icon = course.properties.icon as unknown as IconType;

[NoCoverage] BlockStatement
services/connect/services/supabaseProfile.svelte.ts:82:45
    * @async
    * @param courseId - Identifier of course to remove
    */
-  async deleteCourseVisit(courseId: string) {
-    await this.reload();
-    this.courseVisits = this.courseVisits.filter((c) => c.id !== courseId);
-    await this.save();
-  },
+  async deleteCourseVisit(courseId: string) {},
 
   /**

[NoCoverage] MethodExpression
services/connect/services/supabaseProfile.svelte.ts:84:25
    */
   async deleteCourseVisit(courseId: string) {
     await this.reload();
-    this.courseVisits = this.courseVisits.filter((c) => c.id !== courseId);
+    this.courseVisits = this.courseVisits;
     await this.save();
   },

[NoCoverage] ArrowFunction
services/connect/services/supabaseProfile.svelte.ts:84:50
    */
   async deleteCourseVisit(courseId: string) {
     await this.reload();
-    this.courseVisits = this.courseVisits.filter((c) => c.id !== courseId);
+    this.courseVisits = this.courseVisits.filter(() => undefined);
     await this.save();
   },

[NoCoverage] BlockStatement
services/connect/services/supabaseProfile.svelte.ts:93:51
    * @async
    * @returns Promise resolving to array of course visits
    */
-  async getCourseVisits(): Promise<CourseVisit[]> {
-    await this.reload();
-    return this.courseVisits;
-  },
+  async getCourseVisits(): Promise<CourseVisit[]> {},
 
   /**

[NoCoverage] BlockStatement
services/connect/services/supabaseProfile.svelte.ts:103:43
    * @async
    * @param courseId - Identifier of course to favorite
    */
-  async favouriteCourse(courseId: string) {
-    await this.reload();
-    const course = this.courseVisits.find((c) => c.id === courseId);
-    if (course) {
-      course.favourite = true;
-    }
-    await this.save();
-  },
+  async favouriteCourse(courseId: string) {},
 
   /**

[NoCoverage] ConditionalExpression
services/connect/services/supabaseProfile.svelte.ts:105:50
    */
   async favouriteCourse(courseId: string) {
     await this.reload();
-    const course = this.courseVisits.find((c) => c.id === courseId);
+    const course = this.courseVisits.find((c) => true);
     if (course) {
       course.favourite = true;

[NoCoverage] EqualityOperator
services/connect/services/supabaseProfile.svelte.ts:105:50
    */
   async favouriteCourse(courseId: string) {
     await this.reload();
-    const course = this.courseVisits.find((c) => c.id === courseId);
+    const course = this.courseVisits.find((c) => c.id !== courseId);
     if (course) {
       course.favourite = true;

[NoCoverage] ConditionalExpression
services/connect/services/supabaseProfile.svelte.ts:106:9
   async favouriteCourse(courseId: string) {
     await this.reload();
     const course = this.courseVisits.find((c) => c.id === courseId);
-    if (course) {
+    if (true) {
       course.favourite = true;
     }

[NoCoverage] ConditionalExpression
services/connect/services/supabaseProfile.svelte.ts:106:9
   async favouriteCourse(courseId: string) {
     await this.reload();
     const course = this.courseVisits.find((c) => c.id === courseId);
-    if (course) {
+    if (false) {
       course.favourite = true;
     }

[NoCoverage] BooleanLiteral
services/connect/services/supabaseProfile.svelte.ts:107:26
     await this.reload();
     const course = this.courseVisits.find((c) => c.id === courseId);
     if (course) {
-      course.favourite = true;
+      course.favourite = false;
     }
     await this.save();

[NoCoverage] BlockStatement
services/connect/services/supabaseProfile.svelte.ts:117:45
    * @async
    * @param courseId - Identifier of course to unfavorite
    */
-  async unfavouriteCourse(courseId: string) {
-    await this.reload();
-    const course = this.courseVisits.find((c) => c.id === courseId);
-    if (course) {
-      course.favourite = false;
-    }
-    await this.save();
-  }
+  async unfavouriteCourse(courseId: string) {}
 };
 

[NoCoverage] ArrowFunction
services/connect/services/supabaseProfile.svelte.ts:119:43
    */
   async unfavouriteCourse(courseId: string) {
     await this.reload();
-    const course = this.courseVisits.find((c) => c.id === courseId);
+    const course = this.courseVisits.find(() => undefined);
     if (course) {
       course.favourite = false;

[NoCoverage] BlockStatement
services/connect/services/supabaseProfile.svelte.ts:120:17
   async unfavouriteCourse(courseId: string) {
     await this.reload();
     const course = this.courseVisits.find((c) => c.id === courseId);
-    if (course) {
-      course.favourite = false;
-    }
+    if (course) {}
     await this.save();
   }

[NoCoverage] BooleanLiteral
services/connect/services/supabaseProfile.svelte.ts:121:26
     await this.reload();
     const course = this.courseVisits.find((c) => c.id === courseId);
     if (course) {
-      course.favourite = false;
+      course.favourite = true;
     }
     await this.save();
