[NoCoverage] BooleanLiteral
services/connect/utils/allCourseAccess.ts:16:7
  * @param course - The course being accessed
  */
 export async function updateCourseList(course: Course): Promise<void> {
-  if (!isValidCourseName(course.courseId)) return;
+  if (isValidCourseName(course.courseId)) return;
   const { data, error } = await supabase.from("tutors-connect-courses").select("visit_count").eq("course_id", course.courseId).single();
 

[NoCoverage] ConditionalExpression
services/connect/utils/allCourseAccess.ts:16:7
  * @param course - The course being accessed
  */
 export async function updateCourseList(course: Course): Promise<void> {
-  if (!isValidCourseName(course.courseId)) return;
+  if (true) return;
   const { data, error } = await supabase.from("tutors-connect-courses").select("visit_count").eq("course_id", course.courseId).single();
 

[NoCoverage] StringLiteral
services/connect/utils/allCourseAccess.ts:17:80
  */
 export async function updateCourseList(course: Course): Promise<void> {
   if (!isValidCourseName(course.courseId)) return;
-  const { data, error } = await supabase.from("tutors-connect-courses").select("visit_count").eq("course_id", course.courseId).single();
+  const { data, error } = await supabase.from("tutors-connect-courses").select("").eq("course_id", course.courseId).single();
 
   if (error && error.code !== "PGRST116") {

[NoCoverage] StringLiteral
services/connect/utils/allCourseAccess.ts:17:98
  */
 export async function updateCourseList(course: Course): Promise<void> {
   if (!isValidCourseName(course.courseId)) return;
-  const { data, error } = await supabase.from("tutors-connect-courses").select("visit_count").eq("course_id", course.courseId).single();
+  const { data, error } = await supabase.from("tutors-connect-courses").select("visit_count").eq("", course.courseId).single();
 
   if (error && error.code !== "PGRST116") {

[NoCoverage] LogicalOperator
services/connect/utils/allCourseAccess.ts:19:7
   if (!isValidCourseName(course.courseId)) return;
   const { data, error } = await supabase.from("tutors-connect-courses").select("visit_count").eq("course_id", course.courseId).single();
 
-  if (error && error.code !== "PGRST116") {
+  if (error || error.code !== "PGRST116") {
     console.error("Error fetching row:", error);
     return;

[NoCoverage] ConditionalExpression
services/connect/utils/allCourseAccess.ts:19:7
   if (!isValidCourseName(course.courseId)) return;
   const { data, error } = await supabase.from("tutors-connect-courses").select("visit_count").eq("course_id", course.courseId).single();
 
-  if (error && error.code !== "PGRST116") {
+  if (false) {
     console.error("Error fetching row:", error);
     return;

[NoCoverage] StringLiteral
services/connect/utils/allCourseAccess.ts:20:19
   const { data, error } = await supabase.from("tutors-connect-courses").select("visit_count").eq("course_id", course.courseId).single();
 
   if (error && error.code !== "PGRST116") {
-    console.error("Error fetching row:", error);
+    console.error("", error);
     return;
   }

[NoCoverage] ArithmeticOperator
services/connect/utils/allCourseAccess.ts:24:28
     return;
   }
 
-  const newVisits = data ? data.visit_count + 1 : 1;
+  const newVisits = data ? data.visit_count - 1 : 1;
   const now = new Date();
 

[NoCoverage] BlockStatement
services/connect/utils/allCourseAccess.ts:38:20
     { onConflict: ["course_id"] }
   );
 
-  if (upsertError) {
-    console.error("Error upserting row:", upsertError);
-  }
+  if (upsertError) {}
 }
 

[NoCoverage] ConditionalExpression
services/connect/utils/allCourseAccess.ts:38:7
     { onConflict: ["course_id"] }
   );
 
-  if (upsertError) {
+  if (false) {
     console.error("Error upserting row:", upsertError);
   }

[NoCoverage] BlockStatement
services/connect/utils/allCourseAccess.ts:48:42
  * @param course - The course to create a visit record for
  * @returns CourseVisit object with course metadata
  */
-function getCourseRecord(course: Course) {
-  const courseVisit: CourseVisit = {
-    id: course.courseId,
-    title: course.title,
-    lastVisit: new Date(),
-    credits: course.properties.credits,
-    private: course.isPrivate
-  };
-  if (course.properties.icon) {
-    courseVisit.icon = course.properties.icon as unknown as IconType;
-  } else {
-    courseVisit.img = course.img;
-  }
-  return courseVisit;
-}
+function getCourseRecord(course: Course) {}
 
 /**

[NoCoverage] ObjectLiteral
services/connect/utils/allCourseAccess.ts:49:36
  * @returns CourseVisit object with course metadata
  */
 function getCourseRecord(course: Course) {
-  const courseVisit: CourseVisit = {
-    id: course.courseId,
-    title: course.title,
-    lastVisit: new Date(),
-    credits: course.properties.credits,
-    private: course.isPrivate
-  };
+  const courseVisit: CourseVisit = {};
   if (course.properties.icon) {
     courseVisit.icon = course.properties.icon as unknown as IconType;

[NoCoverage] ConditionalExpression
services/connect/utils/allCourseAccess.ts:56:7
     credits: course.properties.credits,
     private: course.isPrivate
   };
-  if (course.properties.icon) {
+  if (true) {
     courseVisit.icon = course.properties.icon as unknown as IconType;
   } else {

[NoCoverage] BlockStatement
services/connect/utils/allCourseAccess.ts:58:10
   };
   if (course.properties.icon) {
     courseVisit.icon = course.properties.icon as unknown as IconType;
-  } else {
-    courseVisit.img = course.img;
-  }
+  } else {}
   return courseVisit;
 }

[NoCoverage] BlockStatement
services/connect/utils/allCourseAccess.ts:69:44
  * @param course - Course identifier to validate
  * @returns boolean indicating if course name is valid
  */
-function isValidCourseName(course: string) {
-  const invalidPatterns = /^(main--|master--|deploy-preview--)|-{2}/;
-  return !invalidPatterns.test(course);
-}
+function isValidCourseName(course: string) {}
 

[NoCoverage] BooleanLiteral
services/connect/utils/allCourseAccess.ts:71:10
  */
 function isValidCourseName(course: string) {
   const invalidPatterns = /^(main--|master--|deploy-preview--)|-{2}/;
-  return !invalidPatterns.test(course);
+  return invalidPatterns.test(course);
 }
 
