[NoCoverage] BlockStatement
services/course/services/live-lab.ts:5:67
 import type { LabService } from "../types";
 import { removeLeadingHashes } from "@tutors/tutors-model-lib";
 
-function getKeyIndex(map: Map<string, string>, targetKey: string) {
-  const keysArray = [...map.keys()];
-  const index = keysArray.indexOf(targetKey);
-  return index;
-}
+function getKeyIndex(map: Map<string, string>, targetKey: string) {}
 
 function truncate(input: string) {

[NoCoverage] ArrayDeclaration
services/course/services/live-lab.ts:6:21
 import { removeLeadingHashes } from "@tutors/tutors-model-lib";
 
 function getKeyIndex(map: Map<string, string>, targetKey: string) {
-  const keysArray = [...map.keys()];
+  const keysArray = [];
   const index = keysArray.indexOf(targetKey);
   return index;

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:11:34
   return index;
 }
 
-function truncate(input: string) {
-  if (input?.length > 24) {
-    return input.substring(0, 20) + "...";
-  }
-  return input;
-}
+function truncate(input: string) {}
 
 export class LiveLab implements LabService {

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:12:27
 }
 
 function truncate(input: string) {
-  if (input?.length > 24) {
-    return input.substring(0, 20) + "...";
-  }
+  if (input?.length > 24) {}
   return input;
 }

[NoCoverage] ConditionalExpression
services/course/services/live-lab.ts:12:7
 }
 
 function truncate(input: string) {
-  if (input?.length > 24) {
+  if (false) {
     return input.substring(0, 20) + "...";
   }

[NoCoverage] MethodExpression
services/course/services/live-lab.ts:13:12
 
 function truncate(input: string) {
   if (input?.length > 24) {
-    return input.substring(0, 20) + "...";
+    return input + "...";
   }
   return input;

[NoCoverage] StringLiteral
services/course/services/live-lab.ts:21:9
 export class LiveLab implements LabService {
   course: Course;
   lab: Lab;
-  url = "";
+  url = "Stryker was here!";
   objectivesHtml = "";
   currentChapterShortTitle = "";

[NoCoverage] StringLiteral
services/course/services/live-lab.ts:24:25
   url = "";
   objectivesHtml = "";
   currentChapterShortTitle = "";
-  currentChapterTitle = "";
+  currentChapterTitle = "Stryker was here!";
   navbarHtml = "";
   horizontalNavbarHtml = "";

[NoCoverage] BooleanLiteral
services/course/services/live-lab.ts:32:16
   chaptersTitles = new Map<string, string>();
   steps: string[] = [];
   index = 0;
-  autoNumber = false;
+  autoNumber = true;
 
   vertical = true;

[NoCoverage] BooleanLiteral
services/course/services/live-lab.ts:34:14
   index = 0;
   autoNumber = false;
 
-  vertical = true;
+  vertical = false;
 
   constructor(course: Course, lo: Lab, labId: string) {

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:36:55
 
   vertical = true;
 
-  constructor(course: Course, lo: Lab, labId: string) {
-    this.course = course;
-    this.autoNumber = course.areLabStepsAutoNumbered;
-    this.url = labId;
-    this.lab = lo;
-    this.convertMdToHtml();
-  }
+  constructor(course: Course, lo: Lab, labId: string) {}
 
   convertMdToHtml() {

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:44:21
     this.convertMdToHtml();
   }
 
-  convertMdToHtml() {
-    // eslint-disable-next-line @typescript-eslint/ban-ts-comment
-    // @ts-ignore
-    this.chaptersHtml = new Map(this.lab.los.map((chapter) => [encodeURI(chapter.shortTitle), chapter.contentHtml]));
-    this.chaptersTitles = new Map(this.lab.los.map((chapter) => [chapter.shortTitle, removeLeadingHashes(chapter.title)]));
-    this.steps = Array.from(this.chaptersHtml.keys());
-  }
+  convertMdToHtml() {}
 
   refreshStep() {

[NoCoverage] ArrowFunction
services/course/services/live-lab.ts:47:50
   convertMdToHtml() {
     // eslint-disable-next-line @typescript-eslint/ban-ts-comment
     // @ts-ignore
-    this.chaptersHtml = new Map(this.lab.los.map((chapter) => [encodeURI(chapter.shortTitle), chapter.contentHtml]));
+    this.chaptersHtml = new Map(this.lab.los.map(() => undefined));
     this.chaptersTitles = new Map(this.lab.los.map((chapter) => [chapter.shortTitle, removeLeadingHashes(chapter.title)]));
     this.steps = Array.from(this.chaptersHtml.keys());

[NoCoverage] ArrowFunction
services/course/services/live-lab.ts:48:52
     // eslint-disable-next-line @typescript-eslint/ban-ts-comment
     // @ts-ignore
     this.chaptersHtml = new Map(this.lab.los.map((chapter) => [encodeURI(chapter.shortTitle), chapter.contentHtml]));
-    this.chaptersTitles = new Map(this.lab.los.map((chapter) => [chapter.shortTitle, removeLeadingHashes(chapter.title)]));
+    this.chaptersTitles = new Map(this.lab.los.map(() => undefined));
     this.steps = Array.from(this.chaptersHtml.keys());
   }

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:52:17
     this.steps = Array.from(this.chaptersHtml.keys());
   }
 
-  refreshStep() {
-    this.content = this.chaptersHtml.get(this.currentChapterShortTitle)!;
-  }
+  refreshStep() {}
   refreshNav() {
     //const number = this.autoNumber ? this.lab.shortTitle + ": " : "";

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:59:25
     //const number = this.autoNumber ? this.lab.shortTitle + ": " : "";
 
     this.navbarHtml = this.lab.los
-      .map((chapter) => {
-        const number = this.autoNumber ? chapter.shortTitle + ": " : "";
-        const active = encodeURI(chapter.shortTitle) === this.currentChapterShortTitle ? "font-bold bg-surface-200 dark:bg-surface-600 pl-4" : "";
-        const title = this.chaptersTitles.get(chapter.shortTitle);
-        return `<a href="${this.url}/${encodeURI(chapter.shortTitle)}"><li class="py-2 px-4 ${active} text-black! dark:text-white!">${number}${title}</li></a>`;
-      })
+      .map((chapter) => {})
       .join("");
 

[NoCoverage] StringLiteral
services/course/services/live-lab.ts:60:70
 
     this.navbarHtml = this.lab.los
       .map((chapter) => {
-        const number = this.autoNumber ? chapter.shortTitle + ": " : "";
+        const number = this.autoNumber ? chapter.shortTitle + ": " : "Stryker was here!";
         const active = encodeURI(chapter.shortTitle) === this.currentChapterShortTitle ? "font-bold bg-surface-200 dark:bg-surface-600 pl-4" : "";
         const title = this.chaptersTitles.get(chapter.shortTitle);

[NoCoverage] EqualityOperator
services/course/services/live-lab.ts:61:24
     this.navbarHtml = this.lab.los
       .map((chapter) => {
         const number = this.autoNumber ? chapter.shortTitle + ": " : "";
-        const active = encodeURI(chapter.shortTitle) === this.currentChapterShortTitle ? "font-bold bg-surface-200 dark:bg-surface-600 pl-4" : "";
+        const active = encodeURI(chapter.shortTitle) !== this.currentChapterShortTitle ? "font-bold bg-surface-200 dark:bg-surface-600 pl-4" : "";
         const title = this.chaptersTitles.get(chapter.shortTitle);
         return `<a href="${this.url}/${encodeURI(chapter.shortTitle)}"><li class="py-2 px-4 ${active} text-black! dark:text-white!">${number}${title}</li></a>`;

[NoCoverage] ConditionalExpression
services/course/services/live-lab.ts:61:24
     this.navbarHtml = this.lab.los
       .map((chapter) => {
         const number = this.autoNumber ? chapter.shortTitle + ": " : "";
-        const active = encodeURI(chapter.shortTitle) === this.currentChapterShortTitle ? "font-bold bg-surface-200 dark:bg-surface-600 pl-4" : "";
+        const active = false ? "font-bold bg-surface-200 dark:bg-surface-600 pl-4" : "";
         const title = this.chaptersTitles.get(chapter.shortTitle);
         return `<a href="${this.url}/${encodeURI(chapter.shortTitle)}"><li class="py-2 px-4 ${active} text-black! dark:text-white!">${number}${title}</li></a>`;

[NoCoverage] StringLiteral
services/course/services/live-lab.ts:63:16
         const number = this.autoNumber ? chapter.shortTitle + ": " : "";
         const active = encodeURI(chapter.shortTitle) === this.currentChapterShortTitle ? "font-bold bg-surface-200 dark:bg-surface-600 pl-4" : "";
         const title = this.chaptersTitles.get(chapter.shortTitle);
-        return `<a href="${this.url}/${encodeURI(chapter.shortTitle)}"><li class="py-2 px-4 ${active} text-black! dark:text-white!">${number}${title}</li></a>`;
+        return ``;
       })
       .join("");

[NoCoverage] StringLiteral
services/course/services/live-lab.ts:65:13
         const title = this.chaptersTitles.get(chapter.shortTitle);
         return `<a href="${this.url}/${encodeURI(chapter.shortTitle)}"><li class="py-2 px-4 ${active} text-black! dark:text-white!">${number}${title}</li></a>`;
       })
-      .join("");
+      .join("Stryker was here!");
 
     const currentChapterIndex = this.lab.los.findIndex((chapter) => encodeURI(chapter.shortTitle) === this.currentChapterShortTitle);

[NoCoverage] ArrowFunction
services/course/services/live-lab.ts:67:56
       })
       .join("");
 
-    const currentChapterIndex = this.lab.los.findIndex((chapter) => encodeURI(chapter.shortTitle) === this.currentChapterShortTitle);
+    const currentChapterIndex = this.lab.los.findIndex(() => undefined);
     if (currentChapterIndex !== -1) {
       let number = "";

[NoCoverage] ConditionalExpression
services/course/services/live-lab.ts:67:69
       })
       .join("");
 
-    const currentChapterIndex = this.lab.los.findIndex((chapter) => encodeURI(chapter.shortTitle) === this.currentChapterShortTitle);
+    const currentChapterIndex = this.lab.los.findIndex((chapter) => false);
     if (currentChapterIndex !== -1) {
       let number = "";

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:68:37
       .join("");
 
     const currentChapterIndex = this.lab.los.findIndex((chapter) => encodeURI(chapter.shortTitle) === this.currentChapterShortTitle);
-    if (currentChapterIndex !== -1) {
-      let number = "";
-      const prevChapter = this.lab.los[currentChapterIndex - 1];
-      // eslint-disable-next-line @typescript-eslint/ban-ts-comment
-      // @ts-ignore
-      const prevTitle = prevChapter ? truncate(this.chaptersTitles.get(prevChapter.shortTitle)) : "";
-      if (prevTitle) number = this.autoNumber ? prevChapter.shortTitle + ": " : "";
-      this.horizontalNavbarHtml = prevChapter
-        ? `<a class="btn btn-sm text-base capitalize" href="${this.url}/${encodeURI(prevChapter.shortTitle)}"> <span aria-hidden="true">&larr;</span>&nbsp; ${number}${prevTitle} </a>`
-        : "";
-
-      number = "";
-      const nextChapter = this.lab.los[currentChapterIndex + 1];
-      if (nextChapter) number = this.autoNumber ? nextChapter.shortTitle + ": " : "";
-      // eslint-disable-next-line @typescript-eslint/ban-ts-comment
-      // @ts-ignore
-      const nextTitle = nextChapter ? truncate(this.chaptersTitles.get(nextChapter.shortTitle)) : "";
-      this.horizontalNavbarHtml += nextChapter
-        ? `<a class="ml-auto btn btn-sm capitalize text-base" style="margin-left: auto" href="${this.url}/${encodeURI(
-            nextChapter.shortTitle
-          )}"> ${number}${nextTitle} &nbsp;<span aria-hidden="true">&rarr;</span></a>`
-        : "";
-    } else {
+    if (currentChapterIndex !== -1) {} else {
       this.horizontalNavbarHtml = "";
     }

[NoCoverage] ConditionalExpression
services/course/services/live-lab.ts:68:9
       .join("");
 
     const currentChapterIndex = this.lab.los.findIndex((chapter) => encodeURI(chapter.shortTitle) === this.currentChapterShortTitle);
-    if (currentChapterIndex !== -1) {
+    if (false) {
       let number = "";
       const prevChapter = this.lab.los[currentChapterIndex - 1];

[NoCoverage] StringLiteral
services/course/services/live-lab.ts:69:20
 
     const currentChapterIndex = this.lab.los.findIndex((chapter) => encodeURI(chapter.shortTitle) === this.currentChapterShortTitle);
     if (currentChapterIndex !== -1) {
-      let number = "";
+      let number = "Stryker was here!";
       const prevChapter = this.lab.los[currentChapterIndex - 1];
       // eslint-disable-next-line @typescript-eslint/ban-ts-comment

[NoCoverage] ArithmeticOperator
services/course/services/live-lab.ts:70:40
     const currentChapterIndex = this.lab.los.findIndex((chapter) => encodeURI(chapter.shortTitle) === this.currentChapterShortTitle);
     if (currentChapterIndex !== -1) {
       let number = "";
-      const prevChapter = this.lab.los[currentChapterIndex - 1];
+      const prevChapter = this.lab.los[currentChapterIndex + 1];
       // eslint-disable-next-line @typescript-eslint/ban-ts-comment
       // @ts-ignore

[NoCoverage] StringLiteral
services/course/services/live-lab.ts:73:99
       const prevChapter = this.lab.los[currentChapterIndex - 1];
       // eslint-disable-next-line @typescript-eslint/ban-ts-comment
       // @ts-ignore
-      const prevTitle = prevChapter ? truncate(this.chaptersTitles.get(prevChapter.shortTitle)) : "";
+      const prevTitle = prevChapter ? truncate(this.chaptersTitles.get(prevChapter.shortTitle)) : "Stryker was here!";
       if (prevTitle) number = this.autoNumber ? prevChapter.shortTitle + ": " : "";
       this.horizontalNavbarHtml = prevChapter

[NoCoverage] ConditionalExpression
services/course/services/live-lab.ts:74:11
       // eslint-disable-next-line @typescript-eslint/ban-ts-comment
       // @ts-ignore
       const prevTitle = prevChapter ? truncate(this.chaptersTitles.get(prevChapter.shortTitle)) : "";
-      if (prevTitle) number = this.autoNumber ? prevChapter.shortTitle + ": " : "";
+      if (true) number = this.autoNumber ? prevChapter.shortTitle + ": " : "";
       this.horizontalNavbarHtml = prevChapter
         ? `<a class="btn btn-sm text-base capitalize" href="${this.url}/${encodeURI(prevChapter.shortTitle)}"> <span aria-hidden="true">&larr;</span>&nbsp; ${number}${prevTitle} </a>`

[NoCoverage] ConditionalExpression
services/course/services/live-lab.ts:74:11
       // eslint-disable-next-line @typescript-eslint/ban-ts-comment
       // @ts-ignore
       const prevTitle = prevChapter ? truncate(this.chaptersTitles.get(prevChapter.shortTitle)) : "";
-      if (prevTitle) number = this.autoNumber ? prevChapter.shortTitle + ": " : "";
+      if (false) number = this.autoNumber ? prevChapter.shortTitle + ": " : "";
       this.horizontalNavbarHtml = prevChapter
         ? `<a class="btn btn-sm text-base capitalize" href="${this.url}/${encodeURI(prevChapter.shortTitle)}"> <span aria-hidden="true">&larr;</span>&nbsp; ${number}${prevTitle} </a>`

[NoCoverage] StringLiteral
services/course/services/live-lab.ts:79:16
         ? `<a class="btn btn-sm text-base capitalize" href="${this.url}/${encodeURI(prevChapter.shortTitle)}"> <span aria-hidden="true">&larr;</span>&nbsp; ${number}${prevTitle} </a>`
         : "";
 
-      number = "";
+      number = "Stryker was here!";
       const nextChapter = this.lab.los[currentChapterIndex + 1];
       if (nextChapter) number = this.autoNumber ? nextChapter.shortTitle + ": " : "";

[NoCoverage] ArithmeticOperator
services/course/services/live-lab.ts:80:40
         : "";
 
       number = "";
-      const nextChapter = this.lab.los[currentChapterIndex + 1];
+      const nextChapter = this.lab.los[currentChapterIndex - 1];
       if (nextChapter) number = this.autoNumber ? nextChapter.shortTitle + ": " : "";
       // eslint-disable-next-line @typescript-eslint/ban-ts-comment

[NoCoverage] ConditionalExpression
services/course/services/live-lab.ts:81:11
 
       number = "";
       const nextChapter = this.lab.los[currentChapterIndex + 1];
-      if (nextChapter) number = this.autoNumber ? nextChapter.shortTitle + ": " : "";
+      if (false) number = this.autoNumber ? nextChapter.shortTitle + ": " : "";
       // eslint-disable-next-line @typescript-eslint/ban-ts-comment
       // @ts-ignore

[NoCoverage] ConditionalExpression
services/course/services/live-lab.ts:81:11
 
       number = "";
       const nextChapter = this.lab.los[currentChapterIndex + 1];
-      if (nextChapter) number = this.autoNumber ? nextChapter.shortTitle + ": " : "";
+      if (true) number = this.autoNumber ? nextChapter.shortTitle + ": " : "";
       // eslint-disable-next-line @typescript-eslint/ban-ts-comment
       // @ts-ignore

[NoCoverage] StringLiteral
services/course/services/live-lab.ts:89:11
         ? `<a class="ml-auto btn btn-sm capitalize text-base" style="margin-left: auto" href="${this.url}/${encodeURI(
             nextChapter.shortTitle
           )}"> ${number}${nextTitle} &nbsp;<span aria-hidden="true">&rarr;</span></a>`
-        : "";
+        : "Stryker was here!";
     } else {
       this.horizontalNavbarHtml = "";

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:90:12
             nextChapter.shortTitle
           )}"> ${number}${nextTitle} &nbsp;<span aria-hidden="true">&rarr;</span></a>`
         : "";
-    } else {
-      this.horizontalNavbarHtml = "";
-    }
+    } else {}
   }
 

[NoCoverage] StringLiteral
services/course/services/live-lab.ts:91:35
           )}"> ${number}${nextTitle} &nbsp;<span aria-hidden="true">&rarr;</span></a>`
         : "";
     } else {
-      this.horizontalNavbarHtml = "";
+      this.horizontalNavbarHtml = "Stryker was here!";
     }
   }

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:95:35
     }
   }
 
-  setCurrentChapter(step: string) {
-    if (!this.steps.includes(step)) return;
-    this.currentChapterShortTitle = step;
-    this.currentChapterTitle = this.chaptersTitles.get(step)!;
-    this.content = this.chaptersHtml.get(step)!;
-    this.index = getKeyIndex(this.chaptersHtml, step);
-    this.refreshNav();
-  }
+  setCurrentChapter(step: string) {}
 
   setFirstPageActive() {

[NoCoverage] BooleanLiteral
services/course/services/live-lab.ts:96:9
   }
 
   setCurrentChapter(step: string) {
-    if (!this.steps.includes(step)) return;
+    if (this.steps.includes(step)) return;
     this.currentChapterShortTitle = step;
     this.currentChapterTitle = this.chaptersTitles.get(step)!;

[NoCoverage] ConditionalExpression
services/course/services/live-lab.ts:96:9
   }
 
   setCurrentChapter(step: string) {
-    if (!this.steps.includes(step)) return;
+    if (false) return;
     this.currentChapterShortTitle = step;
     this.currentChapterTitle = this.chaptersTitles.get(step)!;

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:104:24
     this.refreshNav();
   }
 
-  setFirstPageActive() {
-    const startStep = encodeURI(this.lab.los[0].shortTitle);
-    this.setCurrentChapter(startStep);
-  }
+  setFirstPageActive() {}
 
   setActivePage(step: string) {

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:109:31
     this.setCurrentChapter(startStep);
   }
 
-  setActivePage(step: string) {
-    this.setCurrentChapter(step);
-  }
+  setActivePage(step: string) {}
 
   nextStep(): string {

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:113:22
     this.setCurrentChapter(step);
   }
 
-  nextStep(): string {
-    const itemIndex = this.steps.indexOf(this.currentChapterShortTitle);
-    return itemIndex < this.steps.length - 1 ? this.steps[itemIndex + 1] : "";
-  }
+  nextStep(): string {}
 
   prevStep(): string {

[NoCoverage] EqualityOperator
services/course/services/live-lab.ts:115:12
 
   nextStep(): string {
     const itemIndex = this.steps.indexOf(this.currentChapterShortTitle);
-    return itemIndex < this.steps.length - 1 ? this.steps[itemIndex + 1] : "";
+    return itemIndex >= this.steps.length - 1 ? this.steps[itemIndex + 1] : "";
   }
 

[NoCoverage] ConditionalExpression
services/course/services/live-lab.ts:115:12
 
   nextStep(): string {
     const itemIndex = this.steps.indexOf(this.currentChapterShortTitle);
-    return itemIndex < this.steps.length - 1 ? this.steps[itemIndex + 1] : "";
+    return true ? this.steps[itemIndex + 1] : "";
   }
 

[NoCoverage] BlockStatement
services/course/services/live-lab.ts:118:22
     return itemIndex < this.steps.length - 1 ? this.steps[itemIndex + 1] : "";
   }
 
-  prevStep(): string {
-    const itemIndex = this.steps.indexOf(this.currentChapterShortTitle);
-    return itemIndex > 0 ? this.steps[itemIndex - 1] : "";
-  }
+  prevStep(): string {}
 }
 

[NoCoverage] ConditionalExpression
services/course/services/live-lab.ts:120:12
 
   prevStep(): string {
     const itemIndex = this.steps.indexOf(this.currentChapterShortTitle);
-    return itemIndex > 0 ? this.steps[itemIndex - 1] : "";
+    return true ? this.steps[itemIndex - 1] : "";
   }
 }

[NoCoverage] EqualityOperator
services/course/services/live-lab.ts:120:12
 
   prevStep(): string {
     const itemIndex = this.steps.indexOf(this.currentChapterShortTitle);
-    return itemIndex > 0 ? this.steps[itemIndex - 1] : "";
+    return itemIndex >= 0 ? this.steps[itemIndex - 1] : "";
   }
 }
