[Survived] ArrayDeclaration
services/markdown/services/markdown.svelte.ts:94:20
 ];
 
 /** Available syntax highlighting themes */
-const codeThemes = [ayuDark, monokai, githubDark, nightOwl, solarizedLight, githubLight, catppuccin];
+const codeThemes = [];
 
 /** Currently selected code theme */

[Survived] StringLiteral
services/markdown/services/markdown.svelte.ts:97:38
 const codeThemes = [ayuDark, monokai, githubDark, nightOwl, solarizedLight, githubLight, catppuccin];
 
 /** Currently selected code theme */
-export const currentCodeTheme = rune("ayu-dark");
+export const currentCodeTheme = rune("");
 
 /** Initialize Shiki highlighter with supported languages and themes */

[NoCoverage] BlockStatement
services/markdown/services/markdown.svelte.ts:107:40
 });
 
 // Restore user's preferred code theme
-if (browser && localStorage.codeTheme) {
-  currentCodeTheme.value = localStorage.codeTheme;
-}
+if (browser && localStorage.codeTheme) {}
 initHighlighter(shiki);
 

[Survived] LogicalOperator
services/markdown/services/markdown.svelte.ts:107:5
 });
 
 // Restore user's preferred code theme
-if (browser && localStorage.codeTheme) {
+if (browser || localStorage.codeTheme) {
   currentCodeTheme.value = localStorage.codeTheme;
 }

[NoCoverage] BlockStatement
services/markdown/services/markdown.svelte.ts:120:37
    * Sets and persists the syntax highlighting theme
    * @param theme - Theme name to set
    */
-  setCodeTheme(theme: string): void {
-    if (codeThemes.find((t) => t.name === theme)) {
-      currentCodeTheme.value = theme;
-    } else {
-      currentCodeTheme.value = "ayu-dark";
-    }
-    localStorage.codeTheme = currentCodeTheme.value;
-  },
+  setCodeTheme(theme: string): void {},
 
   /**

[NoCoverage] ArrowFunction
services/markdown/services/markdown.svelte.ts:121:25
    * @param theme - Theme name to set
    */
   setCodeTheme(theme: string): void {
-    if (codeThemes.find((t) => t.name === theme)) {
+    if (codeThemes.find(() => undefined)) {
       currentCodeTheme.value = theme;
     } else {

[NoCoverage] ConditionalExpression
services/markdown/services/markdown.svelte.ts:121:32
    * @param theme - Theme name to set
    */
   setCodeTheme(theme: string): void {
-    if (codeThemes.find((t) => t.name === theme)) {
+    if (codeThemes.find((t) => true)) {
       currentCodeTheme.value = theme;
     } else {

[NoCoverage] BlockStatement
services/markdown/services/markdown.svelte.ts:123:12
   setCodeTheme(theme: string): void {
     if (codeThemes.find((t) => t.name === theme)) {
       currentCodeTheme.value = theme;
-    } else {
-      currentCodeTheme.value = "ayu-dark";
-    }
+    } else {}
     localStorage.codeTheme = currentCodeTheme.value;
   },

[NoCoverage] StringLiteral
services/markdown/services/markdown.svelte.ts:124:32
     if (codeThemes.find((t) => t.name === theme)) {
       currentCodeTheme.value = theme;
     } else {
-      currentCodeTheme.value = "ayu-dark";
+      currentCodeTheme.value = "";
     }
     localStorage.codeTheme = currentCodeTheme.value;

[NoCoverage] BlockStatement
services/markdown/services/markdown.svelte.ts:136:76
    * @param lab - Lab to convert
    * @param refreshOnly - If true, skips URL processing
    */
-  convertLabToHtml(course: Course, lab: Lab, refreshOnly: boolean = false) {
-    lab.summary = convertMdToHtml(lab.summary, currentCodeTheme.value);
-    const url = lab.route.replace(`/lab/${course.courseId}`, course.courseUrl);
-    lab?.los?.forEach((step) => {
-      if (course.courseUrl && !refreshOnly) {
-        step.contentMd = filter(step.contentMd, url, courseProtocol.value);
-      }
-      step.contentHtml = convertMdToHtml(step.contentMd, currentCodeTheme.value);
-      step.parentLo = lab;
-      step.type = "step";
-    });
-  },
+  convertLabToHtml(course: Course, lab: Lab, refreshOnly: boolean = false) {},
 
   /**

[NoCoverage] BooleanLiteral
services/markdown/services/markdown.svelte.ts:136:69
    * @param lab - Lab to convert
    * @param refreshOnly - If true, skips URL processing
    */
-  convertLabToHtml(course: Course, lab: Lab, refreshOnly: boolean = false) {
+  convertLabToHtml(course: Course, lab: Lab, refreshOnly: boolean = true) {
     lab.summary = convertMdToHtml(lab.summary, currentCodeTheme.value);
     const url = lab.route.replace(`/lab/${course.courseId}`, course.courseUrl);

[NoCoverage] OptionalChaining
services/markdown/services/markdown.svelte.ts:139:5
   convertLabToHtml(course: Course, lab: Lab, refreshOnly: boolean = false) {
     lab.summary = convertMdToHtml(lab.summary, currentCodeTheme.value);
     const url = lab.route.replace(`/lab/${course.courseId}`, course.courseUrl);
-    lab?.los?.forEach((step) => {
+    lab.los?.forEach((step) => {
       if (course.courseUrl && !refreshOnly) {
         step.contentMd = filter(step.contentMd, url, courseProtocol.value);

[NoCoverage] BlockStatement
services/markdown/services/markdown.svelte.ts:139:33
   convertLabToHtml(course: Course, lab: Lab, refreshOnly: boolean = false) {
     lab.summary = convertMdToHtml(lab.summary, currentCodeTheme.value);
     const url = lab.route.replace(`/lab/${course.courseId}`, course.courseUrl);
-    lab?.los?.forEach((step) => {
-      if (course.courseUrl && !refreshOnly) {
-        step.contentMd = filter(step.contentMd, url, courseProtocol.value);
-      }
-      step.contentHtml = convertMdToHtml(step.contentMd, currentCodeTheme.value);
-      step.parentLo = lab;
-      step.type = "step";
-    });
+    lab?.los?.forEach((step) => {});
   },
 

[NoCoverage] BlockStatement
services/markdown/services/markdown.svelte.ts:140:45
     lab.summary = convertMdToHtml(lab.summary, currentCodeTheme.value);
     const url = lab.route.replace(`/lab/${course.courseId}`, course.courseUrl);
     lab?.los?.forEach((step) => {
-      if (course.courseUrl && !refreshOnly) {
-        step.contentMd = filter(step.contentMd, url, courseProtocol.value);
-      }
+      if (course.courseUrl && !refreshOnly) {}
       step.contentHtml = convertMdToHtml(step.contentMd, currentCodeTheme.value);
       step.parentLo = lab;

[NoCoverage] ConditionalExpression
services/markdown/services/markdown.svelte.ts:140:11
     lab.summary = convertMdToHtml(lab.summary, currentCodeTheme.value);
     const url = lab.route.replace(`/lab/${course.courseId}`, course.courseUrl);
     lab?.los?.forEach((step) => {
-      if (course.courseUrl && !refreshOnly) {
+      if (false) {
         step.contentMd = filter(step.contentMd, url, courseProtocol.value);
       }

[NoCoverage] BooleanLiteral
services/markdown/services/markdown.svelte.ts:155:72
    * @param note - Note to convert
    * @param refreshOnly - If true, skips URL processing
    */
-  convertNoteToHtml(course: Course, note: Note, refreshOnly: boolean = false) {
+  convertNoteToHtml(course: Course, note: Note, refreshOnly: boolean = true) {
     note.summary = convertMdToHtml(note.summary, currentCodeTheme.value);
     const url = note.route.replace(`/note/${course.courseId}`, course.courseUrl);

[NoCoverage] BlockStatement
services/markdown/services/markdown.svelte.ts:155:79
    * @param note - Note to convert
    * @param refreshOnly - If true, skips URL processing
    */
-  convertNoteToHtml(course: Course, note: Note, refreshOnly: boolean = false) {
-    note.summary = convertMdToHtml(note.summary, currentCodeTheme.value);
-    const url = note.route.replace(`/note/${course.courseId}`, course.courseUrl);
-    if (!refreshOnly) {
-      note.contentMd = filter(note.contentMd, url, courseProtocol.value);
-    }
-    note.contentHtml = convertMdToHtml(note.contentMd, currentCodeTheme.value);
-  }
+  convertNoteToHtml(course: Course, note: Note, refreshOnly: boolean = false) {}
 };
 

[NoCoverage] ConditionalExpression
services/markdown/services/markdown.svelte.ts:158:9
   convertNoteToHtml(course: Course, note: Note, refreshOnly: boolean = false) {
     note.summary = convertMdToHtml(note.summary, currentCodeTheme.value);
     const url = note.route.replace(`/note/${course.courseId}`, course.courseUrl);
-    if (!refreshOnly) {
+    if (true) {
       note.contentMd = filter(note.contentMd, url, courseProtocol.value);
     }

[NoCoverage] ConditionalExpression
services/markdown/services/markdown.svelte.ts:158:9
   convertNoteToHtml(course: Course, note: Note, refreshOnly: boolean = false) {
     note.summary = convertMdToHtml(note.summary, currentCodeTheme.value);
     const url = note.route.replace(`/note/${course.courseId}`, course.courseUrl);
-    if (!refreshOnly) {
+    if (false) {
       note.contentMd = filter(note.contentMd, url, courseProtocol.value);
     }
