[NoCoverage] BlockStatement
services/themes/events/festive.svelte.ts:7:49
 import { snow } from "./snow";
 
 export async function makeItSnow() {
-  if (themeService.lightMode.value === "light") {
-    snow.background.color = "#ffffff"; // White background for light mode
-    snow.particles.color.value = "#e8d1d2"; // Red snowflakes in light mode
-  } else {
+  if (themeService.lightMode.value === "light") {} else {
     snow.background.color = "#000000"; // Black background for dark mode
     snow.particles.color.value = "#ffffff"; // White snowflakes in dark mode

[NoCoverage] ConditionalExpression
services/themes/events/festive.svelte.ts:7:7
 import { snow } from "./snow";
 
 export async function makeItSnow() {
-  if (themeService.lightMode.value === "light") {
+  if (false) {
     snow.background.color = "#ffffff"; // White background for light mode
     snow.particles.color.value = "#e8d1d2"; // Red snowflakes in light mode

[NoCoverage] BlockStatement
services/themes/events/festive.svelte.ts:10:10
   if (themeService.lightMode.value === "light") {
     snow.background.color = "#ffffff"; // White background for light mode
     snow.particles.color.value = "#e8d1d2"; // Red snowflakes in light mode
-  } else {
-    snow.background.color = "#000000"; // Black background for dark mode
-    snow.particles.color.value = "#ffffff"; // White snowflakes in dark mode
-  }
+  } else {}
 
   // @ts-expect-error

[NoCoverage] StringLiteral
services/themes/events/festive.svelte.ts:11:29
     snow.background.color = "#ffffff"; // White background for light mode
     snow.particles.color.value = "#e8d1d2"; // Red snowflakes in light mode
   } else {
-    snow.background.color = "#000000"; // Black background for dark mode
+    snow.background.color = ""; // Black background for dark mode
     snow.particles.color.value = "#ffffff"; // White snowflakes in dark mode
   }

[NoCoverage] ObjectLiteral
services/themes/events/festive.svelte.ts:20:20
   await loadSnowPreset(tsParticles);
   // @ts-expect-error
   // eslint-disable-next-line no-undef
-  tsParticles.load({
-    id: "tsparticles",
-    options: {
-      //preset: "snow",
-      ...snow,
-      fullScreen: {
-        enable: true,
-        zIndex: -1 // Set z-index here
-      }
-    }
-  });
+  tsParticles.load({});
 }
 

[NoCoverage] BooleanLiteral
services/themes/events/festive.svelte.ts:26:17
       //preset: "snow",
       ...snow,
       fullScreen: {
-        enable: true,
+        enable: false,
         zIndex: -1 // Set z-index here
       }

[NoCoverage] UnaryOperator
services/themes/events/festive.svelte.ts:27:17
       ...snow,
       fullScreen: {
         enable: true,
-        zIndex: -1 // Set z-index here
+        zIndex: +1 // Set z-index here
       }
     }

[NoCoverage] BlockStatement
services/themes/events/festive.svelte.ts:33:43
   });
 }
 
-export async function makeItStopSnowing() {
-  const element = document.getElementById("tsparticles");
-  if (element) {
-    element.remove();
-  }
-}
+export async function makeItStopSnowing() {}
 

[NoCoverage] ConditionalExpression
services/themes/events/festive.svelte.ts:35:7
 
 export async function makeItStopSnowing() {
   const element = document.getElementById("tsparticles");
-  if (element) {
+  if (true) {
     element.remove();
   }

[NoCoverage] ConditionalExpression
services/themes/events/festive.svelte.ts:35:7
 
 export async function makeItStopSnowing() {
   const element = document.getElementById("tsparticles");
-  if (element) {
+  if (false) {
     element.remove();
   }
