[NoCoverage] StringLiteral
services/themes/events/festive.ts:4:9
 import type { Theme } from '@skeletonlabs/skeleton/themes';
 
 const festive = {
-  name: "festive",
+  name: "",
   properties: {
     "--type-scale-factor": "1.067",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:7:23
   name: "festive",
   properties: {
     "--type-scale-factor": "1.067",
-    "--type-scale-1": "calc(0.75rem * var(--type-scale-factor))",
+    "--type-scale-1": "",
     "--type-scale-2": "calc(0.875rem * var(--type-scale-factor))",
     "--type-scale-3": "calc(1rem * var(--type-scale-factor))",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:8:23
   properties: {
     "--type-scale-factor": "1.067",
     "--type-scale-1": "calc(0.75rem * var(--type-scale-factor))",
-    "--type-scale-2": "calc(0.875rem * var(--type-scale-factor))",
+    "--type-scale-2": "",
     "--type-scale-3": "calc(1rem * var(--type-scale-factor))",
     "--type-scale-4": "calc(1.125rem * var(--type-scale-factor))",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:10:23
     "--type-scale-1": "calc(0.75rem * var(--type-scale-factor))",
     "--type-scale-2": "calc(0.875rem * var(--type-scale-factor))",
     "--type-scale-3": "calc(1rem * var(--type-scale-factor))",
-    "--type-scale-4": "calc(1.125rem * var(--type-scale-factor))",
+    "--type-scale-4": "",
     "--type-scale-5": "calc(1.25rem * var(--type-scale-factor))",
     "--type-scale-6": "calc(1.5rem * var(--type-scale-factor))",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:11:23
     "--type-scale-2": "calc(0.875rem * var(--type-scale-factor))",
     "--type-scale-3": "calc(1rem * var(--type-scale-factor))",
     "--type-scale-4": "calc(1.125rem * var(--type-scale-factor))",
-    "--type-scale-5": "calc(1.25rem * var(--type-scale-factor))",
+    "--type-scale-5": "",
     "--type-scale-6": "calc(1.5rem * var(--type-scale-factor))",
     "--type-scale-7": "calc(1.875rem * var(--type-scale-factor))",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:13:23
     "--type-scale-4": "calc(1.125rem * var(--type-scale-factor))",
     "--type-scale-5": "calc(1.25rem * var(--type-scale-factor))",
     "--type-scale-6": "calc(1.5rem * var(--type-scale-factor))",
-    "--type-scale-7": "calc(1.875rem * var(--type-scale-factor))",
+    "--type-scale-7": "",
     "--type-scale-8": "calc(2.25rem * var(--type-scale-factor))",
     "--type-scale-9": "calc(3rem * var(--type-scale-factor))",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:14:23
     "--type-scale-5": "calc(1.25rem * var(--type-scale-factor))",
     "--type-scale-6": "calc(1.5rem * var(--type-scale-factor))",
     "--type-scale-7": "calc(1.875rem * var(--type-scale-factor))",
-    "--type-scale-8": "calc(2.25rem * var(--type-scale-factor))",
+    "--type-scale-8": "",
     "--type-scale-9": "calc(3rem * var(--type-scale-factor))",
     "--type-scale-10": "calc(3.75rem * var(--type-scale-factor))",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:15:23
     "--type-scale-6": "calc(1.5rem * var(--type-scale-factor))",
     "--type-scale-7": "calc(1.875rem * var(--type-scale-factor))",
     "--type-scale-8": "calc(2.25rem * var(--type-scale-factor))",
-    "--type-scale-9": "calc(3rem * var(--type-scale-factor))",
+    "--type-scale-9": "",
     "--type-scale-10": "calc(3.75rem * var(--type-scale-factor))",
     "--type-scale-11": "calc(4.5rem * var(--type-scale-factor))",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:16:24
     "--type-scale-7": "calc(1.875rem * var(--type-scale-factor))",
     "--type-scale-8": "calc(2.25rem * var(--type-scale-factor))",
     "--type-scale-9": "calc(3rem * var(--type-scale-factor))",
-    "--type-scale-10": "calc(3.75rem * var(--type-scale-factor))",
+    "--type-scale-10": "",
     "--type-scale-11": "calc(4.5rem * var(--type-scale-factor))",
     "--type-scale-12": "calc(6rem * var(--type-scale-factor))",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:18:24
     "--type-scale-9": "calc(3rem * var(--type-scale-factor))",
     "--type-scale-10": "calc(3.75rem * var(--type-scale-factor))",
     "--type-scale-11": "calc(4.5rem * var(--type-scale-factor))",
-    "--type-scale-12": "calc(6rem * var(--type-scale-factor))",
+    "--type-scale-12": "",
     "--type-scale-13": "calc(8rem * var(--type-scale-factor))",
     "--base-font-color": "var(--color-surface-950)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:24:27
     "--base-font-color-dark": "var(--color-surface-50)",
     "--base-font-family": "PlayfairDisplay, sans-serif",
     "--base-font-size": "inherit",
-    "--base-line-height": "inherit",
+    "--base-line-height": "",
     "--base-font-weight": "normal",
     "--base-font-style": "normal",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:26:26
     "--base-font-size": "inherit",
     "--base-line-height": "inherit",
     "--base-font-weight": "normal",
-    "--base-font-style": "normal",
+    "--base-font-style": "",
     "--base-letter-spacing": "0em",
     "--heading-font-color": "inherit",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:32:29
     "--heading-font-color-dark": "inherit",
     "--heading-font-family": "inherit",
     "--heading-font-weight": "bold",
-    "--heading-font-style": "normal",
+    "--heading-font-style": "",
     "--heading-letter-spacing": "inherit",
     "--anchor-font-color": "var(--color-primary-500)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:33:33
     "--heading-font-family": "inherit",
     "--heading-font-weight": "bold",
     "--heading-font-style": "normal",
-    "--heading-letter-spacing": "inherit",
+    "--heading-letter-spacing": "",
     "--anchor-font-color": "var(--color-primary-500)",
     "--anchor-font-color-dark": "var(--color-primary-500)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:35:33
     "--heading-font-style": "normal",
     "--heading-letter-spacing": "inherit",
     "--anchor-font-color": "var(--color-primary-500)",
-    "--anchor-font-color-dark": "var(--color-primary-500)",
+    "--anchor-font-color-dark": "",
     "--anchor-font-family": "inherit",
     "--anchor-font-size": "inherit",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:38:29
     "--anchor-font-color-dark": "var(--color-primary-500)",
     "--anchor-font-family": "inherit",
     "--anchor-font-size": "inherit",
-    "--anchor-line-height": "inherit",
+    "--anchor-line-height": "",
     "--anchor-font-weight": "inherit",
     "--anchor-font-style": "inherit",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:39:29
     "--anchor-font-family": "inherit",
     "--anchor-font-size": "inherit",
     "--anchor-line-height": "inherit",
-    "--anchor-font-weight": "inherit",
+    "--anchor-font-weight": "",
     "--anchor-font-style": "inherit",
     "--anchor-letter-spacing": "inherit",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:40:28
     "--anchor-font-size": "inherit",
     "--anchor-line-height": "inherit",
     "--anchor-font-weight": "inherit",
-    "--anchor-font-style": "inherit",
+    "--anchor-font-style": "",
     "--anchor-letter-spacing": "inherit",
     "--anchor-text-decoration": "none",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:41:32
     "--anchor-line-height": "inherit",
     "--anchor-font-weight": "inherit",
     "--anchor-font-style": "inherit",
-    "--anchor-letter-spacing": "inherit",
+    "--anchor-letter-spacing": "",
     "--anchor-text-decoration": "none",
     "--anchor-text-decoration-hover": "underline",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:42:33
     "--anchor-font-weight": "inherit",
     "--anchor-font-style": "inherit",
     "--anchor-letter-spacing": "inherit",
-    "--anchor-text-decoration": "none",
+    "--anchor-text-decoration": "",
     "--anchor-text-decoration-hover": "underline",
     "--anchor-text-decoration-active": "none",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:54:37
     "--outline-width-default": "1px",
     "--ring-width-default": "1px",
     "--body-background-color": "var(--color-surface-50)",
-    "--body-background-color-dark": "var(--color-surface-950)",
+    "--body-background-color-dark": "",
     "--color-primary-50": "238 220 221",
     "--color-primary-100": "238 220 221",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:57:28
     "--body-background-color-dark": "var(--color-surface-950)",
     "--color-primary-50": "238 220 221",
     "--color-primary-100": "238 220 221",
-    "--color-primary-200": "255 255 255",
+    "--color-primary-200": "",
     "--color-primary-300": "95 133 94",
     "--color-primary-400": "73 109 72",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:58:28
     "--color-primary-50": "238 220 221",
     "--color-primary-100": "238 220 221",
     "--color-primary-200": "255 255 255",
-    "--color-primary-300": "95 133 94",
+    "--color-primary-300": "",
     "--color-primary-400": "73 109 72",
     "--color-primary-500": "50 86 50",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:60:28
     "--color-primary-200": "255 255 255",
     "--color-primary-300": "95 133 94",
     "--color-primary-400": "73 109 72",
-    "--color-primary-500": "50 86 50",
+    "--color-primary-500": "",
     "--color-primary-600": "40 69 40",
     "--color-primary-700": "30 52 30",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:62:28
     "--color-primary-400": "73 109 72",
     "--color-primary-500": "50 86 50",
     "--color-primary-600": "40 69 40",
-    "--color-primary-700": "30 52 30",
+    "--color-primary-700": "",
     "--color-primary-800": "28 27 27",
     "--color-primary-900": "68 12 14",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:64:28
     "--color-primary-600": "40 69 40",
     "--color-primary-700": "30 52 30",
     "--color-primary-800": "28 27 27",
-    "--color-primary-900": "68 12 14",
+    "--color-primary-900": "",
     "--color-primary-950": "17 29 17",
     "--color-primary-contrast-dark": "var(--color-primary-950)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:69:37
     "--color-primary-contrast-dark": "var(--color-primary-950)",
     "--color-primary-contrast-light": "var(--color-primary-50)",
     "--color-primary-contrast-50": "var(--color-primary-contrast-dark)",
-    "--color-primary-contrast-100": "var(--color-primary-contrast-dark)",
+    "--color-primary-contrast-100": "",
     "--color-primary-contrast-200": "var(--color-primary-contrast-dark)",
     "--color-primary-contrast-300": "var(--color-primary-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:70:37
     "--color-primary-contrast-light": "var(--color-primary-50)",
     "--color-primary-contrast-50": "var(--color-primary-contrast-dark)",
     "--color-primary-contrast-100": "var(--color-primary-contrast-dark)",
-    "--color-primary-contrast-200": "var(--color-primary-contrast-dark)",
+    "--color-primary-contrast-200": "",
     "--color-primary-contrast-300": "var(--color-primary-contrast-dark)",
     "--color-primary-contrast-400": "var(--color-primary-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:71:37
     "--color-primary-contrast-50": "var(--color-primary-contrast-dark)",
     "--color-primary-contrast-100": "var(--color-primary-contrast-dark)",
     "--color-primary-contrast-200": "var(--color-primary-contrast-dark)",
-    "--color-primary-contrast-300": "var(--color-primary-contrast-dark)",
+    "--color-primary-contrast-300": "",
     "--color-primary-contrast-400": "var(--color-primary-contrast-light)",
     "--color-primary-contrast-500": "var(--color-primary-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:74:37
     "--color-primary-contrast-300": "var(--color-primary-contrast-dark)",
     "--color-primary-contrast-400": "var(--color-primary-contrast-light)",
     "--color-primary-contrast-500": "var(--color-primary-contrast-light)",
-    "--color-primary-contrast-600": "var(--color-primary-contrast-light)",
+    "--color-primary-contrast-600": "",
     "--color-primary-contrast-700": "var(--color-primary-contrast-light)",
     "--color-primary-contrast-800": "var(--color-primary-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:79:29
     "--color-primary-contrast-800": "var(--color-primary-contrast-light)",
     "--color-primary-contrast-900": "var(--color-primary-contrast-light)",
     "--color-primary-contrast-950": "var(--color-primary-contrast-light)",
-    "--color-secondary-50": "238 220 221",
+    "--color-secondary-50": "",
     "--color-secondary-100": "232 209 210",
     "--color-secondary-200": "255 255 255", 

[NoCoverage] StringLiteral
services/themes/events/festive.ts:87:30
     "--color-secondary-500": "139 24 29",
     "--color-secondary-600": "125 22 26",
     "--color-secondary-700": "104 18 22", 
-    "--color-secondary-800": "28 27 27",
+    "--color-secondary-800": "",
     "--color-secondary-900": "68 12 14", 
     "--color-secondary-950": "68 12 14", 

[NoCoverage] StringLiteral
services/themes/events/festive.ts:88:30
     "--color-secondary-600": "125 22 26",
     "--color-secondary-700": "104 18 22", 
     "--color-secondary-800": "28 27 27",
-    "--color-secondary-900": "68 12 14", 
+    "--color-secondary-900": "", 
     "--color-secondary-950": "68 12 14", 
     "--color-secondary-contrast-dark": "var(--color-secondary-950)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:89:30
     "--color-secondary-700": "104 18 22", 
     "--color-secondary-800": "28 27 27",
     "--color-secondary-900": "68 12 14", 
-    "--color-secondary-950": "68 12 14", 
+    "--color-secondary-950": "", 
     "--color-secondary-contrast-dark": "var(--color-secondary-950)",
     "--color-secondary-contrast-light": "var(--color-secondary-50)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:94:39
     "--color-secondary-contrast-light": "var(--color-secondary-50)",
     "--color-secondary-contrast-50": "var(--color-secondary-contrast-dark)",
     "--color-secondary-contrast-100": "var(--color-secondary-contrast-dark)",
-    "--color-secondary-contrast-200": "var(--color-secondary-contrast-dark)",
+    "--color-secondary-contrast-200": "",
     "--color-secondary-contrast-300": "var(--color-secondary-contrast-light)",
     "--color-secondary-contrast-400": "var(--color-secondary-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:98:39
     "--color-secondary-contrast-300": "var(--color-secondary-contrast-light)",
     "--color-secondary-contrast-400": "var(--color-secondary-contrast-light)",
     "--color-secondary-contrast-500": "var(--color-secondary-contrast-light)",
-    "--color-secondary-contrast-600": "var(--color-secondary-contrast-light)",
+    "--color-secondary-contrast-600": "",
     "--color-secondary-contrast-700": "var(--color-secondary-contrast-light)",
     "--color-secondary-contrast-800": "var(--color-secondary-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:100:39
     "--color-secondary-contrast-500": "var(--color-secondary-contrast-light)",
     "--color-secondary-contrast-600": "var(--color-secondary-contrast-light)",
     "--color-secondary-contrast-700": "var(--color-secondary-contrast-light)",
-    "--color-secondary-contrast-800": "var(--color-secondary-contrast-light)",
+    "--color-secondary-contrast-800": "",
     "--color-secondary-contrast-900": "var(--color-secondary-contrast-light)",
     "--color-secondary-contrast-950": "var(--color-secondary-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:103:28
     "--color-secondary-contrast-800": "var(--color-secondary-contrast-light)",
     "--color-secondary-contrast-900": "var(--color-secondary-contrast-light)",
     "--color-secondary-contrast-950": "var(--color-secondary-contrast-light)",
-    "--color-tertiary-50": "212 177 161",
+    "--color-tertiary-50": "",
     "--color-tertiary-100": "188 154 139",
     "--color-tertiary-200": "164 132 117",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:104:29
     "--color-secondary-contrast-900": "var(--color-secondary-contrast-light)",
     "--color-secondary-contrast-950": "var(--color-secondary-contrast-light)",
     "--color-tertiary-50": "212 177 161",
-    "--color-tertiary-100": "188 154 139",
+    "--color-tertiary-100": "",
     "--color-tertiary-200": "164 132 117",
     "--color-tertiary-300": "140 109 95",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:106:29
     "--color-tertiary-50": "212 177 161",
     "--color-tertiary-100": "188 154 139",
     "--color-tertiary-200": "164 132 117",
-    "--color-tertiary-300": "140 109 95",
+    "--color-tertiary-300": "",
     "--color-tertiary-400": "116 87 73",
     "--color-tertiary-500": "92 64 51",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:108:29
     "--color-tertiary-200": "164 132 117",
     "--color-tertiary-300": "140 109 95",
     "--color-tertiary-400": "116 87 73",
-    "--color-tertiary-500": "92 64 51",
+    "--color-tertiary-500": "",
     "--color-tertiary-600": "74 51 41",
     "--color-tertiary-700": "55 38 31",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:109:29
     "--color-tertiary-300": "140 109 95",
     "--color-tertiary-400": "116 87 73",
     "--color-tertiary-500": "92 64 51",
-    "--color-tertiary-600": "74 51 41",
+    "--color-tertiary-600": "",
     "--color-tertiary-700": "55 38 31",
     "--color-tertiary-800": "37 26 20",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:110:29
     "--color-tertiary-400": "116 87 73",
     "--color-tertiary-500": "92 64 51",
     "--color-tertiary-600": "74 51 41",
-    "--color-tertiary-700": "55 38 31",
+    "--color-tertiary-700": "",
     "--color-tertiary-800": "37 26 20",
     "--color-tertiary-900": "18 13 10",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:116:37
     "--color-tertiary-950": "0 0 0",
     "--color-tertiary-contrast-dark": "var(--color-tertiary-950)",
     "--color-tertiary-contrast-light": "var(--color-tertiary-50)",
-    "--color-tertiary-contrast-50": "var(--color-tertiary-contrast-dark)",
+    "--color-tertiary-contrast-50": "",
     "--color-tertiary-contrast-100": "var(--color-tertiary-contrast-dark)",
     "--color-tertiary-contrast-200": "var(--color-tertiary-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:120:38
     "--color-tertiary-contrast-100": "var(--color-tertiary-contrast-dark)",
     "--color-tertiary-contrast-200": "var(--color-tertiary-contrast-dark)",
     "--color-tertiary-contrast-300": "var(--color-tertiary-contrast-dark)",
-    "--color-tertiary-contrast-400": "var(--color-tertiary-contrast-light)",
+    "--color-tertiary-contrast-400": "",
     "--color-tertiary-contrast-500": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-600": "var(--color-tertiary-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:121:38
     "--color-tertiary-contrast-200": "var(--color-tertiary-contrast-dark)",
     "--color-tertiary-contrast-300": "var(--color-tertiary-contrast-dark)",
     "--color-tertiary-contrast-400": "var(--color-tertiary-contrast-light)",
-    "--color-tertiary-contrast-500": "var(--color-tertiary-contrast-light)",
+    "--color-tertiary-contrast-500": "",
     "--color-tertiary-contrast-600": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-700": "var(--color-tertiary-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:122:38
     "--color-tertiary-contrast-300": "var(--color-tertiary-contrast-dark)",
     "--color-tertiary-contrast-400": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-500": "var(--color-tertiary-contrast-light)",
-    "--color-tertiary-contrast-600": "var(--color-tertiary-contrast-light)",
+    "--color-tertiary-contrast-600": "",
     "--color-tertiary-contrast-700": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-800": "var(--color-tertiary-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:123:38
     "--color-tertiary-contrast-400": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-500": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-600": "var(--color-tertiary-contrast-light)",
-    "--color-tertiary-contrast-700": "var(--color-tertiary-contrast-light)",
+    "--color-tertiary-contrast-700": "",
     "--color-tertiary-contrast-800": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-900": "var(--color-tertiary-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:124:38
     "--color-tertiary-contrast-500": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-600": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-700": "var(--color-tertiary-contrast-light)",
-    "--color-tertiary-contrast-800": "var(--color-tertiary-contrast-light)",
+    "--color-tertiary-contrast-800": "",
     "--color-tertiary-contrast-900": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-950": "var(--color-tertiary-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:126:38
     "--color-tertiary-contrast-700": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-800": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-900": "var(--color-tertiary-contrast-light)",
-    "--color-tertiary-contrast-950": "var(--color-tertiary-contrast-light)",
+    "--color-tertiary-contrast-950": "",
     "--color-success-50": "163 203 161",
     "--color-success-100": "200 206 200",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:128:28
     "--color-tertiary-contrast-900": "var(--color-tertiary-contrast-light)",
     "--color-tertiary-contrast-950": "var(--color-tertiary-contrast-light)",
     "--color-success-50": "163 203 161",
-    "--color-success-100": "200 206 200",
+    "--color-success-100": "",
     "--color-success-200": "118 156 117",
     "--color-success-300": "95 133 94",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:137:28
     "--color-success-700": "30 52 30",
     "--color-success-800": "20 34 20",
     "--color-success-900": "25 41 25",
-    "--color-success-950": "17 29 17",
+    "--color-success-950": "",
     "--color-success-contrast-dark": "var(--color-success-950)",
     "--color-success-contrast-light": "var(--color-success-50)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:141:37
     "--color-success-contrast-dark": "var(--color-success-950)",
     "--color-success-contrast-light": "var(--color-success-50)",
     "--color-success-contrast-50": "var(--color-success-contrast-dark)",
-    "--color-success-contrast-100": "var(--color-success-contrast-dark)",
+    "--color-success-contrast-100": "",
     "--color-success-contrast-200": "var(--color-success-contrast-dark)",
     "--color-success-contrast-300": "var(--color-success-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:142:37
     "--color-success-contrast-light": "var(--color-success-50)",
     "--color-success-contrast-50": "var(--color-success-contrast-dark)",
     "--color-success-contrast-100": "var(--color-success-contrast-dark)",
-    "--color-success-contrast-200": "var(--color-success-contrast-dark)",
+    "--color-success-contrast-200": "",
     "--color-success-contrast-300": "var(--color-success-contrast-dark)",
     "--color-success-contrast-400": "var(--color-success-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:146:37
     "--color-success-contrast-300": "var(--color-success-contrast-dark)",
     "--color-success-contrast-400": "var(--color-success-contrast-light)",
     "--color-success-contrast-500": "var(--color-success-contrast-light)",
-    "--color-success-contrast-600": "var(--color-success-contrast-light)",
+    "--color-success-contrast-600": "",
     "--color-success-contrast-700": "var(--color-success-contrast-light)",
     "--color-success-contrast-800": "var(--color-success-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:147:37
     "--color-success-contrast-400": "var(--color-success-contrast-light)",
     "--color-success-contrast-500": "var(--color-success-contrast-light)",
     "--color-success-contrast-600": "var(--color-success-contrast-light)",
-    "--color-success-contrast-700": "var(--color-success-contrast-light)",
+    "--color-success-contrast-700": "",
     "--color-success-contrast-800": "var(--color-success-contrast-light)",
     "--color-success-contrast-900": "var(--color-success-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:150:37
     "--color-success-contrast-700": "var(--color-success-contrast-light)",
     "--color-success-contrast-800": "var(--color-success-contrast-light)",
     "--color-success-contrast-900": "var(--color-success-contrast-light)",
-    "--color-success-contrast-950": "var(--color-success-contrast-light)",
+    "--color-success-contrast-950": "",
     "--color-warning-50": "255 255 213",
     "--color-warning-100": "245 238 189",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:151:27
     "--color-success-contrast-800": "var(--color-success-contrast-light)",
     "--color-success-contrast-900": "var(--color-success-contrast-light)",
     "--color-success-contrast-950": "var(--color-success-contrast-light)",
-    "--color-warning-50": "255 255 213",
+    "--color-warning-50": "",
     "--color-warning-100": "245 238 189",
     "--color-warning-200": "235 222 165",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:156:28
     "--color-warning-200": "235 222 165",
     "--color-warning-300": "226 205 140",
     "--color-warning-400": "216 189 116",
-    "--color-warning-500": "206 172 92",
+    "--color-warning-500": "",
     "--color-warning-600": "181 150 74",
     "--color-warning-700": "156 128 55",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:157:28
     "--color-warning-300": "226 205 140",
     "--color-warning-400": "216 189 116",
     "--color-warning-500": "206 172 92",
-    "--color-warning-600": "181 150 74",
+    "--color-warning-600": "",
     "--color-warning-700": "156 128 55",
     "--color-warning-800": "132 105 37",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:160:28
     "--color-warning-600": "181 150 74",
     "--color-warning-700": "156 128 55",
     "--color-warning-800": "132 105 37",
-    "--color-warning-900": "107 83 18",
+    "--color-warning-900": "",
     "--color-warning-950": "82 61 0",
     "--color-warning-contrast-dark": "var(--color-warning-950)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:161:28
     "--color-warning-700": "156 128 55",
     "--color-warning-800": "132 105 37",
     "--color-warning-900": "107 83 18",
-    "--color-warning-950": "82 61 0",
+    "--color-warning-950": "",
     "--color-warning-contrast-dark": "var(--color-warning-950)",
     "--color-warning-contrast-light": "var(--color-warning-50)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:162:38
     "--color-warning-800": "132 105 37",
     "--color-warning-900": "107 83 18",
     "--color-warning-950": "82 61 0",
-    "--color-warning-contrast-dark": "var(--color-warning-950)",
+    "--color-warning-contrast-dark": "",
     "--color-warning-contrast-light": "var(--color-warning-50)",
     "--color-warning-contrast-50": "var(--color-warning-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:164:36
     "--color-warning-950": "82 61 0",
     "--color-warning-contrast-dark": "var(--color-warning-950)",
     "--color-warning-contrast-light": "var(--color-warning-50)",
-    "--color-warning-contrast-50": "var(--color-warning-contrast-dark)",
+    "--color-warning-contrast-50": "",
     "--color-warning-contrast-100": "var(--color-warning-contrast-dark)",
     "--color-warning-contrast-200": "var(--color-warning-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:165:37
     "--color-warning-contrast-dark": "var(--color-warning-950)",
     "--color-warning-contrast-light": "var(--color-warning-50)",
     "--color-warning-contrast-50": "var(--color-warning-contrast-dark)",
-    "--color-warning-contrast-100": "var(--color-warning-contrast-dark)",
+    "--color-warning-contrast-100": "",
     "--color-warning-contrast-200": "var(--color-warning-contrast-dark)",
     "--color-warning-contrast-300": "var(--color-warning-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:169:37
     "--color-warning-contrast-200": "var(--color-warning-contrast-dark)",
     "--color-warning-contrast-300": "var(--color-warning-contrast-dark)",
     "--color-warning-contrast-400": "var(--color-warning-contrast-dark)",
-    "--color-warning-contrast-500": "var(--color-warning-contrast-dark)",
+    "--color-warning-contrast-500": "",
     "--color-warning-contrast-600": "var(--color-warning-contrast-light)",
     "--color-warning-contrast-700": "var(--color-warning-contrast-light)",
