[NoCoverage] StringLiteral
services/themes/events/festive.ts:174:37
     "--color-warning-contrast-700": "var(--color-warning-contrast-light)",
     "--color-warning-contrast-800": "var(--color-warning-contrast-light)",
     "--color-warning-contrast-900": "var(--color-warning-contrast-light)",
-    "--color-warning-contrast-950": "var(--color-warning-contrast-light)",
+    "--color-warning-contrast-950": "",
     "--color-error-50": "255 150 149",
     "--color-error-100": "238 220 221",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:175:25
     "--color-warning-contrast-800": "var(--color-warning-contrast-light)",
     "--color-warning-contrast-900": "var(--color-warning-contrast-light)",
     "--color-warning-contrast-950": "var(--color-warning-contrast-light)",
-    "--color-error-50": "255 150 149",
+    "--color-error-50": "",
     "--color-error-100": "238 220 221",
     "--color-error-200": "217 96 106",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:176:26
     "--color-warning-contrast-900": "var(--color-warning-contrast-light)",
     "--color-warning-contrast-950": "var(--color-warning-contrast-light)",
     "--color-error-50": "255 150 149",
-    "--color-error-100": "238 220 221",
+    "--color-error-100": "",
     "--color-error-200": "217 96 106",
     "--color-error-300": "199 70 84",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:181:26
     "--color-error-300": "199 70 84",
     "--color-error-400": "180 43 63",
     "--color-error-500": "161 16 41",
-    "--color-error-600": "140 13 33",
+    "--color-error-600": "",
     "--color-error-700": "119 10 25",
     "--color-error-800": "99 6 16",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:183:26
     "--color-error-500": "161 16 41",
     "--color-error-600": "140 13 33",
     "--color-error-700": "119 10 25",
-    "--color-error-800": "99 6 16",
+    "--color-error-800": "",
     "--color-error-900": "78 3 8",
     "--color-error-950": "57 0 0",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:184:26
     "--color-error-600": "140 13 33",
     "--color-error-700": "119 10 25",
     "--color-error-800": "99 6 16",
-    "--color-error-900": "78 3 8",
+    "--color-error-900": "",
     "--color-error-950": "57 0 0",
     "--color-error-contrast-dark": "var(--color-error-950)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:190:35
     "--color-error-contrast-light": "var(--color-error-50)",
     "--color-error-contrast-50": "var(--color-error-contrast-dark)",
     "--color-error-contrast-100": "var(--color-error-contrast-dark)",
-    "--color-error-contrast-200": "var(--color-error-contrast-dark)",
+    "--color-error-contrast-200": "",
     "--color-error-contrast-300": "var(--color-error-contrast-dark)",
     "--color-error-contrast-400": "var(--color-error-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:191:35
     "--color-error-contrast-50": "var(--color-error-contrast-dark)",
     "--color-error-contrast-100": "var(--color-error-contrast-dark)",
     "--color-error-contrast-200": "var(--color-error-contrast-dark)",
-    "--color-error-contrast-300": "var(--color-error-contrast-dark)",
+    "--color-error-contrast-300": "",
     "--color-error-contrast-400": "var(--color-error-contrast-light)",
     "--color-error-contrast-500": "var(--color-error-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:192:35
     "--color-error-contrast-100": "var(--color-error-contrast-dark)",
     "--color-error-contrast-200": "var(--color-error-contrast-dark)",
     "--color-error-contrast-300": "var(--color-error-contrast-dark)",
-    "--color-error-contrast-400": "var(--color-error-contrast-light)",
+    "--color-error-contrast-400": "",
     "--color-error-contrast-500": "var(--color-error-contrast-light)",
     "--color-error-contrast-600": "var(--color-error-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:195:35
     "--color-error-contrast-400": "var(--color-error-contrast-light)",
     "--color-error-contrast-500": "var(--color-error-contrast-light)",
     "--color-error-contrast-600": "var(--color-error-contrast-light)",
-    "--color-error-contrast-700": "var(--color-error-contrast-light)",
+    "--color-error-contrast-700": "",
     "--color-error-contrast-800": "var(--color-error-contrast-light)",
     "--color-error-contrast-900": "var(--color-error-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:198:35
     "--color-error-contrast-700": "var(--color-error-contrast-light)",
     "--color-error-contrast-800": "var(--color-error-contrast-light)",
     "--color-error-contrast-900": "var(--color-error-contrast-light)",
-    "--color-error-contrast-950": "var(--color-error-contrast-light)",
+    "--color-error-contrast-950": "",
     "--color-surface-50": "255 255 255",
     "--color-surface-100": "224 230 224", //

[NoCoverage] StringLiteral
services/themes/events/festive.ts:200:28
     "--color-error-contrast-900": "var(--color-error-contrast-light)",
     "--color-error-contrast-950": "var(--color-error-contrast-light)",
     "--color-surface-50": "255 255 255",
-    "--color-surface-100": "224 230 224", //
+    "--color-surface-100": "", //
     "--color-surface-200": "232 209 210", //
     "--color-surface-300": "162 169 184",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:202:28
     "--color-surface-50": "255 255 255",
     "--color-surface-100": "224 230 224", //
     "--color-surface-200": "232 209 210", //
-    "--color-surface-300": "162 169 184",
+    "--color-surface-300": "",
     "--color-surface-400": "77 84 101",
     "--color-surface-500": "42 46 55",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:206:28
     "--color-surface-400": "77 84 101",
     "--color-surface-500": "42 46 55",
     "--color-surface-600": "104 18 22", //
-    "--color-surface-700": "28 27 27",
+    "--color-surface-700": "",
     "--color-surface-800": "25 42 25", //
     "--color-surface-900": "28 27 27", //  

[NoCoverage] StringLiteral
services/themes/events/festive.ts:212:36
     "--color-surface-950": "25 42 25",
     "--color-surface-contrast-dark": "var(--color-surface-950)",
     "--color-surface-contrast-light": "var(--color-surface-50)",
-    "--color-surface-contrast-50": "var(--color-surface-contrast-dark)",
+    "--color-surface-contrast-50": "",
     "--color-surface-contrast-100": "var(--color-surface-contrast-dark)",
     "--color-surface-contrast-200": "var(--color-surface-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:215:37
     "--color-surface-contrast-50": "var(--color-surface-contrast-dark)",
     "--color-surface-contrast-100": "var(--color-surface-contrast-dark)",
     "--color-surface-contrast-200": "var(--color-surface-contrast-dark)",
-    "--color-surface-contrast-300": "var(--color-surface-contrast-dark)",
+    "--color-surface-contrast-300": "",
     "--color-surface-contrast-400": "var(--color-surface-contrast-light)",
     "--color-surface-contrast-500": "var(--color-surface-contrast-light)",

[NoCoverage] StringLiteral
services/themes/events/festive.ts:220:37
     "--color-surface-contrast-500": "var(--color-surface-contrast-light)",
     "--color-surface-contrast-600": "var(--color-surface-contrast-light)",
     "--color-surface-contrast-700": "var(--color-surface-contrast-light)",
-    "--color-surface-contrast-800": "var(--color-surface-contrast-light)",
+    "--color-surface-contrast-800": "",
     "--color-surface-contrast-900": "var(--color-surface-contrast-light)",
     "--color-surface-contrast-950": "var(--color-surface-contrast-light)"

[NoCoverage] StringLiteral
services/themes/events/festive.ts:222:37
     "--color-surface-contrast-700": "var(--color-surface-contrast-light)",
     "--color-surface-contrast-800": "var(--color-surface-contrast-light)",
     "--color-surface-contrast-900": "var(--color-surface-contrast-light)",
-    "--color-surface-contrast-950": "var(--color-surface-contrast-light)"
+    "--color-surface-contrast-950": ""
   },
   metadata: {

[NoCoverage] StringLiteral
services/themes/events/festive.ts:225:14
     "--color-surface-contrast-950": "var(--color-surface-contrast-light)"
   },
   metadata: {
-    version: "3.0.0"
+    version: ""
   }
 } satisfies Theme;
