[NoCoverage] ObjectLiteral
services/themes/events/snow.ts:9:12
   // The particles options
   particles: {
     // The color of the particles/snowflakes
-    color: {
-      value: "#ffffff"
-    },
+    color: {},
     move: {

[NoCoverage] StringLiteral
services/themes/events/snow.ts:10:14
   particles: {
     // The color of the particles/snowflakes
     color: {
-      value: "#ffffff"
+      value: ""
     },

[NoCoverage] ObjectLiteral
services/themes/events/snow.ts:13:11
       value: "#ffffff"
     },
-    move: {
-      direction: "bottom",
-      enable: true,
-      outModes: "out",
-      speed: 2
-    },
+    move: {},
     number: {

[NoCoverage] BooleanLiteral
services/themes/events/snow.ts:15:15
     move: {
       direction: "bottom",
-      enable: true,
+      enable: false,
       outModes: "out",
       speed: 2

[NoCoverage] StringLiteral
services/themes/events/snow.ts:16:17
     move: {
       direction: "bottom",
       enable: true,
-      outModes: "out",
+      outModes: "",
       speed: 2
     },

[NoCoverage] BooleanLiteral
services/themes/events/snow.ts:22:17
     number: {
       density: {
-        enable: true,
+        enable: false,
         area: 800
       },

[NoCoverage] ObjectLiteral
services/themes/events/snow.ts:36:11
       type: "circle"
     },
     // The size of the particles/snowflakes
-    size: {
-      value: 10
-    },
+    size: {},
     // A nice wobble movement
     wobble: {

[NoCoverage] BooleanLiteral
services/themes/events/snow.ts:41:15
     },
     // A nice wobble movement
     wobble: {
-      enable: true,
+      enable: false,
       distance: 10,
       speed: 10
