[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:5:24
 
 export const EasterIcons: IconLib = {
   // Home Icon
-  programHome: { type: "bxs:home-circle", color: "success" },
+  programHome: { type: "", color: "success" },
 
   // companion Icons

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:5:50
 
 export const EasterIcons: IconLib = {
   // Home Icon
-  programHome: { type: "bxs:home-circle", color: "success" },
+  programHome: { type: "bxs:home-circle", color: "" },
 
   // companion Icons

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:8:10
   programHome: { type: "bxs:home-circle", color: "success" },
 
   // companion Icons
-  slack: { type: "logos:slack-icon", color: "error" },
+  slack: {},
   moodle: { type: "academicons:moodle", color: "warning" },
   youtube: { type: "fa:youtube", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:8:45
   programHome: { type: "bxs:home-circle", color: "success" },
 
   // companion Icons
-  slack: { type: "logos:slack-icon", color: "error" },
+  slack: { type: "logos:slack-icon", color: "" },
   moodle: { type: "academicons:moodle", color: "warning" },
   youtube: { type: "fa:youtube", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:11:18
   slack: { type: "logos:slack-icon", color: "error" },
   moodle: { type: "academicons:moodle", color: "warning" },
   youtube: { type: "fa:youtube", color: "error" },
-  video: { type: "fluent:video-clip-24-filled", color: "error" },
+  video: { type: "", color: "error" },
   zoom: { type: "fluent:video-24-filled", color: "primary" },
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:17:18
 
   // LoTypes icons
   course: { type: "mdi:easter", color: "primary" },
-  topic: { type: "mdi:egg-easter", color: "secondary" },
+  topic: { type: "", color: "secondary" },
   unit: { type: "mdi:rabbit-variant", color: "tertiary" },
   side: { type: "mdi:rabbit", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:17:43
 
   // LoTypes icons
   course: { type: "mdi:easter", color: "primary" },
-  topic: { type: "mdi:egg-easter", color: "secondary" },
+  topic: { type: "mdi:egg-easter", color: "" },
   unit: { type: "mdi:rabbit-variant", color: "tertiary" },
   side: { type: "mdi:rabbit", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:18:17
   // LoTypes icons
   course: { type: "mdi:easter", color: "primary" },
   topic: { type: "mdi:egg-easter", color: "secondary" },
-  unit: { type: "mdi:rabbit-variant", color: "tertiary" },
+  unit: { type: "", color: "tertiary" },
   side: { type: "mdi:rabbit", color: "success" },
   talk: { type: "fluent:presenter-24-filled", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:19:9
   course: { type: "mdi:easter", color: "primary" },
   topic: { type: "mdi:egg-easter", color: "secondary" },
   unit: { type: "mdi:rabbit-variant", color: "tertiary" },
-  side: { type: "mdi:rabbit", color: "success" },
+  side: {},
   talk: { type: "fluent:presenter-24-filled", color: "warning" },
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:21:63
   unit: { type: "mdi:rabbit-variant", color: "tertiary" },
   side: { type: "mdi:rabbit", color: "success" },
   talk: { type: "fluent:presenter-24-filled", color: "warning" },
-  reference: { type: "fluent:document-copy-24-filled", color: "surface" },
+  reference: { type: "fluent:document-copy-24-filled", color: "" },
   lab: { type: "fluent:beaker-24-filled", color: "error" },
   note: { type: "fluent:notepad-16-regular", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:21:14
   unit: { type: "mdi:rabbit-variant", color: "tertiary" },
   side: { type: "mdi:rabbit", color: "success" },
   talk: { type: "fluent:presenter-24-filled", color: "warning" },
-  reference: { type: "fluent:document-copy-24-filled", color: "surface" },
+  reference: {},
   lab: { type: "fluent:beaker-24-filled", color: "error" },
   note: { type: "fluent:notepad-16-regular", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:22:8
   side: { type: "mdi:rabbit", color: "success" },
   talk: { type: "fluent:presenter-24-filled", color: "warning" },
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },
-  lab: { type: "fluent:beaker-24-filled", color: "error" },
+  lab: {},
   note: { type: "fluent:notepad-16-regular", color: "success" },
   archive: { type: "mdi:basket-outline", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:22:16
   side: { type: "mdi:rabbit", color: "success" },
   talk: { type: "fluent:presenter-24-filled", color: "warning" },
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },
-  lab: { type: "fluent:beaker-24-filled", color: "error" },
+  lab: { type: "", color: "error" },
   note: { type: "fluent:notepad-16-regular", color: "success" },
   archive: { type: "mdi:basket-outline", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:23:53
   talk: { type: "fluent:presenter-24-filled", color: "warning" },
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },
   lab: { type: "fluent:beaker-24-filled", color: "error" },
-  note: { type: "fluent:notepad-16-regular", color: "success" },
+  note: { type: "fluent:notepad-16-regular", color: "" },
   archive: { type: "mdi:basket-outline", color: "error" },
   web: { type: "fluent:bookmark-24-regular", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:24:49
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },
   lab: { type: "fluent:beaker-24-filled", color: "error" },
   note: { type: "fluent:notepad-16-regular", color: "success" },
-  archive: { type: "mdi:basket-outline", color: "error" },
+  archive: { type: "mdi:basket-outline", color: "" },
   web: { type: "fluent:bookmark-24-regular", color: "primary" },
   github: { type: "mdi:github", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:25:53
   lab: { type: "fluent:beaker-24-filled", color: "error" },
   note: { type: "fluent:notepad-16-regular", color: "success" },
   archive: { type: "mdi:basket-outline", color: "error" },
-  web: { type: "fluent:bookmark-24-regular", color: "primary" },
+  web: { type: "fluent:bookmark-24-regular", color: "" },
   github: { type: "mdi:github", color: "warning" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:26:40
   note: { type: "fluent:notepad-16-regular", color: "success" },
   archive: { type: "mdi:basket-outline", color: "error" },
   web: { type: "fluent:bookmark-24-regular", color: "primary" },
-  github: { type: "mdi:github", color: "warning" },
+  github: { type: "mdi:github", color: "" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
   paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:27:62
   archive: { type: "mdi:basket-outline", color: "error" },
   web: { type: "fluent:bookmark-24-regular", color: "primary" },
   github: { type: "mdi:github", color: "warning" },
-  panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
+  panelvideo: { type: "fluent:video-clip-24-regular", color: "" },
   paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },
   panelnote: { type: "mdi:flower-tulip-outline", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:28:14
   web: { type: "fluent:bookmark-24-regular", color: "primary" },
   github: { type: "mdi:github", color: "warning" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
-  paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },
+  paneltalk: {},
   panelnote: { type: "mdi:flower-tulip-outline", color: "warning" },
 

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:28:59
   web: { type: "fluent:bookmark-24-regular", color: "primary" },
   github: { type: "mdi:github", color: "warning" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
-  paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },
+  paneltalk: { type: "fluent:presenter-24-filled", color: "" },
   panelnote: { type: "mdi:flower-tulip-outline", color: "warning" },
 

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:29:22
   github: { type: "mdi:github", color: "warning" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
   paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },
-  panelnote: { type: "mdi:flower-tulip-outline", color: "warning" },
+  panelnote: { type: "", color: "warning" },
 
   // pdf reader icons

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:33:10
 
   // pdf reader icons
   left: { type: "fluent:ios-arrow-left-24-filled", color: "success" },
-  right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
+  right: {},
   print: { type: "fluent:print-24-filled", color: "success" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:34:10
   // pdf reader icons
   left: { type: "fluent:ios-arrow-left-24-filled", color: "success" },
   right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
-  print: { type: "fluent:print-24-filled", color: "success" },
+  print: {},
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },
   download: { type: "fluent:arrow-download-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:34:51
   // pdf reader icons
   left: { type: "fluent:ios-arrow-left-24-filled", color: "success" },
   right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
-  print: { type: "fluent:print-24-filled", color: "success" },
+  print: { type: "fluent:print-24-filled", color: "" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },
   download: { type: "fluent:arrow-download-24-filled", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:36:13
   right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
   print: { type: "fluent:print-24-filled", color: "success" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },
-  download: { type: "fluent:arrow-download-24-filled", color: "success" },
+  download: {},
   fullScreen: { type: "fluent:arrow-expand-24-filled", color: "success" },
 

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:42:62
   // tutors time icons
   online: { type: "fluent:presence-available-24-filled", color: "success" },
   offline: { type: "fluent:presence-available-24-regular", color: "error" },
-  tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "primary" },
+  tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "" },
   timeExport: { type: "fluent:save-arrow-right-24-filled", color: "success" },
   live: { type: "fluent:people-community-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:43:67
   online: { type: "fluent:presence-available-24-filled", color: "success" },
   offline: { type: "fluent:presence-available-24-regular", color: "error" },
   tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "primary" },
-  timeExport: { type: "fluent:save-arrow-right-24-filled", color: "success" },
+  timeExport: { type: "fluent:save-arrow-right-24-filled", color: "" },
   live: { type: "fluent:people-community-24-filled", color: "success" },
 

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:47:53
   live: { type: "fluent:people-community-24-filled", color: "success" },
 
   // app icons
-  search: { type: "fluent:search-24-filled", color: "primary" },
+  search: { type: "fluent:search-24-filled", color: "" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
   logout: { type: "fluent:sign-out-24-filled", color: "error" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:48:11
 
   // app icons
   search: { type: "fluent:search-24-filled", color: "primary" },
-  tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
+  tutors: {},
   logout: { type: "fluent:sign-out-24-filled", color: "error" },
   lightMode: { type: "fxemoji:hatchingchick", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:49:11
   // app icons
   search: { type: "fluent:search-24-filled", color: "primary" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
-  logout: { type: "fluent:sign-out-24-filled", color: "error" },
+  logout: {},
   lightMode: { type: "fxemoji:hatchingchick", color: "warning" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:49:55
   // app icons
   search: { type: "fluent:search-24-filled", color: "primary" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
-  logout: { type: "fluent:sign-out-24-filled", color: "error" },
+  logout: { type: "fluent:sign-out-24-filled", color: "" },
   lightMode: { type: "fxemoji:hatchingchick", color: "warning" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:53:16
   lightMode: { type: "fxemoji:hatchingchick", color: "warning" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
-  toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },
+  toc: { type: "", color: "bg-base-content" },
   compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
   expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:53:61
   lightMode: { type: "fxemoji:hatchingchick", color: "warning" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
-  toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },
+  toc: { type: "fluent:line-horizontal-3-20-filled", color: "" },
   compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
   expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:54:22
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },
-  compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
+  compacted: { type: "", color: "success" },
   expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:56:13
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },
   compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
   expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },
-  portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
+  portrait: {},
   circular: { type: "mdi:easter-egg-outline", color: "warning" },
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:57:13
   compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
   expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
-  circular: { type: "mdi:easter-egg-outline", color: "warning" },
+  circular: {},
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
 

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:58:78
   expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
   circular: { type: "mdi:easter-egg-outline", color: "warning" },
-  landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
+  landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "" },
 
   courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:60:56
   circular: { type: "mdi:easter-egg-outline", color: "warning" },
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
 
-  courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },
+  courseinfo: { type: "fluent:info-28-regular", color: "" },
   llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
   calendar: { type: "mdi:calendar-outline", color: "bg-base-content" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:61:8
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
 
   courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },
-  llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
+  llm: {},
   calendar: { type: "mdi:calendar-outline", color: "bg-base-content" },
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:61:16
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
 
   courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },
-  llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
+  llm: { type: "", color: "bg-base-content" },
   calendar: { type: "mdi:calendar-outline", color: "bg-base-content" },
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:63:60
   courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },
   llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
   calendar: { type: "mdi:calendar-outline", color: "bg-base-content" },
-  appSettings: { type: "fluent:settings-24-filled", color: "primary" },
+  appSettings: { type: "fluent:settings-24-filled", color: "" },
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
   edit: { type: "typcn:edit", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:65:38
   calendar: { type: "mdi:calendar-outline", color: "bg-base-content" },
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
-  edit: { type: "typcn:edit", color: "primary" },
+  edit: { type: "typcn:edit", color: "" },
   info: { type: "fluent:info-28-regular", color: "primary" },
   close: { type: "carbon:close-outline", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:66:9
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
   edit: { type: "typcn:edit", color: "primary" },
-  info: { type: "fluent:info-28-regular", color: "primary" },
+  info: {},
   close: { type: "carbon:close-outline", color: "primary" },
   theme: { type: "mdi:palette-swatch", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:68:47
   edit: { type: "typcn:edit", color: "primary" },
   info: { type: "fluent:info-28-regular", color: "primary" },
   close: { type: "carbon:close-outline", color: "primary" },
-  theme: { type: "mdi:palette-swatch", color: "success" },
+  theme: { type: "mdi:palette-swatch", color: "" },
   codeTheme: { type: "mdi:brush-outline", color: "primary" },
 

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:68:10
   edit: { type: "typcn:edit", color: "primary" },
   info: { type: "fluent:info-28-regular", color: "primary" },
   close: { type: "carbon:close-outline", color: "primary" },
-  theme: { type: "mdi:palette-swatch", color: "success" },
+  theme: {},
   codeTheme: { type: "mdi:brush-outline", color: "primary" },
 

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:73:17
 
   // sentiment — same twemoji set as fluent theme
   neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
-  fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
+  fine: { type: "", color: "bg-base-content" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
   confident: { type: "twemoji:flexed-biceps", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:74:68
   // sentiment — same twemoji set as fluent theme
   neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
-  delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
+  delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "" },
   confident: { type: "twemoji:flexed-biceps", color: "primary" },
   overwhelmed: { type: "twemoji:exploding-head", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:74:22
   // sentiment — same twemoji set as fluent theme
   neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
-  delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
+  delighted: { type: "", color: "success" },
   confident: { type: "twemoji:flexed-biceps", color: "primary" },
   overwhelmed: { type: "twemoji:exploding-head", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:75:54
   neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
-  confident: { type: "twemoji:flexed-biceps", color: "primary" },
+  confident: { type: "twemoji:flexed-biceps", color: "" },
   overwhelmed: { type: "twemoji:exploding-head", color: "warning" },
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:75:22
   neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
-  confident: { type: "twemoji:flexed-biceps", color: "primary" },
+  confident: { type: "", color: "primary" },
   overwhelmed: { type: "twemoji:exploding-head", color: "warning" },
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:76:24
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
   confident: { type: "twemoji:flexed-biceps", color: "primary" },
-  overwhelmed: { type: "twemoji:exploding-head", color: "warning" },
+  overwhelmed: { type: "", color: "warning" },
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
   drained: { type: "twemoji:melting-face", color: "error" },

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:76:16
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
   confident: { type: "twemoji:flexed-biceps", color: "primary" },
-  overwhelmed: { type: "twemoji:exploding-head", color: "warning" },
+  overwhelmed: {},
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
   drained: { type: "twemoji:melting-face", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/easter-icons.ts:77:21
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
   confident: { type: "twemoji:flexed-biceps", color: "primary" },
   overwhelmed: { type: "twemoji:exploding-head", color: "warning" },
-  confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
+  confused: { type: "", color: "secondary" },
   drained: { type: "twemoji:melting-face", color: "error" },
 

[NoCoverage] ObjectLiteral
services/themes/icons/easter-icons.ts:78:12
   confident: { type: "twemoji:flexed-biceps", color: "primary" },
   overwhelmed: { type: "twemoji:exploding-head", color: "warning" },
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
-  drained: { type: "twemoji:melting-face", color: "error" },
+  drained: {},
 
   default: { type: "fluent:re-order-dots-vertical-24-filled", color: "error" }
