[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:11:56
   slack: { type: "logos:slack-icon", color: "error" },
   moodle: { type: "academicons:moodle", color: "warning" },
   youtube: { type: "fa:youtube", color: "error" },
-  video: { type: "fluent:video-clip-24-filled", color: "error" },
+  video: { type: "fluent:video-clip-24-filled", color: "" },
   zoom: { type: "fluent:video-24-filled", color: "primary" },
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:12:17
   moodle: { type: "academicons:moodle", color: "warning" },
   youtube: { type: "fa:youtube", color: "error" },
   video: { type: "fluent:video-clip-24-filled", color: "error" },
-  zoom: { type: "fluent:video-24-filled", color: "primary" },
+  zoom: { type: "", color: "primary" },
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
 

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:13:50
   youtube: { type: "fa:youtube", color: "error" },
   video: { type: "fluent:video-clip-24-filled", color: "error" },
   zoom: { type: "fluent:video-24-filled", color: "primary" },
-  teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
+  teams: { type: "logos:microsoft-teams", color: "" },
 
   // LoTypes icons

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:13:10
   youtube: { type: "fa:youtube", color: "error" },
   video: { type: "fluent:video-clip-24-filled", color: "error" },
   zoom: { type: "fluent:video-24-filled", color: "primary" },
-  teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
+  teams: {},
 
   // LoTypes icons

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:17:10
 
   // LoTypes icons
   course: { type: "fxemoji:present", color: "primary" },
-  topic: { type: "twemoji:christmas-tree", color: "secondary" },
+  topic: {},
   unit: { type: "fxemoji:fatherchristmas", color: "tertiary" },
   side: { type: "fxemoji:fatherchristmas", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:19:17
   course: { type: "fxemoji:present", color: "primary" },
   topic: { type: "twemoji:christmas-tree", color: "secondary" },
   unit: { type: "fxemoji:fatherchristmas", color: "tertiary" },
-  side: { type: "fxemoji:fatherchristmas", color: "success" },
+  side: { type: "", color: "success" },
   talk: { type: "fluent:presenter-24-filled", color: "warning" },
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:23:9
   talk: { type: "fluent:presenter-24-filled", color: "warning" },
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },
   lab: { type: "fluent:beaker-24-filled", color: "error" },
-  note: { type: "fluent:notepad-16-regular", color: "success" },
+  note: {},
   archive: { type: "fluent:archive-24-filled", color: "error" },
   web: { type: "noto:star", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:24:55
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },
   lab: { type: "fluent:beaker-24-filled", color: "error" },
   note: { type: "fluent:notepad-16-regular", color: "success" },
-  archive: { type: "fluent:archive-24-filled", color: "error" },
+  archive: { type: "fluent:archive-24-filled", color: "" },
   web: { type: "noto:star", color: "primary" },
   github: { type: "mdi:github", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:24:12
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },
   lab: { type: "fluent:beaker-24-filled", color: "error" },
   note: { type: "fluent:notepad-16-regular", color: "success" },
-  archive: { type: "fluent:archive-24-filled", color: "error" },
+  archive: {},
   web: { type: "noto:star", color: "primary" },
   github: { type: "mdi:github", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:26:40
   note: { type: "fluent:notepad-16-regular", color: "success" },
   archive: { type: "fluent:archive-24-filled", color: "error" },
   web: { type: "noto:star", color: "primary" },
-  github: { type: "mdi:github", color: "warning" },
+  github: { type: "mdi:github", color: "" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
   paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:26:19
   note: { type: "fluent:notepad-16-regular", color: "success" },
   archive: { type: "fluent:archive-24-filled", color: "error" },
   web: { type: "noto:star", color: "primary" },
-  github: { type: "mdi:github", color: "warning" },
+  github: { type: "", color: "warning" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
   paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:33:18
 
   // pdf reader icons
   left: { type: "fluent:ios-arrow-left-24-filled", color: "success" },
-  right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
+  right: { type: "", color: "success" },
   print: { type: "fluent:print-24-filled", color: "success" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:35:69
   left: { type: "fluent:ios-arrow-left-24-filled", color: "success" },
   right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
   print: { type: "fluent:print-24-filled", color: "success" },
-  rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },
+  rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "" },
   download: { type: "fluent:arrow-download-24-filled", color: "success" },
   fullScreen: { type: "fluent:arrow-expand-24-filled", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:35:11
   left: { type: "fluent:ios-arrow-left-24-filled", color: "success" },
   right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
   print: { type: "fluent:print-24-filled", color: "success" },
-  rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },
+  rotate: {},
   download: { type: "fluent:arrow-download-24-filled", color: "success" },
   fullScreen: { type: "fluent:arrow-expand-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:37:63
   print: { type: "fluent:print-24-filled", color: "success" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },
   download: { type: "fluent:arrow-download-24-filled", color: "success" },
-  fullScreen: { type: "fluent:arrow-expand-24-filled", color: "success" },
+  fullScreen: { type: "fluent:arrow-expand-24-filled", color: "" },
 
   // tutors time icons

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:40:11
   fullScreen: { type: "fluent:arrow-expand-24-filled", color: "success" },
 
   // tutors time icons
-  online: { type: "fluent:presence-available-24-filled", color: "success" },
+  online: {},
   offline: { type: "fluent:presence-available-24-regular", color: "error" },
   tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:41:20
 
   // tutors time icons
   online: { type: "fluent:presence-available-24-filled", color: "success" },
-  offline: { type: "fluent:presence-available-24-regular", color: "error" },
+  offline: { type: "", color: "error" },
   tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "primary" },
   timeExport: { type: "fluent:save-arrow-right-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:42:23
   // tutors time icons
   online: { type: "fluent:presence-available-24-filled", color: "success" },
   offline: { type: "fluent:presence-available-24-regular", color: "error" },
-  tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "primary" },
+  tutorsTime: { type: "", color: "primary" },
   timeExport: { type: "fluent:save-arrow-right-24-filled", color: "success" },
   live: { type: "fluent:people-community-24-filled", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:43:15
   online: { type: "fluent:presence-available-24-filled", color: "success" },
   offline: { type: "fluent:presence-available-24-regular", color: "error" },
   tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "primary" },
-  timeExport: { type: "fluent:save-arrow-right-24-filled", color: "success" },
+  timeExport: {},
   live: { type: "fluent:people-community-24-filled", color: "success" },
 

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:44:61
   offline: { type: "fluent:presence-available-24-regular", color: "error" },
   tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "primary" },
   timeExport: { type: "fluent:save-arrow-right-24-filled", color: "success" },
-  live: { type: "fluent:people-community-24-filled", color: "success" },
+  live: { type: "fluent:people-community-24-filled", color: "" },
 
   // app icons

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:48:19
 
   // app icons
   search: { type: "fluent:search-24-filled", color: "primary" },
-  tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
+  tutors: { type: "", color: "bg-base-content" },
   logout: { type: "fluent:sign-out-24-filled", color: "error" },
   lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:50:14
   search: { type: "fluent:search-24-filled", color: "primary" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
   logout: { type: "fluent:sign-out-24-filled", color: "error" },
-  lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
+  lightMode: {},
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:50:22
   search: { type: "fluent:search-24-filled", color: "primary" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
   logout: { type: "fluent:sign-out-24-filled", color: "error" },
-  lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
+  lightMode: { type: "", color: "warning" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:51:10
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
   logout: { type: "fluent:sign-out-24-filled", color: "error" },
   lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
-  light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
+  light: {},
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:51:59
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
   logout: { type: "fluent:sign-out-24-filled", color: "error" },
   lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
-  light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
+  light: { type: "fluent:weather-sunny-32-filled", color: "" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:52:9
   logout: { type: "fluent:sign-out-24-filled", color: "error" },
   lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
-  dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
+  dark: {},
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },
   compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:54:72
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },
-  compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
+  compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "" },
   expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:55:13
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },
   compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
-  expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },
+  expanded: {},
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:55:73
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },
   compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
-  expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },
+  expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:60:23
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
 
-  courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },
+  courseinfo: { type: "", color: "bg-base-content" },
   llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
   calendar: { type: "fluent:calendar-ltr-12-regular", color: "bg-base-content" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:61:53
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
 
   courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },
-  llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
+  llm: { type: "hugeicons:ai-innovation-01", color: "" },
   calendar: { type: "fluent:calendar-ltr-12-regular", color: "bg-base-content" },
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:63:16
   courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },
   llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
   calendar: { type: "fluent:calendar-ltr-12-regular", color: "bg-base-content" },
-  appSettings: { type: "fluent:settings-24-filled", color: "primary" },
+  appSettings: {},
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
   edit: { type: "typcn:edit", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:64:15
   llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
   calendar: { type: "fluent:calendar-ltr-12-regular", color: "bg-base-content" },
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },
-  listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
+  listOnline: {},
   edit: { type: "typcn:edit", color: "primary" },
   info: { type: "fluent:info-28-regular", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:66:17
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
   edit: { type: "typcn:edit", color: "primary" },
-  info: { type: "fluent:info-28-regular", color: "primary" },
+  info: { type: "", color: "primary" },
   close: { type: "fluent:add-square-32-regular", color: "primary" },
   theme: { type: "fluent:color-fill-24-regular", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:67:57
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
   edit: { type: "typcn:edit", color: "primary" },
   info: { type: "fluent:info-28-regular", color: "primary" },
-  close: { type: "fluent:add-square-32-regular", color: "primary" },
+  close: { type: "fluent:add-square-32-regular", color: "" },
   theme: { type: "fluent:color-fill-24-regular", color: "success" },
   codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:68:10
   edit: { type: "typcn:edit", color: "primary" },
   info: { type: "fluent:info-28-regular", color: "primary" },
   close: { type: "fluent:add-square-32-regular", color: "primary" },
-  theme: { type: "fluent:color-fill-24-regular", color: "success" },
+  theme: {},
   codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },
 

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:74:14
   // sentiment — same twemoji set as fluent theme
   neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
-  delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
+  delighted: {},
   confident: { type: "twemoji:flexed-biceps", color: "primary" },
   overwhelmed: { type: "twemoji:exploding-head", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:78:51
   confident: { type: "twemoji:flexed-biceps", color: "primary" },
   overwhelmed: { type: "twemoji:exploding-head", color: "warning" },
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
-  drained: { type: "twemoji:melting-face", color: "error" },
+  drained: { type: "twemoji:melting-face", color: "" },
 
   default: { type: "fluent:re-order-dots-vertical-24-filled", color: "error" }

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:78:20
   confident: { type: "twemoji:flexed-biceps", color: "primary" },
   overwhelmed: { type: "twemoji:exploding-head", color: "warning" },
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
-  drained: { type: "twemoji:melting-face", color: "error" },
+  drained: { type: "", color: "error" },
 
   default: { type: "fluent:re-order-dots-vertical-24-filled", color: "error" }

[NoCoverage] ObjectLiteral
services/themes/icons/festive-icons.ts:80:12
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
   drained: { type: "twemoji:melting-face", color: "error" },
 
-  default: { type: "fluent:re-order-dots-vertical-24-filled", color: "error" }
+  default: {}
 };
 

[NoCoverage] StringLiteral
services/themes/icons/festive-icons.ts:80:20
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
   drained: { type: "twemoji:melting-face", color: "error" },
 
-  default: { type: "fluent:re-order-dots-vertical-24-filled", color: "error" }
+  default: { type: "", color: "error" }
 };
 
