[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:9:19
 
   // companion Icons
   slack: { type: "logos:slack-icon", color: "error" },
-  moodle: { type: "academicons:moodle", color: "warning" },
+  moodle: { type: "", color: "warning" },
   youtube: { type: "fa:youtube", color: "error" },
   video: { type: "fluent:video-clip-24-filled", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:10:41
   // companion Icons
   slack: { type: "logos:slack-icon", color: "error" },
   moodle: { type: "academicons:moodle", color: "warning" },
-  youtube: { type: "fa:youtube", color: "error" },
+  youtube: { type: "fa:youtube", color: "" },
   video: { type: "fluent:video-clip-24-filled", color: "error" },
   zoom: { type: "fluent:video-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:10:20
   // companion Icons
   slack: { type: "logos:slack-icon", color: "error" },
   moodle: { type: "academicons:moodle", color: "warning" },
-  youtube: { type: "fa:youtube", color: "error" },
+  youtube: { type: "", color: "error" },
   video: { type: "fluent:video-clip-24-filled", color: "error" },
   zoom: { type: "fluent:video-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:12:50
   moodle: { type: "academicons:moodle", color: "warning" },
   youtube: { type: "fa:youtube", color: "error" },
   video: { type: "fluent:video-clip-24-filled", color: "error" },
-  zoom: { type: "fluent:video-24-filled", color: "primary" },
+  zoom: { type: "fluent:video-24-filled", color: "" },
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
 

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:16:19
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
 
   // LoTypes icons
-  course: { type: "fluent:notebook-24-filled", color: "primary" },
+  course: { type: "", color: "primary" },
   topic: { type: "fluent:bookmark-24-filled", color: "secondary" },
   unit: { type: "fluent:dual-screen-group-24-filled", color: "tertiary" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:17:18
 
   // LoTypes icons
   course: { type: "fluent:notebook-24-filled", color: "primary" },
-  topic: { type: "fluent:bookmark-24-filled", color: "secondary" },
+  topic: { type: "", color: "secondary" },
   unit: { type: "fluent:dual-screen-group-24-filled", color: "tertiary" },
   side: { type: "fluent:dual-screen-group-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:18:17
   // LoTypes icons
   course: { type: "fluent:notebook-24-filled", color: "primary" },
   topic: { type: "fluent:bookmark-24-filled", color: "secondary" },
-  unit: { type: "fluent:dual-screen-group-24-filled", color: "tertiary" },
+  unit: { type: "", color: "tertiary" },
   side: { type: "fluent:dual-screen-group-24-filled", color: "success" },
   talk: { type: "fluent:presenter-24-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:20:17
   topic: { type: "fluent:bookmark-24-filled", color: "secondary" },
   unit: { type: "fluent:dual-screen-group-24-filled", color: "tertiary" },
   side: { type: "fluent:dual-screen-group-24-filled", color: "success" },
-  talk: { type: "fluent:presenter-24-filled", color: "warning" },
+  talk: { type: "", color: "warning" },
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },
   lab: { type: "fluent:beaker-24-filled", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:22:50
   side: { type: "fluent:dual-screen-group-24-filled", color: "success" },
   talk: { type: "fluent:presenter-24-filled", color: "warning" },
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },
-  lab: { type: "fluent:beaker-24-filled", color: "error" },
+  lab: { type: "fluent:beaker-24-filled", color: "" },
   note: { type: "fluent:notepad-16-regular", color: "success" },
   archive: { type: "fluent:archive-24-filled", color: "error" },

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:25:8
   lab: { type: "fluent:beaker-24-filled", color: "error" },
   note: { type: "fluent:notepad-16-regular", color: "success" },
   archive: { type: "fluent:archive-24-filled", color: "error" },
-  web: { type: "fluent:bookmark-24-regular", color: "primary" },
+  web: {},
   github: { type: "mdi:github", color: "warning" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:25:16
   lab: { type: "fluent:beaker-24-filled", color: "error" },
   note: { type: "fluent:notepad-16-regular", color: "success" },
   archive: { type: "fluent:archive-24-filled", color: "error" },
-  web: { type: "fluent:bookmark-24-regular", color: "primary" },
+  web: { type: "", color: "primary" },
   github: { type: "mdi:github", color: "warning" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:26:11
   note: { type: "fluent:notepad-16-regular", color: "success" },
   archive: { type: "fluent:archive-24-filled", color: "error" },
   web: { type: "fluent:bookmark-24-regular", color: "primary" },
-  github: { type: "mdi:github", color: "warning" },
+  github: {},
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
   paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:26:19
   note: { type: "fluent:notepad-16-regular", color: "success" },
   archive: { type: "fluent:archive-24-filled", color: "error" },
   web: { type: "fluent:bookmark-24-regular", color: "primary" },
-  github: { type: "mdi:github", color: "warning" },
+  github: { type: "", color: "warning" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
   paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:27:15
   archive: { type: "fluent:archive-24-filled", color: "error" },
   web: { type: "fluent:bookmark-24-regular", color: "primary" },
   github: { type: "mdi:github", color: "warning" },
-  panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
+  panelvideo: {},
   paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },
   panelnote: { type: "fluent:notepad-16-regular", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:28:22
   web: { type: "fluent:bookmark-24-regular", color: "primary" },
   github: { type: "mdi:github", color: "warning" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
-  paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },
+  paneltalk: { type: "", color: "primary" },
   panelnote: { type: "fluent:notepad-16-regular", color: "warning" },
   tutorial: { type: "fluent:arrow-clockwise-dashes-settings-24-regular", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:31:20
   paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },
   panelnote: { type: "fluent:notepad-16-regular", color: "warning" },
   tutorial: { type: "fluent:arrow-clockwise-dashes-settings-24-regular", color: "primary" },
-  podcast: { type: "fluent:mic-20-filled", color: "primary" },
+  podcast: { type: "", color: "primary" },
 
   // pdf reader icons

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:37:19
   left: { type: "fluent:ios-arrow-left-24-filled", color: "success" },
   right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
   print: { type: "fluent:print-24-filled", color: "success" },
-  rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },
+  rotate: { type: "", color: "success" },
   download: { type: "fluent:arrow-download-24-filled", color: "success" },
   fullScreen: { type: "fluent:arrow-expand-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:38:63
   right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
   print: { type: "fluent:print-24-filled", color: "success" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },
-  download: { type: "fluent:arrow-download-24-filled", color: "success" },
+  download: { type: "fluent:arrow-download-24-filled", color: "" },
   fullScreen: { type: "fluent:arrow-expand-24-filled", color: "success" },
 

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:39:15
   print: { type: "fluent:print-24-filled", color: "success" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },
   download: { type: "fluent:arrow-download-24-filled", color: "success" },
-  fullScreen: { type: "fluent:arrow-expand-24-filled", color: "success" },
+  fullScreen: {},
 
   // tutors time icons

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:42:65
   fullScreen: { type: "fluent:arrow-expand-24-filled", color: "success" },
 
   // tutors time icons
-  online: { type: "fluent:presence-available-24-filled", color: "success" },
+  online: { type: "fluent:presence-available-24-filled", color: "" },
   offline: { type: "fluent:presence-available-24-regular", color: "error" },
   tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:43:12
 
   // tutors time icons
   online: { type: "fluent:presence-available-24-filled", color: "success" },
-  offline: { type: "fluent:presence-available-24-regular", color: "error" },
+  offline: {},
   tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "primary" },
   timeExport: { type: "fluent:save-arrow-right-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:50:57
 
   // app icons
   search: { type: "fluent:search-24-filled", color: "primary" },
-  tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
+  tutors: { type: "fa-solid:chalkboard-teacher", color: "" },
   logout: { type: "fluent:sign-out-24-filled", color: "error" },
   lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:53:18
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
   logout: { type: "fluent:sign-out-24-filled", color: "error" },
   lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
-  light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
+  light: { type: "", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:54:17
   logout: { type: "fluent:sign-out-24-filled", color: "error" },
   lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
-  dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
+  dark: { type: "", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },
   compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:55:8
   lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
-  toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },
+  toc: {},
   compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
   expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:56:14
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },
-  compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
+  compacted: {},
   expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:57:21
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "bg-base-content" },
   compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
-  expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },
+  expanded: { type: "", color: "success" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:59:13
   compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
   expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
-  circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },
+  circular: {},
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
   coursetree: { type: "ph:tree-view-duotone", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:59:64
   compacted: { type: "fluent:re-order-dots-vertical-24-filled", color: "success" },
   expanded: { type: "fluent:re-order-dots-horizontal-24-filled", color: "success" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
-  circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },
+  circular: { type: "fluent:circle-sparkle-28-regular", color: "" },
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
   coursetree: { type: "ph:tree-view-duotone", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:61:23
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
-  coursetree: { type: "ph:tree-view-duotone", color: "primary" },
+  coursetree: { type: "", color: "primary" },
 
   courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:65:13
 
   courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },
   llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
-  calendar: { type: "fluent:calendar-ltr-12-regular", color: "bg-base-content" },
+  calendar: {},
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:68:9
   calendar: { type: "fluent:calendar-ltr-12-regular", color: "bg-base-content" },
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
-  edit: { type: "typcn:edit", color: "primary" },
+  edit: {},
   info: { type: "fluent:info-28-regular", color: "primary" },
   close: { type: "carbon:close-outline", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:69:50
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
   edit: { type: "typcn:edit", color: "primary" },
-  info: { type: "fluent:info-28-regular", color: "primary" },
+  info: { type: "fluent:info-28-regular", color: "" },
   close: { type: "carbon:close-outline", color: "primary" },
   theme: { type: "fluent:color-fill-24-regular", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:70:10
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
   edit: { type: "typcn:edit", color: "primary" },
   info: { type: "fluent:info-28-regular", color: "primary" },
-  close: { type: "carbon:close-outline", color: "primary" },
+  close: {},
   theme: { type: "fluent:color-fill-24-regular", color: "success" },
   codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:72:22
   info: { type: "fluent:info-28-regular", color: "primary" },
   close: { type: "carbon:close-outline", color: "primary" },
   theme: { type: "fluent:color-fill-24-regular", color: "success" },
-  codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },
+  codeTheme: { type: "", color: "primary" },
 
   // sentiment

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:72:70
   info: { type: "fluent:info-28-regular", color: "primary" },
   close: { type: "carbon:close-outline", color: "primary" },
   theme: { type: "fluent:color-fill-24-regular", color: "success" },
-  codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },
+  codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "" },
 
   // sentiment

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:75:20
   codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },
 
   // sentiment
-  neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
+  neutral: { type: "", color: "bg-base-content" },
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/fluent-icons.ts:75:44
   codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },
 
   // sentiment
-  neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
+  neutral: { type: "twemoji:dizzy", color: "" },
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:76:9
 
   // sentiment
   neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
-  fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
+  fine: {},
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
   confident: { type: "twemoji:flexed-biceps", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/fluent-icons.ts:78:14
   neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
-  confident: { type: "twemoji:flexed-biceps", color: "primary" },
+  confident: {},
   overwhelmed: { type: "twemoji:exploding-head", color: "warning" },
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
