[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:5:46
 
 export const HalloweenIconLib: IconLib = {
   // Home type
-  programHome: { type: "cib:nodemon", color: "warning" },
+  programHome: { type: "cib:nodemon", color: "" },
 
   // companion types

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:5:16
 
 export const HalloweenIconLib: IconLib = {
   // Home type
-  programHome: { type: "cib:nodemon", color: "warning" },
+  programHome: {},
 
   // companion types

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:8:10
   programHome: { type: "cib:nodemon", color: "warning" },
 
   // companion types
-  slack: { type: "fluent:chat-24-filled", color: "warning" },
+  slack: {},
   moodle: { type: "mdi:wizard-hat", color: "warning" },
   youtube: { type: "fluent:video-clip-24-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:10:58
   // companion types
   slack: { type: "fluent:chat-24-filled", color: "warning" },
   moodle: { type: "mdi:wizard-hat", color: "warning" },
-  youtube: { type: "fluent:video-clip-24-filled", color: "warning" },
+  youtube: { type: "fluent:video-clip-24-filled", color: "" },
   video: { type: "fluent:video-clip-24-filled", color: "warning" },
   zoom: { type: "fluent:video-24-filled", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:10:12
   // companion types
   slack: { type: "fluent:chat-24-filled", color: "warning" },
   moodle: { type: "mdi:wizard-hat", color: "warning" },
-  youtube: { type: "fluent:video-clip-24-filled", color: "warning" },
+  youtube: {},
   video: { type: "fluent:video-clip-24-filled", color: "warning" },
   zoom: { type: "fluent:video-24-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:11:56
   slack: { type: "fluent:chat-24-filled", color: "warning" },
   moodle: { type: "mdi:wizard-hat", color: "warning" },
   youtube: { type: "fluent:video-clip-24-filled", color: "warning" },
-  video: { type: "fluent:video-clip-24-filled", color: "warning" },
+  video: { type: "fluent:video-clip-24-filled", color: "" },
   zoom: { type: "fluent:video-24-filled", color: "warning" },
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:11:18
   slack: { type: "fluent:chat-24-filled", color: "warning" },
   moodle: { type: "mdi:wizard-hat", color: "warning" },
   youtube: { type: "fluent:video-clip-24-filled", color: "warning" },
-  video: { type: "fluent:video-clip-24-filled", color: "warning" },
+  video: { type: "", color: "warning" },
   zoom: { type: "fluent:video-24-filled", color: "warning" },
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:12:9
   moodle: { type: "mdi:wizard-hat", color: "warning" },
   youtube: { type: "fluent:video-clip-24-filled", color: "warning" },
   video: { type: "fluent:video-clip-24-filled", color: "warning" },
-  zoom: { type: "fluent:video-24-filled", color: "warning" },
+  zoom: {},
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
 

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:13:18
   youtube: { type: "fluent:video-clip-24-filled", color: "warning" },
   video: { type: "fluent:video-clip-24-filled", color: "warning" },
   zoom: { type: "fluent:video-24-filled", color: "warning" },
-  teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
+  teams: { type: "", color: "bg-base-content" },
 
   // LoTypes types

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:17:45
 
   // LoTypes types
   course: { type: "fa-solid:book-dead", color: "warning" },
-  topic: { type: "ph:sword-duotone", color: "warning" },
+  topic: { type: "ph:sword-duotone", color: "" },
   unit: { type: "type-park-outline:pumpkin", color: "warning" },
   side: { type: "type-park-outline:pumpkin", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:18:17
   // LoTypes types
   course: { type: "fa-solid:book-dead", color: "warning" },
   topic: { type: "ph:sword-duotone", color: "warning" },
-  unit: { type: "type-park-outline:pumpkin", color: "warning" },
+  unit: { type: "", color: "warning" },
   side: { type: "type-park-outline:pumpkin", color: "warning" },
   talk: { type: "carbon:bat", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:19:17
   course: { type: "fa-solid:book-dead", color: "warning" },
   topic: { type: "ph:sword-duotone", color: "warning" },
   unit: { type: "type-park-outline:pumpkin", color: "warning" },
-  side: { type: "type-park-outline:pumpkin", color: "warning" },
+  side: { type: "", color: "warning" },
   talk: { type: "carbon:bat", color: "warning" },
   reference: { type: "emojione-monotone:skull", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:19:9
   course: { type: "fa-solid:book-dead", color: "warning" },
   topic: { type: "ph:sword-duotone", color: "warning" },
   unit: { type: "type-park-outline:pumpkin", color: "warning" },
-  side: { type: "type-park-outline:pumpkin", color: "warning" },
+  side: {},
   talk: { type: "carbon:bat", color: "warning" },
   reference: { type: "emojione-monotone:skull", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:20:17
   topic: { type: "ph:sword-duotone", color: "warning" },
   unit: { type: "type-park-outline:pumpkin", color: "warning" },
   side: { type: "type-park-outline:pumpkin", color: "warning" },
-  talk: { type: "carbon:bat", color: "warning" },
+  talk: { type: "", color: "warning" },
   reference: { type: "emojione-monotone:skull", color: "warning" },
   lab: { type: "mdi:spider-thread", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:20:38
   topic: { type: "ph:sword-duotone", color: "warning" },
   unit: { type: "type-park-outline:pumpkin", color: "warning" },
   side: { type: "type-park-outline:pumpkin", color: "warning" },
-  talk: { type: "carbon:bat", color: "warning" },
+  talk: { type: "carbon:bat", color: "" },
   reference: { type: "emojione-monotone:skull", color: "warning" },
   lab: { type: "mdi:spider-thread", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:21:14
   unit: { type: "type-park-outline:pumpkin", color: "warning" },
   side: { type: "type-park-outline:pumpkin", color: "warning" },
   talk: { type: "carbon:bat", color: "warning" },
-  reference: { type: "emojione-monotone:skull", color: "warning" },
+  reference: {},
   lab: { type: "mdi:spider-thread", color: "warning" },
   archive: { type: "emojione-monotone:spider-web", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:22:44
   side: { type: "type-park-outline:pumpkin", color: "warning" },
   talk: { type: "carbon:bat", color: "warning" },
   reference: { type: "emojione-monotone:skull", color: "warning" },
-  lab: { type: "mdi:spider-thread", color: "warning" },
+  lab: { type: "mdi:spider-thread", color: "" },
   archive: { type: "emojione-monotone:spider-web", color: "warning" },
   web: { type: "fluent:bookmark-24-regular", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:25:58
   lab: { type: "mdi:spider-thread", color: "warning" },
   archive: { type: "emojione-monotone:spider-web", color: "warning" },
   web: { type: "fluent:bookmark-24-regular", color: "warning" },
-  github: { type: "fluent:code-circle-20-filled", color: "warning" },
+  github: { type: "fluent:code-circle-20-filled", color: "" },
   panelvideo: { type: "whh:wizard", color: "warning" },
 

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:26:23
   archive: { type: "emojione-monotone:spider-web", color: "warning" },
   web: { type: "fluent:bookmark-24-regular", color: "warning" },
   github: { type: "fluent:code-circle-20-filled", color: "warning" },
-  panelvideo: { type: "whh:wizard", color: "warning" },
+  panelvideo: { type: "", color: "warning" },
 
   // pdf reader types

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:29:17
   panelvideo: { type: "whh:wizard", color: "warning" },
 
   // pdf reader types
-  left: { type: "fluent:ios-arrow-left-24-filled", color: "warning" },
+  left: { type: "", color: "warning" },
   right: { type: "fluent:ios-arrow-right-24-filled", color: "warning" },
   print: { type: "fluent:print-24-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:30:61
 
   // pdf reader types
   left: { type: "fluent:ios-arrow-left-24-filled", color: "warning" },
-  right: { type: "fluent:ios-arrow-right-24-filled", color: "warning" },
+  right: { type: "fluent:ios-arrow-right-24-filled", color: "" },
   print: { type: "fluent:print-24-filled", color: "warning" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:32:19
   left: { type: "fluent:ios-arrow-left-24-filled", color: "warning" },
   right: { type: "fluent:ios-arrow-right-24-filled", color: "warning" },
   print: { type: "fluent:print-24-filled", color: "warning" },
-  rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "warning" },
+  rotate: { type: "", color: "warning" },
   download: { type: "fluent:arrow-download-24-filled", color: "warning" },
   fullScreen: { type: "fluent:arrow-expand-24-filled", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:33:13
   right: { type: "fluent:ios-arrow-right-24-filled", color: "warning" },
   print: { type: "fluent:print-24-filled", color: "warning" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "warning" },
-  download: { type: "fluent:arrow-download-24-filled", color: "warning" },
+  download: {},
   fullScreen: { type: "fluent:arrow-expand-24-filled", color: "warning" },
 

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:34:15
   print: { type: "fluent:print-24-filled", color: "warning" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "warning" },
   download: { type: "fluent:arrow-download-24-filled", color: "warning" },
-  fullScreen: { type: "fluent:arrow-expand-24-filled", color: "warning" },
+  fullScreen: {},
 
   // tutors time types

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:34:63
   print: { type: "fluent:print-24-filled", color: "warning" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "warning" },
   download: { type: "fluent:arrow-download-24-filled", color: "warning" },
-  fullScreen: { type: "fluent:arrow-expand-24-filled", color: "warning" },
+  fullScreen: { type: "fluent:arrow-expand-24-filled", color: "" },
 
   // tutors time types

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:37:62
   fullScreen: { type: "fluent:arrow-expand-24-filled", color: "warning" },
 
   // tutors time types
-  tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "warning" },
+  tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "" },
   timeExport: { type: "fluent:save-arrow-right-24-filled", color: "warning" },
   live: { type: "fluent:people-community-24-filled", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:37:15
   fullScreen: { type: "fluent:arrow-expand-24-filled", color: "warning" },
 
   // tutors time types
-  tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "warning" },
+  tutorsTime: {},
   timeExport: { type: "fluent:save-arrow-right-24-filled", color: "warning" },
   live: { type: "fluent:people-community-24-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:38:67
 
   // tutors time types
   tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "warning" },
-  timeExport: { type: "fluent:save-arrow-right-24-filled", color: "warning" },
+  timeExport: { type: "fluent:save-arrow-right-24-filled", color: "" },
   live: { type: "fluent:people-community-24-filled", color: "warning" },
 

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:44:11
   // app types
   search: { type: "uil:hunting", color: "warning" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "warning" },
-  logout: { type: "fluent:sign-out-24-filled", color: "warning" },
+  logout: {},
   dark: { type: "uil:thunderstorm-moon", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:44:55
   // app types
   search: { type: "uil:hunting", color: "warning" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "warning" },
-  logout: { type: "fluent:sign-out-24-filled", color: "warning" },
+  logout: { type: "fluent:sign-out-24-filled", color: "" },
   dark: { type: "uil:thunderstorm-moon", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:45:17
   search: { type: "uil:hunting", color: "warning" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "warning" },
   logout: { type: "fluent:sign-out-24-filled", color: "warning" },
-  dark: { type: "uil:thunderstorm-moon", color: "warning" },
+  dark: { type: "", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "warning" },
   compacted: { type: "mdi:coffin", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:45:9
   search: { type: "uil:hunting", color: "warning" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "warning" },
   logout: { type: "fluent:sign-out-24-filled", color: "warning" },
-  dark: { type: "uil:thunderstorm-moon", color: "warning" },
+  dark: {},
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "warning" },
   compacted: { type: "mdi:coffin", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:47:43
   logout: { type: "fluent:sign-out-24-filled", color: "warning" },
   dark: { type: "uil:thunderstorm-moon", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "warning" },
-  compacted: { type: "mdi:coffin", color: "warning" },
+  compacted: { type: "mdi:coffin", color: "" },
   expanded: { type: "mdi:coffin", color: "warning" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:48:13
   dark: { type: "uil:thunderstorm-moon", color: "warning" },
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "warning" },
   compacted: { type: "mdi:coffin", color: "warning" },
-  expanded: { type: "mdi:coffin", color: "warning" },
+  expanded: {},
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:49:21
   toc: { type: "fluent:line-horizontal-3-20-filled", color: "warning" },
   compacted: { type: "mdi:coffin", color: "warning" },
   expanded: { type: "mdi:coffin", color: "warning" },
-  portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
+  portrait: { type: "", color: "primary" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:51:22
   expanded: { type: "mdi:coffin", color: "warning" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },
-  landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
+  landscape: { type: "", color: "error" },
   edit: { type: "typcn:edit", color: "primary" },
   theme: { type: "fluent:color-fill-24-regular", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:51:14
   expanded: { type: "mdi:coffin", color: "warning" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },
-  landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
+  landscape: {},
   edit: { type: "typcn:edit", color: "primary" },
   theme: { type: "fluent:color-fill-24-regular", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:52:9
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
-  edit: { type: "typcn:edit", color: "primary" },
+  edit: {},
   theme: { type: "fluent:color-fill-24-regular", color: "success" },
   codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:53:57
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
   edit: { type: "typcn:edit", color: "primary" },
-  theme: { type: "fluent:color-fill-24-regular", color: "success" },
+  theme: { type: "fluent:color-fill-24-regular", color: "" },
   codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },
 

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:54:14
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
   edit: { type: "typcn:edit", color: "primary" },
   theme: { type: "fluent:color-fill-24-regular", color: "success" },
-  codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },
+  codeTheme: {},
 
   // sentiment — same twemoji set as fluent theme

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:57:20
   codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },
 
   // sentiment — same twemoji set as fluent theme
-  neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
+  neutral: { type: "", color: "bg-base-content" },
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:61:57
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
   confident: { type: "twemoji:flexed-biceps", color: "primary" },
-  overwhelmed: { type: "twemoji:exploding-head", color: "warning" },
+  overwhelmed: { type: "twemoji:exploding-head", color: "" },
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
   drained: { type: "twemoji:melting-face", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:62:61
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
   confident: { type: "twemoji:flexed-biceps", color: "primary" },
   overwhelmed: { type: "twemoji:exploding-head", color: "warning" },
-  confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
+  confused: { type: "twemoji:face-with-spiral-eyes", color: "" },
   drained: { type: "twemoji:melting-face", color: "error" },
 

[NoCoverage] ObjectLiteral
services/themes/icons/halloween-icons.ts:65:12
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
   drained: { type: "twemoji:melting-face", color: "error" },
 
-  default: { type: "mdi:coffin", color: "warning" }
+  default: {}
 };
 

[NoCoverage] StringLiteral
services/themes/icons/halloween-icons.ts:65:20
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
   drained: { type: "twemoji:melting-face", color: "error" },
 
-  default: { type: "mdi:coffin", color: "warning" }
+  default: { type: "", color: "warning" }
 };
 
