[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:5:16
 
 export const HeroIconLib: IconLib = {
   // Home Icon
-  programHome: { type: "heroicons-outline:home", color: "success" },
+  programHome: {},
 
   // companion Icons

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:5:57
 
 export const HeroIconLib: IconLib = {
   // Home Icon
-  programHome: { type: "heroicons-outline:home", color: "success" },
+  programHome: { type: "heroicons-outline:home", color: "" },
 
   // companion Icons

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:8:18
   programHome: { type: "heroicons-outline:home", color: "success" },
 
   // companion Icons
-  slack: { type: "grommet-icons:slack", color: "error" },
+  slack: { type: "", color: "error" },
   moodle: { type: "map:university", color: "warning" },
   youtube: { type: "logos:youtube-icon", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:9:44
 
   // companion Icons
   slack: { type: "grommet-icons:slack", color: "error" },
-  moodle: { type: "map:university", color: "warning" },
+  moodle: { type: "map:university", color: "" },
   youtube: { type: "logos:youtube-icon", color: "error" },
   video: { type: "heroicons-outline:play", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:10:49
   // companion Icons
   slack: { type: "grommet-icons:slack", color: "error" },
   moodle: { type: "map:university", color: "warning" },
-  youtube: { type: "logos:youtube-icon", color: "error" },
+  youtube: { type: "logos:youtube-icon", color: "" },
   video: { type: "heroicons-outline:play", color: "error" },
   zoom: { type: "grommet-icons:zoom", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:11:18
   slack: { type: "grommet-icons:slack", color: "error" },
   moodle: { type: "map:university", color: "warning" },
   youtube: { type: "logos:youtube-icon", color: "error" },
-  video: { type: "heroicons-outline:play", color: "error" },
+  video: { type: "", color: "error" },
   zoom: { type: "grommet-icons:zoom", color: "primary" },
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:13:50
   youtube: { type: "logos:youtube-icon", color: "error" },
   video: { type: "heroicons-outline:play", color: "error" },
   zoom: { type: "grommet-icons:zoom", color: "primary" },
-  teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
+  teams: { type: "logos:microsoft-teams", color: "" },
 
   // LoTypes icons

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:16:57
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
 
   // LoTypes icons
-  course: { type: "heroicons-outline:book-open", color: "primary" },
+  course: { type: "heroicons-outline:book-open", color: "" },
   topic: { type: "heroicons-outline:view-boards", color: "primary" },
   unit: { type: "heroicons-outline:collection", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:16:11
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
 
   // LoTypes icons
-  course: { type: "heroicons-outline:book-open", color: "primary" },
+  course: {},
   topic: { type: "heroicons-outline:view-boards", color: "primary" },
   unit: { type: "heroicons-outline:collection", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:17:10
 
   // LoTypes icons
   course: { type: "heroicons-outline:book-open", color: "primary" },
-  topic: { type: "heroicons-outline:view-boards", color: "primary" },
+  topic: {},
   unit: { type: "heroicons-outline:collection", color: "success" },
   side: { type: "heroicons-outline:collection", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:21:22
   unit: { type: "heroicons-outline:collection", color: "success" },
   side: { type: "heroicons-outline:collection", color: "success" },
   talk: { type: "heroicons-outline:presentation-chart-bar", color: "primary" },
-  reference: { type: "heroicons-outline:document-duplicate", color: "warning" },
+  reference: { type: "", color: "warning" },
   lab: { type: "heroicons-outline:beaker", color: "success" },
   archive: { type: "heroicons-outline:archive", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:21:14
   unit: { type: "heroicons-outline:collection", color: "success" },
   side: { type: "heroicons-outline:collection", color: "success" },
   talk: { type: "heroicons-outline:presentation-chart-bar", color: "primary" },
-  reference: { type: "heroicons-outline:document-duplicate", color: "warning" },
+  reference: {},
   lab: { type: "heroicons-outline:beaker", color: "success" },
   archive: { type: "heroicons-outline:archive", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:22:51
   side: { type: "heroicons-outline:collection", color: "success" },
   talk: { type: "heroicons-outline:presentation-chart-bar", color: "primary" },
   reference: { type: "heroicons-outline:document-duplicate", color: "warning" },
-  lab: { type: "heroicons-outline:beaker", color: "success" },
+  lab: { type: "heroicons-outline:beaker", color: "" },
   archive: { type: "heroicons-outline:archive", color: "primary" },
   web: { type: "heroicons-outline:bookmark", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:22:16
   side: { type: "heroicons-outline:collection", color: "success" },
   talk: { type: "heroicons-outline:presentation-chart-bar", color: "primary" },
   reference: { type: "heroicons-outline:document-duplicate", color: "warning" },
-  lab: { type: "heroicons-outline:beaker", color: "success" },
+  lab: { type: "", color: "success" },
   archive: { type: "heroicons-outline:archive", color: "primary" },
   web: { type: "heroicons-outline:bookmark", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:24:8
   reference: { type: "heroicons-outline:document-duplicate", color: "warning" },
   lab: { type: "heroicons-outline:beaker", color: "success" },
   archive: { type: "heroicons-outline:archive", color: "primary" },
-  web: { type: "heroicons-outline:bookmark", color: "primary" },
+  web: {},
   github: { type: "heroicons-outline:terminal", color: "warning" },
   panelvideo: { type: "heroicons-outline:play", color: "error" },

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:25:11
   lab: { type: "heroicons-outline:beaker", color: "success" },
   archive: { type: "heroicons-outline:archive", color: "primary" },
   web: { type: "heroicons-outline:bookmark", color: "primary" },
-  github: { type: "heroicons-outline:terminal", color: "warning" },
+  github: {},
   panelvideo: { type: "heroicons-outline:play", color: "error" },
   paneltalk: { type: "heroicons-outline:presentation-chart-bar", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:26:56
   archive: { type: "heroicons-outline:archive", color: "primary" },
   web: { type: "heroicons-outline:bookmark", color: "primary" },
   github: { type: "heroicons-outline:terminal", color: "warning" },
-  panelvideo: { type: "heroicons-outline:play", color: "error" },
+  panelvideo: { type: "heroicons-outline:play", color: "" },
   paneltalk: { type: "heroicons-outline:presentation-chart-bar", color: "primary" },
   note: { type: "heroicons:document-text", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:28:51
   github: { type: "heroicons-outline:terminal", color: "warning" },
   panelvideo: { type: "heroicons-outline:play", color: "error" },
   paneltalk: { type: "heroicons-outline:presentation-chart-bar", color: "primary" },
-  note: { type: "heroicons:document-text", color: "warning" },
+  note: { type: "heroicons:document-text", color: "" },
   panelnote: { type: "heroicons:document-text", color: "warning" },
 

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:28:17
   github: { type: "heroicons-outline:terminal", color: "warning" },
   panelvideo: { type: "heroicons-outline:play", color: "error" },
   paneltalk: { type: "heroicons-outline:presentation-chart-bar", color: "primary" },
-  note: { type: "heroicons:document-text", color: "warning" },
+  note: { type: "", color: "warning" },
   panelnote: { type: "heroicons:document-text", color: "warning" },
 

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:29:22
   panelvideo: { type: "heroicons-outline:play", color: "error" },
   paneltalk: { type: "heroicons-outline:presentation-chart-bar", color: "primary" },
   note: { type: "heroicons:document-text", color: "warning" },
-  panelnote: { type: "heroicons:document-text", color: "warning" },
+  panelnote: { type: "", color: "warning" },
 
   // pdf reader icons

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:29:56
   panelvideo: { type: "heroicons-outline:play", color: "error" },
   paneltalk: { type: "heroicons-outline:presentation-chart-bar", color: "primary" },
   note: { type: "heroicons:document-text", color: "warning" },
-  panelnote: { type: "heroicons:document-text", color: "warning" },
+  panelnote: { type: "heroicons:document-text", color: "" },
 
   // pdf reader icons

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:32:9
   panelnote: { type: "heroicons:document-text", color: "warning" },
 
   // pdf reader icons
-  left: { type: "heroicons-outline:arrow-left", color: "success" },
+  left: {},
   right: { type: "heroicons-outline:arrow-right", color: "success" },
   print: { type: "heroicons-outline:printer", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:34:10
   // pdf reader icons
   left: { type: "heroicons-outline:arrow-left", color: "success" },
   right: { type: "heroicons-outline:arrow-right", color: "success" },
-  print: { type: "heroicons-outline:printer", color: "success" },
+  print: {},
   rotate: { type: "heroicons-outline:refresh", color: "success" },
   download: { type: "heroicons-outline:arrow-down", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:35:19
   left: { type: "heroicons-outline:arrow-left", color: "success" },
   right: { type: "heroicons-outline:arrow-right", color: "success" },
   print: { type: "heroicons-outline:printer", color: "success" },
-  rotate: { type: "heroicons-outline:refresh", color: "success" },
+  rotate: { type: "", color: "success" },
   download: { type: "heroicons-outline:arrow-down", color: "success" },
   fullScreen: { type: "heroicons-outline:arrows-expand", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:36:13
   right: { type: "heroicons-outline:arrow-right", color: "success" },
   print: { type: "heroicons-outline:printer", color: "success" },
   rotate: { type: "heroicons-outline:refresh", color: "success" },
-  download: { type: "heroicons-outline:arrow-down", color: "success" },
+  download: {},
   fullScreen: { type: "heroicons-outline:arrows-expand", color: "success" },
 

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:37:15
   print: { type: "heroicons-outline:printer", color: "success" },
   rotate: { type: "heroicons-outline:refresh", color: "success" },
   download: { type: "heroicons-outline:arrow-down", color: "success" },
-  fullScreen: { type: "heroicons-outline:arrows-expand", color: "success" },
+  fullScreen: {},
 
   // tutors time icons

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:40:19
   fullScreen: { type: "heroicons-outline:arrows-expand", color: "success" },
 
   // tutors time icons
-  online: { type: "fluent:presence-available-24-filled", color: "success" },
+  online: { type: "", color: "success" },
   offline: { type: "fluent:presence-available-24-regular", color: "error" },
   tutorsTime: { type: "heroicons-outline:clock", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:41:67
 
   // tutors time icons
   online: { type: "fluent:presence-available-24-filled", color: "success" },
-  offline: { type: "fluent:presence-available-24-regular", color: "error" },
+  offline: { type: "fluent:presence-available-24-regular", color: "" },
   tutorsTime: { type: "heroicons-outline:clock", color: "primary" },
   timeExport: { type: "heroicons-outline:save-as", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:44:17
   offline: { type: "fluent:presence-available-24-regular", color: "error" },
   tutorsTime: { type: "heroicons-outline:clock", color: "primary" },
   timeExport: { type: "heroicons-outline:save-as", color: "success" },
-  live: { type: "heroicons-outline:users", color: "success" },
+  live: { type: "", color: "success" },
 
   // app icons

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:47:54
   live: { type: "heroicons-outline:users", color: "success" },
 
   // app icons
-  search: { type: "heroicons-outline:search", color: "primary" },
+  search: { type: "heroicons-outline:search", color: "" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
   logout: { type: "heroicons-outline:logout", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:49:54
   // app icons
   search: { type: "heroicons-outline:search", color: "primary" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
-  logout: { type: "heroicons-outline:logout", color: "error" },
+  logout: { type: "heroicons-outline:logout", color: "" },
   lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:49:19
   // app icons
   search: { type: "heroicons-outline:search", color: "primary" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
-  logout: { type: "heroicons-outline:logout", color: "error" },
+  logout: { type: "", color: "error" },
   lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:50:14
   search: { type: "heroicons-outline:search", color: "primary" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
   logout: { type: "heroicons-outline:logout", color: "error" },
-  lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
+  lightMode: {},
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:50:61
   search: { type: "heroicons-outline:search", color: "primary" },
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
   logout: { type: "heroicons-outline:logout", color: "error" },
-  lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
+  lightMode: { type: "fluent:paint-brush-24-filled", color: "" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:53:55
   lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
-  toc: { type: "heroicons-outline:menu-alt-2", color: "bg-base-content" },
+  toc: { type: "heroicons-outline:menu-alt-2", color: "" },
   compacted: { type: "heroicons-outline:dots-vertical", color: "success" },
   expanded: { type: "heroicons-outline:dots-horizontal", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:55:13
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
   toc: { type: "heroicons-outline:menu-alt-2", color: "bg-base-content" },
   compacted: { type: "heroicons-outline:dots-vertical", color: "success" },
-  expanded: { type: "heroicons-outline:dots-horizontal", color: "success" },
+  expanded: {},
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:55:65
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },
   toc: { type: "heroicons-outline:menu-alt-2", color: "bg-base-content" },
   compacted: { type: "heroicons-outline:dots-vertical", color: "success" },
-  expanded: { type: "heroicons-outline:dots-horizontal", color: "success" },
+  expanded: { type: "heroicons-outline:dots-horizontal", color: "" },
   portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:56:84
   toc: { type: "heroicons-outline:menu-alt-2", color: "bg-base-content" },
   compacted: { type: "heroicons-outline:dots-vertical", color: "success" },
   expanded: { type: "heroicons-outline:dots-horizontal", color: "success" },
-  portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
+  portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:56:21
   toc: { type: "heroicons-outline:menu-alt-2", color: "bg-base-content" },
   compacted: { type: "heroicons-outline:dots-vertical", color: "success" },
   expanded: { type: "heroicons-outline:dots-horizontal", color: "success" },
-  portrait: { type: "fluent:rectangle-portrait-location-target-20-regular", color: "primary" },
+  portrait: { type: "", color: "primary" },
   circular: { type: "fluent:circle-sparkle-28-regular", color: "warning" },
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:61:53
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
 
   courseinfo: { type: "heroicons-outline:information-circle", color: "bg-base-content" },
-  llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
+  llm: { type: "hugeicons:ai-innovation-01", color: "" },
   calendar: { type: "fluent:calendar-ltr-12-regular", color: "bg-base-content" },
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:61:16
   landscape: { type: "fluent:rectangle-landscape-sparkle-48-regular", color: "error" },
 
   courseinfo: { type: "heroicons-outline:information-circle", color: "bg-base-content" },
-  llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
+  llm: { type: "", color: "bg-base-content" },
   calendar: { type: "fluent:calendar-ltr-12-regular", color: "bg-base-content" },
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:62:62
 
   courseinfo: { type: "heroicons-outline:information-circle", color: "bg-base-content" },
   llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
-  calendar: { type: "fluent:calendar-ltr-12-regular", color: "bg-base-content" },
+  calendar: { type: "fluent:calendar-ltr-12-regular", color: "" },
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:64:62
   llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
   calendar: { type: "fluent:calendar-ltr-12-regular", color: "bg-base-content" },
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },
-  listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
+  listOnline: { type: "fluent:people-list-24-filled", color: "" },
   edit: { type: "typcn:edit", color: "primary" },
   info: { type: "fluent:info-28-regular", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:68:18
   edit: { type: "typcn:edit", color: "primary" },
   info: { type: "fluent:info-28-regular", color: "primary" },
   close: { type: "fluent:add-square-32-regular", color: "primary" },
-  theme: { type: "fluent:color-fill-24-regular", color: "success" },
+  theme: { type: "", color: "success" },
   codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },
 

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:72:12
   codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },
 
   // sentiment — same twemoji set as fluent theme
-  neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
+  neutral: {},
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:73:57
 
   // sentiment — same twemoji set as fluent theme
   neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
-  fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
+  fine: { type: "twemoji:slightly-smiling-face", color: "" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
   confident: { type: "twemoji:flexed-biceps", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/hero-icons.ts:77:13
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },
   confident: { type: "twemoji:flexed-biceps", color: "primary" },
   overwhelmed: { type: "twemoji:exploding-head", color: "warning" },
-  confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
+  confused: {},
   drained: { type: "twemoji:melting-face", color: "error" },
 

[NoCoverage] StringLiteral
services/themes/icons/hero-icons.ts:80:62
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
   drained: { type: "twemoji:melting-face", color: "error" },
 
-  default: { type: "heroicons-outline:dots-vertical", color: "primary" }
+  default: { type: "heroicons-outline:dots-vertical", color: "" }
 };
 
