[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:8:18
   programHome: { type: "fluent:home-heart-32-filled", color: "success" },
 
   // companion Icons
-  slack: { type: "logos:slack-icon", color: "error" },
+  slack: { type: "", color: "error" },
   moodle: { type: "academicons:moodle", color: "warning" },
   youtube: { type: "fa:youtube", color: "error" },

[NoCoverage] ObjectLiteral
services/themes/icons/valentine-icons.ts:9:11
 
   // companion Icons
   slack: { type: "logos:slack-icon", color: "error" },
-  moodle: { type: "academicons:moodle", color: "warning" },
+  moodle: {},
   youtube: { type: "fa:youtube", color: "error" },
   video: { type: "fluent:video-clip-24-filled", color: "error" },

[NoCoverage] ObjectLiteral
services/themes/icons/valentine-icons.ts:11:10
   slack: { type: "logos:slack-icon", color: "error" },
   moodle: { type: "academicons:moodle", color: "warning" },
   youtube: { type: "fa:youtube", color: "error" },
-  video: { type: "fluent:video-clip-24-filled", color: "error" },
+  video: {},
   zoom: { type: "fluent:video-24-filled", color: "primary" },
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:13:18
   youtube: { type: "fa:youtube", color: "error" },
   video: { type: "fluent:video-clip-24-filled", color: "error" },
   zoom: { type: "fluent:video-24-filled", color: "primary" },
-  teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
+  teams: { type: "", color: "bg-base-content" },
 
   // LoTypes icons

[NoCoverage] ObjectLiteral
services/themes/icons/valentine-icons.ts:16:11
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
 
   // LoTypes icons
-  course: { type: "fluent:board-heart-24-filled", color: "primary" },
+  course: {},
   topic: { type: "line-md:heart-twotone", color: "secondary" },
   unit: { type: "mdi:puzzle-heart", color: "tertiary" },

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:16:58
   teams: { type: "logos:microsoft-teams", color: "bg-base-content" },
 
   // LoTypes icons
-  course: { type: "fluent:board-heart-24-filled", color: "primary" },
+  course: { type: "fluent:board-heart-24-filled", color: "" },
   topic: { type: "line-md:heart-twotone", color: "secondary" },
   unit: { type: "mdi:puzzle-heart", color: "tertiary" },

[NoCoverage] ObjectLiteral
services/themes/icons/valentine-icons.ts:18:9
   // LoTypes icons
   course: { type: "fluent:board-heart-24-filled", color: "primary" },
   topic: { type: "line-md:heart-twotone", color: "secondary" },
-  unit: { type: "mdi:puzzle-heart", color: "tertiary" },
+  unit: {},
   side: { type: "mdi:puzzle-heart", color: "success" },
   talk: { type: "fluent:presenter-24-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:19:17
   course: { type: "fluent:board-heart-24-filled", color: "primary" },
   topic: { type: "line-md:heart-twotone", color: "secondary" },
   unit: { type: "mdi:puzzle-heart", color: "tertiary" },
-  side: { type: "mdi:puzzle-heart", color: "success" },
+  side: { type: "", color: "success" },
   talk: { type: "fluent:presenter-24-filled", color: "warning" },
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:24:47
   reference: { type: "fluent:document-copy-24-filled", color: "surface" },
   lab: { type: "fluent:beaker-24-filled", color: "error" },
   note: { type: "fluent:notepad-16-regular", color: "success" },
-  archive: { type: "mdi:folder-heart", color: "error" },
+  archive: { type: "mdi:folder-heart", color: "" },
   web: { type: "tabler:world-heart", color: "primary" },
   github: { type: "mdi:github", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/valentine-icons.ts:25:8
   lab: { type: "fluent:beaker-24-filled", color: "error" },
   note: { type: "fluent:notepad-16-regular", color: "success" },
   archive: { type: "mdi:folder-heart", color: "error" },
-  web: { type: "tabler:world-heart", color: "primary" },
+  web: {},
   github: { type: "mdi:github", color: "warning" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:29:58
   github: { type: "mdi:github", color: "warning" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
   paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },
-  panelnote: { type: "fluent:notepad-16-regular", color: "warning" },
+  panelnote: { type: "fluent:notepad-16-regular", color: "" },
 
   // pdf reader icons

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:29:22
   github: { type: "mdi:github", color: "warning" },
   panelvideo: { type: "fluent:video-clip-24-regular", color: "error" },
   paneltalk: { type: "fluent:presenter-24-filled", color: "primary" },
-  panelnote: { type: "fluent:notepad-16-regular", color: "warning" },
+  panelnote: { type: "", color: "warning" },
 
   // pdf reader icons

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:32:17
   panelnote: { type: "fluent:notepad-16-regular", color: "warning" },
 
   // pdf reader icons
-  left: { type: "fluent:ios-arrow-left-24-filled", color: "success" },
+  left: { type: "", color: "success" },
   right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
   print: { type: "fluent:print-24-filled", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/valentine-icons.ts:32:9
   panelnote: { type: "fluent:notepad-16-regular", color: "warning" },
 
   // pdf reader icons
-  left: { type: "fluent:ios-arrow-left-24-filled", color: "success" },
+  left: {},
   right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
   print: { type: "fluent:print-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:33:61
 
   // pdf reader icons
   left: { type: "fluent:ios-arrow-left-24-filled", color: "success" },
-  right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
+  right: { type: "fluent:ios-arrow-right-24-filled", color: "" },
   print: { type: "fluent:print-24-filled", color: "success" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:34:18
   // pdf reader icons
   left: { type: "fluent:ios-arrow-left-24-filled", color: "success" },
   right: { type: "fluent:ios-arrow-right-24-filled", color: "success" },
-  print: { type: "fluent:print-24-filled", color: "success" },
+  print: { type: "", color: "success" },
   rotate: { type: "fluent:arrow-rotate-clockwise-24-filled", color: "success" },
   download: { type: "fluent:arrow-download-24-filled", color: "success" },

[NoCoverage] ObjectLiteral
services/themes/icons/valentine-icons.ts:42:15
   // tutors time icons
   online: { type: "fluent:presence-available-24-filled", color: "success" },
   offline: { type: "fluent:presence-available-24-regular", color: "error" },
-  tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "primary" },
+  tutorsTime: {},
   timeExport: { type: "fluent:save-arrow-right-24-filled", color: "success" },
   live: { type: "fluent:people-community-24-filled", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:43:23
   online: { type: "fluent:presence-available-24-filled", color: "success" },
   offline: { type: "fluent:presence-available-24-regular", color: "error" },
   tutorsTime: { type: "fluent:clock-alarm-24-filled", color: "primary" },
-  timeExport: { type: "fluent:save-arrow-right-24-filled", color: "success" },
+  timeExport: { type: "", color: "success" },
   live: { type: "fluent:people-community-24-filled", color: "success" },
 

[NoCoverage] ObjectLiteral
services/themes/icons/valentine-icons.ts:48:11
 
   // app icons
   search: { type: "bi:search-heart", color: "primary" }, 
-  tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
+  tutors: {},
   logout: { type: "fluent:sign-out-24-filled", color: "error" },
   lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:50:61
   search: { type: "bi:search-heart", color: "primary" }, 
   tutors: { type: "fa-solid:chalkboard-teacher", color: "bg-base-content" },
   logout: { type: "fluent:sign-out-24-filled", color: "error" },
-  lightMode: { type: "fluent:paint-brush-24-filled", color: "warning" },
+  lightMode: { type: "fluent:paint-brush-24-filled", color: "" },
   light: { type: "fluent:weather-sunny-32-filled", color: "warning" },
   dark: { type: "fluent:weather-moon-48-filled", color: "warning" },

[NoCoverage] ObjectLiteral
services/themes/icons/valentine-icons.ts:62:13
 
   courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },
   llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
-  calendar: { type: "hugeicons:calendar-love-02", color: "bg-base-content" },
+  calendar: {},
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:62:21
 
   courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },
   llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
-  calendar: { type: "hugeicons:calendar-love-02", color: "bg-base-content" },
+  calendar: { type: "", color: "bg-base-content" },
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/valentine-icons.ts:63:16
   courseinfo: { type: "fluent:info-28-regular", color: "bg-base-content" },
   llm: { type: "hugeicons:ai-innovation-01", color: "bg-base-content" },
   calendar: { type: "hugeicons:calendar-love-02", color: "bg-base-content" },
-  appSettings: { type: "fluent:settings-24-filled", color: "primary" },
+  appSettings: {},
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
   edit: { type: "tabler:pencil-heart", color: "primary" },

[NoCoverage] ObjectLiteral
services/themes/icons/valentine-icons.ts:66:9
   appSettings: { type: "fluent:settings-24-filled", color: "primary" },
   listOnline: { type: "fluent:people-list-24-filled", color: "primary" },
   edit: { type: "tabler:pencil-heart", color: "primary" },
-  info: { type: "fluent:info-28-regular", color: "primary" },
+  info: {},
   close: { type: "carbon:close-outline", color: "primary" },
   theme: { type: "fluent:color-fill-24-regular", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:72:44
   codeTheme: { type: "fluent:paint-brush-sparkle-20-regular", color: "primary" },
 
   // sentiment — same twemoji set as fluent theme
-  neutral: { type: "twemoji:dizzy", color: "bg-base-content" },
+  neutral: { type: "twemoji:dizzy", color: "" },
   fine: { type: "twemoji:slightly-smiling-face", color: "bg-base-content" },
   delighted: { type: "twemoji:grinning-face-with-big-eyes", color: "success" },

[NoCoverage] StringLiteral
services/themes/icons/valentine-icons.ts:80:70
   confused: { type: "twemoji:face-with-spiral-eyes", color: "secondary" },
   drained: { type: "twemoji:melting-face", color: "error" },
 
-  default: { type: "fluent:re-order-dots-vertical-24-filled", color: "error" }
+  default: { type: "fluent:re-order-dots-vertical-24-filled", color: "" }
 };
 
