[NoCoverage] StringLiteral
services/themes/services/themes.svelte.ts:38:34
   layout: rune<LayoutType>("expanded"),
 
   /** Current card style */
-  cardStyle: rune<CardStyleType>("portrait"),
+  cardStyle: rune<CardStyleType>(""),
 
   /** Current light move layout */

[NoCoverage] StringLiteral
services/themes/services/themes.svelte.ts:44:30
   lightMode: rune<string>("light"),
 
   /** Current theme */
-  currentTheme: rune<string>("tutors"),
+  currentTheme: rune<string>(""),
 
   /** State tracker for festive theme snow animation */

[NoCoverage] BooleanLiteral
services/themes/services/themes.svelte.ts:47:14
   currentTheme: rune<string>("tutors"),
 
   /** State tracker for festive theme snow animation */
-  isSnowing: false,
+  isSnowing: true,
 
   /**

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:55:62
    * @param forceTheme - Optional theme to enforce
    * @param forceMode - Optional display mode to enforce
    */
-  initDisplay(forceTheme?: string, forceMode?: string): void {
-    if (forceTheme && forceMode && !localStorage[forceTheme]) {
-      this.setDisplayMode(forceMode);
-      this.setTheme(forceTheme);
-      localStorage[forceTheme] = true;
-    } else {
-      this.setDisplayMode(localStorage.modeCurrent);
-      this.setTheme(localStorage.theme);
-    }
-    this.setLayout(localStorage.layout);
-    this.setCardStyle(localStorage.cardStyle);
-  },
+  initDisplay(forceTheme?: string, forceMode?: string): void {},
 
   /**

[NoCoverage] LogicalOperator
services/themes/services/themes.svelte.ts:56:9
    * @param forceMode - Optional display mode to enforce
    */
   initDisplay(forceTheme?: string, forceMode?: string): void {
-    if (forceTheme && forceMode && !localStorage[forceTheme]) {
+    if (forceTheme && forceMode || !localStorage[forceTheme]) {
       this.setDisplayMode(forceMode);
       this.setTheme(forceTheme);

[NoCoverage] LogicalOperator
services/themes/services/themes.svelte.ts:56:9
    * @param forceMode - Optional display mode to enforce
    */
   initDisplay(forceTheme?: string, forceMode?: string): void {
-    if (forceTheme && forceMode && !localStorage[forceTheme]) {
+    if (forceTheme || forceMode && !localStorage[forceTheme]) {
       this.setDisplayMode(forceMode);
       this.setTheme(forceTheme);

[NoCoverage] BooleanLiteral
services/themes/services/themes.svelte.ts:59:34
     if (forceTheme && forceMode && !localStorage[forceTheme]) {
       this.setDisplayMode(forceMode);
       this.setTheme(forceTheme);
-      localStorage[forceTheme] = true;
+      localStorage[forceTheme] = false;
     } else {
       this.setDisplayMode(localStorage.modeCurrent);

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:60:12
       this.setDisplayMode(forceMode);
       this.setTheme(forceTheme);
       localStorage[forceTheme] = true;
-    } else {
-      this.setDisplayMode(localStorage.modeCurrent);
-      this.setTheme(localStorage.theme);
-    }
+    } else {}
     this.setLayout(localStorage.layout);
     this.setCardStyle(localStorage.cardStyle);

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:73:38
    * Updates DOM classes for theme application
    * @param mode - Display mode to set
    */
-  setDisplayMode(mode: string): void {
-    if (!mode) {
-      mode = "light";
-    }
-    this.lightMode.value = mode;
-    localStorage.modeCurrent = mode;
-    if (mode === "dark") {
-      document.documentElement.classList.add("dark");
-    } else {
-      document.documentElement.classList.remove("dark");
-    }
-  },
+  setDisplayMode(mode: string): void {},
 
   /**

[NoCoverage] BooleanLiteral
services/themes/services/themes.svelte.ts:74:9
    * @param mode - Display mode to set
    */
   setDisplayMode(mode: string): void {
-    if (!mode) {
+    if (mode) {
       mode = "light";
     }

[NoCoverage] ConditionalExpression
services/themes/services/themes.svelte.ts:74:9
    * @param mode - Display mode to set
    */
   setDisplayMode(mode: string): void {
-    if (!mode) {
+    if (true) {
       mode = "light";
     }

[NoCoverage] StringLiteral
services/themes/services/themes.svelte.ts:75:14
    */
   setDisplayMode(mode: string): void {
     if (!mode) {
-      mode = "light";
+      mode = "";
     }
     this.lightMode.value = mode;

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:79:26
     }
     this.lightMode.value = mode;
     localStorage.modeCurrent = mode;
-    if (mode === "dark") {
-      document.documentElement.classList.add("dark");
-    } else {
+    if (mode === "dark") {} else {
       document.documentElement.classList.remove("dark");
     }

[NoCoverage] ConditionalExpression
services/themes/services/themes.svelte.ts:79:9
     }
     this.lightMode.value = mode;
     localStorage.modeCurrent = mode;
-    if (mode === "dark") {
+    if (false) {
       document.documentElement.classList.add("dark");
     } else {

[NoCoverage] StringLiteral
services/themes/services/themes.svelte.ts:80:46
     this.lightMode.value = mode;
     localStorage.modeCurrent = mode;
     if (mode === "dark") {
-      document.documentElement.classList.add("dark");
+      document.documentElement.classList.add("");
     } else {
       document.documentElement.classList.remove("dark");

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:81:12
     localStorage.modeCurrent = mode;
     if (mode === "dark") {
       document.documentElement.classList.add("dark");
-    } else {
-      document.documentElement.classList.remove("dark");
-    }
+    } else {}
   },
 

[NoCoverage] StringLiteral
services/themes/services/themes.svelte.ts:82:49
     if (mode === "dark") {
       document.documentElement.classList.add("dark");
     } else {
-      document.documentElement.classList.remove("dark");
+      document.documentElement.classList.remove("");
     }
   },

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:89:29
   /**
    * Toggles the display mode between light and dark
    */
-  toggleDisplayMode(): void {
-    if (this.lightMode.value === "dark") {
-      this.setDisplayMode("light");
-    } else {
-      this.setDisplayMode("dark");
-    }
-  },
+  toggleDisplayMode(): void {},
 
   /**

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:90:42
    * Toggles the display mode between light and dark
    */
   toggleDisplayMode(): void {
-    if (this.lightMode.value === "dark") {
-      this.setDisplayMode("light");
-    } else {
+    if (this.lightMode.value === "dark") {} else {
       this.setDisplayMode("dark");
     }

[NoCoverage] ConditionalExpression
services/themes/services/themes.svelte.ts:90:9
    * Toggles the display mode between light and dark
    */
   toggleDisplayMode(): void {
-    if (this.lightMode.value === "dark") {
+    if (true) {
       this.setDisplayMode("light");
     } else {

[NoCoverage] StringLiteral
services/themes/services/themes.svelte.ts:91:27
    */
   toggleDisplayMode(): void {
     if (this.lightMode.value === "dark") {
-      this.setDisplayMode("light");
+      this.setDisplayMode("");
     } else {
       this.setDisplayMode("dark");

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:92:12
   toggleDisplayMode(): void {
     if (this.lightMode.value === "dark") {
       this.setDisplayMode("light");
-    } else {
-      this.setDisplayMode("dark");
-    }
+    } else {}
   },
 

[NoCoverage] StringLiteral
services/themes/services/themes.svelte.ts:93:27
     if (this.lightMode.value === "dark") {
       this.setDisplayMode("light");
     } else {
-      this.setDisplayMode("dark");
+      this.setDisplayMode("");
     }
   },

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:102:33
    * Updates DOM attributes and triggers theme-specific events
    * @param theme - Theme name to set
    */
-  setTheme(theme: string): void {
-    if (!theme) {
-      theme = "tutors";
-    }
-    if (themeService.themes.find((theme) => theme.name === this.currentTheme.value)) {
-      this.currentTheme.value = theme;
-    } else {
-      this.currentTheme.value = "tutors";
-    }
-    document.documentElement.setAttribute("data-theme", this.currentTheme.value);
-    localStorage.theme = this.currentTheme.value;
-    this.eventTrigger();
-  },
+  setTheme(theme: string): void {},
 
   /**

[NoCoverage] BooleanLiteral
services/themes/services/themes.svelte.ts:103:9
    * @param theme - Theme name to set
    */
   setTheme(theme: string): void {
-    if (!theme) {
+    if (theme) {
       theme = "tutors";
     }

[NoCoverage] ConditionalExpression
services/themes/services/themes.svelte.ts:103:9
    * @param theme - Theme name to set
    */
   setTheme(theme: string): void {
-    if (!theme) {
+    if (false) {
       theme = "tutors";
     }

[NoCoverage] ConditionalExpression
services/themes/services/themes.svelte.ts:106:45
     if (!theme) {
       theme = "tutors";
     }
-    if (themeService.themes.find((theme) => theme.name === this.currentTheme.value)) {
+    if (themeService.themes.find((theme) => true)) {
       this.currentTheme.value = theme;
     } else {

[NoCoverage] EqualityOperator
services/themes/services/themes.svelte.ts:106:45
     if (!theme) {
       theme = "tutors";
     }
-    if (themeService.themes.find((theme) => theme.name === this.currentTheme.value)) {
+    if (themeService.themes.find((theme) => theme.name !== this.currentTheme.value)) {
       this.currentTheme.value = theme;
     } else {

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:108:12
     }
     if (themeService.themes.find((theme) => theme.name === this.currentTheme.value)) {
       this.currentTheme.value = theme;
-    } else {
-      this.currentTheme.value = "tutors";
-    }
+    } else {}
     document.documentElement.setAttribute("data-theme", this.currentTheme.value);
     localStorage.theme = this.currentTheme.value;

[NoCoverage] StringLiteral
services/themes/services/themes.svelte.ts:111:43
     } else {
       this.currentTheme.value = "tutors";
     }
-    document.documentElement.setAttribute("data-theme", this.currentTheme.value);
+    document.documentElement.setAttribute("", this.currentTheme.value);
     localStorage.theme = this.currentTheme.value;
     this.eventTrigger();

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:120:39
    * Sets and persists the current display layout
    * @param layout - Layout name to set
    */
-  setLayout(layout: LayoutType): void {
-    if (!layout) {
-      layout = "expanded";
-    }
-    this.layout.value = layout;
-    localStorage.layout = layout;
-  },
+  setLayout(layout: LayoutType): void {},
 
   /**

[NoCoverage] ConditionalExpression
services/themes/services/themes.svelte.ts:121:9
    * @param layout - Layout name to set
    */
   setLayout(layout: LayoutType): void {
-    if (!layout) {
+    if (true) {
       layout = "expanded";
     }

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:121:18
    * @param layout - Layout name to set
    */
   setLayout(layout: LayoutType): void {
-    if (!layout) {
-      layout = "expanded";
-    }
+    if (!layout) {}
     this.layout.value = layout;
     localStorage.layout = layout;

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:132:44
    * Sets and persists the current card style
    * @param style - Card style to set (portrait/landscape)
    */
-  setCardStyle(style: CardStyleType): void {
-    if (!style) {
-      style = "portrait";
-    }
-    this.cardStyle.value = style;
-    localStorage.cardStyle = style;
-  },
+  setCardStyle(style: CardStyleType): void {},
 
   /**

[NoCoverage] ConditionalExpression
services/themes/services/themes.svelte.ts:133:9
    * @param style - Card style to set (portrait/landscape)
    */
   setCardStyle(style: CardStyleType): void {
-    if (!style) {
+    if (false) {
       style = "portrait";
     }

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:133:17
    * @param style - Card style to set (portrait/landscape)
    */
   setCardStyle(style: CardStyleType): void {
-    if (!style) {
-      style = "portrait";
-    }
+    if (!style) {}
     this.cardStyle.value = style;
     localStorage.cardStyle = style;

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:143:24
   /**
    * Toggles the layout between expanded & compact
    */
-  toggleLayout(): void {
-    if (this.layout.value === "expanded") {
-      this.setLayout("compacted");
-    } else {
-      this.setLayout("expanded");
-    }
-  },
+  toggleLayout(): void {},
 
   /**

[NoCoverage] ConditionalExpression
services/themes/services/themes.svelte.ts:144:9
    * Toggles the layout between expanded & compact
    */
   toggleLayout(): void {
-    if (this.layout.value === "expanded") {
+    if (true) {
       this.setLayout("compacted");
     } else {

[NoCoverage] EqualityOperator
services/themes/services/themes.svelte.ts:144:9
    * Toggles the layout between expanded & compact
    */
   toggleLayout(): void {
-    if (this.layout.value === "expanded") {
+    if (this.layout.value !== "expanded") {
       this.setLayout("compacted");
     } else {

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:146:12
   toggleLayout(): void {
     if (this.layout.value === "expanded") {
       this.setLayout("compacted");
-    } else {
-      this.setLayout("expanded");
-    }
+    } else {}
   },
 

[NoCoverage] StringLiteral
services/themes/services/themes.svelte.ts:147:22
     if (this.layout.value === "expanded") {
       this.setLayout("compacted");
     } else {
-      this.setLayout("expanded");
+      this.setLayout("");
     }
   },

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:157:35
    * @param type - Icon type to retrieve
    * @returns IconType definition for requested type
    */
-  getIcon(type: string): IconType {
-    const iconLib = themeService.themes.find((theme) => theme.name === this.currentTheme.value)?.icons;
-    if (iconLib && iconLib[type]) {
-      return iconLib[type];
-    } else {
-      console.log("No type found for icon", type);
-      return FluentIconLib.tutors;
-    }
-  },
+  getIcon(type: string): IconType {},
 
   /**

[NoCoverage] OptionalChaining
services/themes/services/themes.svelte.ts:158:21
    * @returns IconType definition for requested type
    */
   getIcon(type: string): IconType {
-    const iconLib = themeService.themes.find((theme) => theme.name === this.currentTheme.value)?.icons;
+    const iconLib = themeService.themes.find(theme => theme.name === this.currentTheme.value).icons;
     if (iconLib && iconLib[type]) {
       return iconLib[type];

[NoCoverage] ArrowFunction
services/themes/services/themes.svelte.ts:158:46
    * @returns IconType definition for requested type
    */
   getIcon(type: string): IconType {
-    const iconLib = themeService.themes.find((theme) => theme.name === this.currentTheme.value)?.icons;
+    const iconLib = themeService.themes.find(() => undefined)?.icons;
     if (iconLib && iconLib[type]) {
       return iconLib[type];

[NoCoverage] LogicalOperator
services/themes/services/themes.svelte.ts:159:9
    */
   getIcon(type: string): IconType {
     const iconLib = themeService.themes.find((theme) => theme.name === this.currentTheme.value)?.icons;
-    if (iconLib && iconLib[type]) {
+    if (iconLib || iconLib[type]) {
       return iconLib[type];
     } else {

[NoCoverage] ConditionalExpression
services/themes/services/themes.svelte.ts:159:9
    */
   getIcon(type: string): IconType {
     const iconLib = themeService.themes.find((theme) => theme.name === this.currentTheme.value)?.icons;
-    if (iconLib && iconLib[type]) {
+    if (true) {
       return iconLib[type];
     } else {

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:161:12
     const iconLib = themeService.themes.find((theme) => theme.name === this.currentTheme.value)?.icons;
     if (iconLib && iconLib[type]) {
       return iconLib[type];
-    } else {
-      console.log("No type found for icon", type);
-      return FluentIconLib.tutors;
-    }
+    } else {}
   },
 

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:172:41
    * @param type - Icon type identifier
    * @param icon - Icon definition to add
    */
-  addIcon(type: string, icon: IconType) {
-    FluentIconLib[type] = icon;
-    HeroIconLib[type] = icon;
-    FestiveIcons[type] = icon;
-  },
+  addIcon(type: string, icon: IconType) {},
 
   /**

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:183:39
    * @param type - Type to get color for
    * @returns Color string or 'primary' if not found
    */
-  getTypeColour(type: string): string {
-    const iconLib = themeService.themes.find((theme) => theme.name === this.currentTheme.value)?.icons;
-    if (iconLib && iconLib[type]) {
-      return iconLib[type].color;
-    }
-    return "primary";
-  },
+  getTypeColour(type: string): string {},
 
   /**

[NoCoverage] OptionalChaining
services/themes/services/themes.svelte.ts:184:21
    * @returns Color string or 'primary' if not found
    */
   getTypeColour(type: string): string {
-    const iconLib = themeService.themes.find((theme) => theme.name === this.currentTheme.value)?.icons;
+    const iconLib = themeService.themes.find(theme => theme.name === this.currentTheme.value).icons;
     if (iconLib && iconLib[type]) {
       return iconLib[type].color;

[NoCoverage] EqualityOperator
services/themes/services/themes.svelte.ts:184:57
    * @returns Color string or 'primary' if not found
    */
   getTypeColour(type: string): string {
-    const iconLib = themeService.themes.find((theme) => theme.name === this.currentTheme.value)?.icons;
+    const iconLib = themeService.themes.find((theme) => theme.name !== this.currentTheme.value)?.icons;
     if (iconLib && iconLib[type]) {
       return iconLib[type].color;

[NoCoverage] ConditionalExpression
services/themes/services/themes.svelte.ts:185:9
    */
   getTypeColour(type: string): string {
     const iconLib = themeService.themes.find((theme) => theme.name === this.currentTheme.value)?.icons;
-    if (iconLib && iconLib[type]) {
+    if (false) {
       return iconLib[type].color;
     }

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:195:24
    * Triggers theme-specific events
    * Currently handles festive theme snow animation
    */
-  eventTrigger(): void {
-    if (this.currentTheme.value === "festive") {
-      makeItSnow();
-      this.isSnowing = true;
-    } else {
-      if (this.isSnowing) {
-        this.isSnowing = false;
-        makeItStopSnowing();
-      }
-    }
-  }
+  eventTrigger(): void {}
 };
 

[NoCoverage] ConditionalExpression
services/themes/services/themes.svelte.ts:196:9
    * Currently handles festive theme snow animation
    */
   eventTrigger(): void {
-    if (this.currentTheme.value === "festive") {
+    if (true) {
       makeItSnow();
       this.isSnowing = true;

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:196:48
    * Currently handles festive theme snow animation
    */
   eventTrigger(): void {
-    if (this.currentTheme.value === "festive") {
-      makeItSnow();
-      this.isSnowing = true;
-    } else {
+    if (this.currentTheme.value === "festive") {} else {
       if (this.isSnowing) {
         this.isSnowing = false;

[NoCoverage] BooleanLiteral
services/themes/services/themes.svelte.ts:198:24
   eventTrigger(): void {
     if (this.currentTheme.value === "festive") {
       makeItSnow();
-      this.isSnowing = true;
+      this.isSnowing = false;
     } else {
       if (this.isSnowing) {

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:199:12
     if (this.currentTheme.value === "festive") {
       makeItSnow();
       this.isSnowing = true;
-    } else {
-      if (this.isSnowing) {
-        this.isSnowing = false;
-        makeItStopSnowing();
-      }
-    }
+    } else {}
   }
 };

[NoCoverage] BlockStatement
services/themes/services/themes.svelte.ts:200:27
       makeItSnow();
       this.isSnowing = true;
     } else {
-      if (this.isSnowing) {
-        this.isSnowing = false;
-        makeItStopSnowing();
-      }
+      if (this.isSnowing) {}
     }
   }

[NoCoverage] ConditionalExpression
services/themes/services/themes.svelte.ts:200:11
       makeItSnow();
       this.isSnowing = true;
     } else {
-      if (this.isSnowing) {
+      if (false) {
         this.isSnowing = false;
         makeItStopSnowing();

[NoCoverage] BooleanLiteral
services/themes/services/themes.svelte.ts:201:26
       this.isSnowing = true;
     } else {
       if (this.isSnowing) {
-        this.isSnowing = false;
+        this.isSnowing = true;
         makeItStopSnowing();
       }
