[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:19:17
 export const cardStyles: CardStyleConfig = {
   heading: {
     expanded: {
-      portrait: "text-lg! font-medium",
+      portrait: "",
       landscape: "text-lg! font-semibold",
       circular: "text-md! font-semibold"

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:21:17
     expanded: {
       portrait: "text-lg! font-medium",
       landscape: "text-lg! font-semibold",
-      circular: "text-md! font-semibold"
+      circular: ""
     },
     compacted: {

[NoCoverage] ObjectLiteral
services/themes/styles/card-styles.ts:23:16
       landscape: "text-lg! font-semibold",
       circular: "text-md! font-semibold"
     },
-    compacted: {
-      portrait: "text-xs! font-medium",
-      landscape: "text-md! font-medium",
-      circular: "text-sm! font-medium"
-    }
+    compacted: {}
   },
   dimensions: {

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:24:17
       circular: "text-md! font-semibold"
     },
     compacted: {
-      portrait: "text-xs! font-medium",
+      portrait: "",
       landscape: "text-md! font-medium",
       circular: "text-sm! font-medium"

[NoCoverage] ObjectLiteral
services/themes/styles/card-styles.ts:29:15
       circular: "text-sm! font-medium"
     }
   },
-  dimensions: {
-    expanded: {
-      portrait: "w-60 h-[23rem]",
-      landscape: "w-[28rem] h-48",
-      circular: "w-64 h-64"
-    },
-    compacted: {
-      portrait: "w-36 h-[14rem]",
-      landscape: "w-[20rem] h-32",
-      circular: "w-48 h-48"
-    }
-  },
+  dimensions: {},
   image: {
     expanded: {

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:31:17
   },
   dimensions: {
     expanded: {
-      portrait: "w-60 h-[23rem]",
+      portrait: "",
       landscape: "w-[28rem] h-48",
       circular: "w-64 h-64"

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:32:18
   dimensions: {
     expanded: {
       portrait: "w-60 h-[23rem]",
-      landscape: "w-[28rem] h-48",
+      landscape: "",
       circular: "w-64 h-64"
     },

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:33:17
     expanded: {
       portrait: "w-60 h-[23rem]",
       landscape: "w-[28rem] h-48",
-      circular: "w-64 h-64"
+      circular: ""
     },
     compacted: {

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:38:17
     compacted: {
       portrait: "w-36 h-[14rem]",
       landscape: "w-[20rem] h-32",
-      circular: "w-48 h-48"
+      circular: ""
     }
   },

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:48:17
       circular: "w-32 h-32"
     },
     compacted: {
-      portrait: "h-16",
+      portrait: "",
       landscape: "w-32",
       circular: "w-24 h-24"

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:49:18
     },
     compacted: {
       portrait: "h-16",
-      landscape: "w-32",
+      landscape: "",
       circular: "w-24 h-24"
     }

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:57:17
     expanded: {
       portrait: "160",
       landscape: "120",
-      circular: "120"
+      circular: ""
     },
     compacted: {

[NoCoverage] ObjectLiteral
services/themes/styles/card-styles.ts:59:16
       landscape: "120",
       circular: "120"
     },
-    compacted: {
-      portrait: "60",
-      landscape: "60",
-      circular: "60"
-    }
+    compacted: {}
   },
   iconHeight: {

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:61:18
     },
     compacted: {
       portrait: "60",
-      landscape: "60",
+      landscape: "",
       circular: "60"
     }

[NoCoverage] ObjectLiteral
services/themes/styles/card-styles.ts:65:15
       circular: "60"
     }
   },
-  iconHeight: {
-    expanded: {
-      portrait: "30",
-      landscape: "40",
-      circular: "50"
-    },
-    compacted: {
-      portrait: "20",
-      landscape: "20",
-      circular: "20"
-    }
-  },
+  iconHeight: {},
   text: {
     expanded: {

[NoCoverage] ObjectLiteral
services/themes/styles/card-styles.ts:66:15
     }
   },
   iconHeight: {
-    expanded: {
-      portrait: "30",
-      landscape: "40",
-      circular: "50"
-    },
+    expanded: {},
     compacted: {
       portrait: "20",

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:68:18
   iconHeight: {
     expanded: {
       portrait: "30",
-      landscape: "40",
+      landscape: "",
       circular: "50"
     },

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:72:17
       circular: "50"
     },
     compacted: {
-      portrait: "20",
+      portrait: "",
       landscape: "20",
       circular: "20"

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:73:18
     },
     compacted: {
       portrait: "20",
-      landscape: "20",
+      landscape: "",
       circular: "20"
     }

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:74:17
     compacted: {
       portrait: "20",
       landscape: "20",
-      circular: "20"
+      circular: ""
     }
   },

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:79:17
   },
   text: {
     expanded: {
-      portrait: "prose line-clamp-3 leading-6 dark:prose-invert",
+      portrait: "",
       landscape: "prose line-clamp-3 leading-6 dark:prose-invert",
       circular: "prose line-clamp-3 leading-6 dark:prose-invert"

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:84:17
       circular: "prose line-clamp-3 leading-6 dark:prose-invert"
     },
     compacted: {
-      portrait: "line-clamp-2 text-xs",
+      portrait: "",
       landscape: "line-clamp-2 text-xs",
       circular: "line-clamp-2 text-xs"

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:86:17
     compacted: {
       portrait: "line-clamp-2 text-xs",
       landscape: "line-clamp-2 text-xs",
-      circular: "line-clamp-2 text-xs"
+      circular: ""
     }
   },

[NoCoverage] ObjectLiteral
services/themes/styles/card-styles.ts:90:15
     }
   },
   avatar: {
-    expanded: {
-      portrait: "w-12",
-      landscape: "w-12",
-      circular: "w-12"
-    },
+    expanded: {},
     compacted: {
       portrait: "w-8",

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:96:17
       circular: "w-12"
     },
     compacted: {
-      portrait: "w-8",
+      portrait: "",
       landscape: "w-8",
       circular: "w-8"

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:97:18
     },
     compacted: {
       portrait: "w-8",
-      landscape: "w-8",
+      landscape: "",
       circular: "w-8"
     }

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:98:17
     compacted: {
       portrait: "w-8",
       landscape: "w-8",
-      circular: "w-8"
+      circular: ""
     }
   },

[NoCoverage] ObjectLiteral
services/themes/styles/card-styles.ts:107:16
       landscape: "border-l-8 flex",
       circular: "rounded-full border-4 flex flex-col"
     },
-    compacted: {
-      portrait: "border-y-8 flex flex-col",
-      landscape: "border-l-8 flex",
-      circular: "rounded-full border-4 flex flex-col"
-    }
+    compacted: {}
   }
 };

[NoCoverage] StringLiteral
services/themes/styles/card-styles.ts:108:17
       circular: "rounded-full border-4 flex flex-col"
     },
     compacted: {
-      portrait: "border-y-8 flex flex-col",
+      portrait: "",
       landscape: "border-l-8 flex",
       circular: "rounded-full border-4 flex flex-col"
