[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:4:11
 import type { Theme } from '@skeletonlabs/skeleton/themes';
 
 const valentines = {
-  "name": "valentines",
+  "name": "",
   "properties": {
     "--type-scale-factor": "1.067",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:9:23
     "--type-scale-factor": "1.067",
     "--type-scale-1": "calc(0.75rem * var(--type-scale-factor))",
     "--type-scale-2": "calc(0.875rem * var(--type-scale-factor))",
-    "--type-scale-3": "calc(1rem * var(--type-scale-factor))",
+    "--type-scale-3": "",
     "--type-scale-4": "calc(1.125rem * var(--type-scale-factor))",
     "--type-scale-5": "calc(1.25rem * var(--type-scale-factor))",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:12:23
     "--type-scale-3": "calc(1rem * var(--type-scale-factor))",
     "--type-scale-4": "calc(1.125rem * var(--type-scale-factor))",
     "--type-scale-5": "calc(1.25rem * var(--type-scale-factor))",
-    "--type-scale-6": "calc(1.5rem * var(--type-scale-factor))",
+    "--type-scale-6": "",
     "--type-scale-7": "calc(1.875rem * var(--type-scale-factor))",
     "--type-scale-8": "calc(2.25rem * var(--type-scale-factor))",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:17:24
     "--type-scale-8": "calc(2.25rem * var(--type-scale-factor))",
     "--type-scale-9": "calc(3rem * var(--type-scale-factor))",
     "--type-scale-10": "calc(3.75rem * var(--type-scale-factor))",
-    "--type-scale-11": "calc(4.5rem * var(--type-scale-factor))",
+    "--type-scale-11": "",
     "--type-scale-12": "calc(6rem * var(--type-scale-factor))",
     "--type-scale-13": "calc(8rem * var(--type-scale-factor))",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:19:24
     "--type-scale-10": "calc(3.75rem * var(--type-scale-factor))",
     "--type-scale-11": "calc(4.5rem * var(--type-scale-factor))",
     "--type-scale-12": "calc(6rem * var(--type-scale-factor))",
-    "--type-scale-13": "calc(8rem * var(--type-scale-factor))",
+    "--type-scale-13": "",
     "--base-font-color": "var(--color-surface-950)",
     "--base-font-color-dark": "var(--color-surface-50)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:20:26
     "--type-scale-11": "calc(4.5rem * var(--type-scale-factor))",
     "--type-scale-12": "calc(6rem * var(--type-scale-factor))",
     "--type-scale-13": "calc(8rem * var(--type-scale-factor))",
-    "--base-font-color": "var(--color-surface-950)",
+    "--base-font-color": "",
     "--base-font-color-dark": "var(--color-surface-50)",
     "--base-font-family": "system-ui, sans-serif",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:22:27
     "--type-scale-13": "calc(8rem * var(--type-scale-factor))",
     "--base-font-color": "var(--color-surface-950)",
     "--base-font-color-dark": "var(--color-surface-50)",
-    "--base-font-family": "system-ui, sans-serif",
+    "--base-font-family": "",
     "--base-font-size": "inherit",
     "--base-line-height": "inherit",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:23:25
     "--base-font-color": "var(--color-surface-950)",
     "--base-font-color-dark": "var(--color-surface-50)",
     "--base-font-family": "system-ui, sans-serif",
-    "--base-font-size": "inherit",
+    "--base-font-size": "",
     "--base-line-height": "inherit",
     "--base-font-weight": "normal",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:25:27
     "--base-font-family": "system-ui, sans-serif",
     "--base-font-size": "inherit",
     "--base-line-height": "inherit",
-    "--base-font-weight": "normal",
+    "--base-font-weight": "",
     "--base-font-style": "normal",
     "--base-letter-spacing": "0em",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:37:27
     "--anchor-font-color": "var(--color-primary-500)",
     "--anchor-font-color-dark": "var(--color-primary-500)",
     "--anchor-font-family": "inherit",
-    "--anchor-font-size": "inherit",
+    "--anchor-font-size": "",
     "--anchor-line-height": "inherit",
     "--anchor-font-weight": "inherit",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:50:31
     "--radii-default": "6px",
     "--radii-container": "12px",
     "--border-width-default": "1px",
-    "--divide-width-default": "1px",
+    "--divide-width-default": "",
     "--outline-width-default": "1px",
     "--ring-width-default": "1px",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:55:27
     "--ring-width-default": "1px",
     "--body-background-color": "var(--color-surface-50)",
     "--body-background-color-dark": "var(--color-surface-950)",
-    "--color-primary-50": "255 165 208",
+    "--color-primary-50": "",
     "--color-primary-100": "254 241 246", //
     "--color-primary-200": "255 255 255",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:81:30
     "--color-primary-contrast-950": "var(--color-primary-contrast-light)",
     "--color-secondary-50": "255 255 255",
     "--color-secondary-100": "254 241 246", //
-    "--color-secondary-200": "252 228 236",
+    "--color-secondary-200": "",
     "--color-secondary-300": "251 214 227",
     "--color-secondary-400": "249 201 217",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:82:30
     "--color-secondary-50": "255 255 255",
     "--color-secondary-100": "254 241 246", //
     "--color-secondary-200": "252 228 236",
-    "--color-secondary-300": "251 214 227",
+    "--color-secondary-300": "",
     "--color-secondary-400": "249 201 217",
     "--color-secondary-500": "209 0 60", //

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:83:30
     "--color-secondary-100": "254 241 246", //
     "--color-secondary-200": "252 228 236",
     "--color-secondary-300": "251 214 227",
-    "--color-secondary-400": "249 201 217",
+    "--color-secondary-400": "",
     "--color-secondary-500": "209 0 60", //
     "--color-secondary-600": "223 164 185",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:85:30
     "--color-secondary-300": "251 214 227",
     "--color-secondary-400": "249 201 217",
     "--color-secondary-500": "209 0 60", //
-    "--color-secondary-600": "223 164 185",
+    "--color-secondary-600": "",
     "--color-secondary-700": "198 141 161",
     "--color-secondary-800": "173 117 138",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:86:30
     "--color-secondary-400": "249 201 217",
     "--color-secondary-500": "209 0 60", //
     "--color-secondary-600": "223 164 185",
-    "--color-secondary-700": "198 141 161",
+    "--color-secondary-700": "",
     "--color-secondary-800": "173 117 138",
     "--color-secondary-900": "81 0 0", //

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:90:40
     "--color-secondary-800": "173 117 138",
     "--color-secondary-900": "81 0 0", //
     "--color-secondary-950": "123 71 91",
-    "--color-secondary-contrast-dark": "var(--color-secondary-950)",
+    "--color-secondary-contrast-dark": "",
     "--color-secondary-contrast-light": "var(--color-secondary-50)",
     "--color-secondary-contrast-50": "var(--color-secondary-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:95:39
     "--color-secondary-contrast-50": "var(--color-secondary-contrast-dark)",
     "--color-secondary-contrast-100": "var(--color-secondary-contrast-dark)",
     "--color-secondary-contrast-200": "var(--color-secondary-contrast-dark)",
-    "--color-secondary-contrast-300": "var(--color-secondary-contrast-dark)",
+    "--color-secondary-contrast-300": "",
     "--color-secondary-contrast-400": "var(--color-secondary-contrast-dark)",
     "--color-secondary-contrast-500": "var(--color-secondary-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:104:29
     "--color-secondary-contrast-900": "var(--color-secondary-contrast-light)",
     "--color-secondary-contrast-950": "var(--color-secondary-contrast-light)",
     "--color-tertiary-50": "255 255 255", //
-    "--color-tertiary-100": "254 241 246", //
+    "--color-tertiary-100": "", //
     "--color-tertiary-200": "207 92 148",
     "--color-tertiary-300": "184 66 125",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:105:29
     "--color-secondary-contrast-950": "var(--color-secondary-contrast-light)",
     "--color-tertiary-50": "255 255 255", //
     "--color-tertiary-100": "254 241 246", //
-    "--color-tertiary-200": "207 92 148",
+    "--color-tertiary-200": "",
     "--color-tertiary-300": "184 66 125",
     "--color-tertiary-400": "160 40 102",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:110:29
     "--color-tertiary-400": "160 40 102",
     "--color-tertiary-500": "136 14 79",
     "--color-tertiary-600": "117 11 63",
-    "--color-tertiary-700": "98 8 47",
+    "--color-tertiary-700": "",
     "--color-tertiary-800": "79 6 32",
     "--color-tertiary-900": "60 3 16",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:114:39
     "--color-tertiary-800": "79 6 32",
     "--color-tertiary-900": "60 3 16",
     "--color-tertiary-950": "41 0 0",
-    "--color-tertiary-contrast-dark": "var(--color-tertiary-950)",
+    "--color-tertiary-contrast-dark": "",
     "--color-tertiary-contrast-light": "var(--color-tertiary-50)",
     "--color-tertiary-contrast-50": "var(--color-tertiary-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:118:38
     "--color-tertiary-contrast-light": "var(--color-tertiary-50)",
     "--color-tertiary-contrast-50": "var(--color-tertiary-contrast-dark)",
     "--color-tertiary-contrast-100": "var(--color-tertiary-contrast-dark)",
-    "--color-tertiary-contrast-200": "var(--color-tertiary-contrast-dark)",
+    "--color-tertiary-contrast-200": "",
     "--color-tertiary-contrast-300": "var(--color-tertiary-contrast-dark)",
     "--color-tertiary-contrast-400": "var(--color-tertiary-contrast-light)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:130:28
     "--color-success-50": "255 255 255", //
     "--color-success-100": "254 241 246", //
     "--color-success-200": "222 102 157",
-    "--color-success-300": "206 75 133",
+    "--color-success-300": "",
     "--color-success-400": "189 47 110",
     "--color-success-500": "227 0 107", //

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:132:28
     "--color-success-200": "222 102 157",
     "--color-success-300": "206 75 133",
     "--color-success-400": "189 47 110",
-    "--color-success-500": "227 0 107", //
+    "--color-success-500": "", //
     "--color-success-600": "150 16 70",
     "--color-success-700": "127 12 52",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:133:28
     "--color-success-300": "206 75 133",
     "--color-success-400": "189 47 110",
     "--color-success-500": "227 0 107", //
-    "--color-success-600": "150 16 70",
+    "--color-success-600": "",
     "--color-success-700": "127 12 52",
     "--color-success-800": "103 8 35",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:136:28
     "--color-success-600": "150 16 70",
     "--color-success-700": "127 12 52",
     "--color-success-800": "103 8 35",
-    "--color-success-900": "81 0 0", //
+    "--color-success-900": "", //
     "--color-success-950": "57 0 0",
     "--color-success-contrast-dark": "var(--color-success-950)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:137:28
     "--color-success-700": "127 12 52",
     "--color-success-800": "103 8 35",
     "--color-success-900": "81 0 0", //
-    "--color-success-950": "57 0 0",
+    "--color-success-950": "",
     "--color-success-contrast-dark": "var(--color-success-950)",
     "--color-success-contrast-light": "var(--color-success-50)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:138:38
     "--color-success-800": "103 8 35",
     "--color-success-900": "81 0 0", //
     "--color-success-950": "57 0 0",
-    "--color-success-contrast-dark": "var(--color-success-950)",
+    "--color-success-contrast-dark": "",
     "--color-success-contrast-light": "var(--color-success-50)",
     "--color-success-contrast-50": "var(--color-success-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:140:36
     "--color-success-950": "57 0 0",
     "--color-success-contrast-dark": "var(--color-success-950)",
     "--color-success-contrast-light": "var(--color-success-50)",
-    "--color-success-contrast-50": "var(--color-success-contrast-dark)",
+    "--color-success-contrast-50": "",
     "--color-success-contrast-100": "var(--color-success-contrast-dark)",
     "--color-success-contrast-200": "var(--color-success-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:143:37
     "--color-success-contrast-50": "var(--color-success-contrast-dark)",
     "--color-success-contrast-100": "var(--color-success-contrast-dark)",
     "--color-success-contrast-200": "var(--color-success-contrast-dark)",
-    "--color-success-contrast-300": "var(--color-success-contrast-dark)",
+    "--color-success-contrast-300": "",
     "--color-success-contrast-400": "var(--color-success-contrast-light)",
     "--color-success-contrast-500": "var(--color-success-contrast-light)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:145:37
     "--color-success-contrast-200": "var(--color-success-contrast-dark)",
     "--color-success-contrast-300": "var(--color-success-contrast-dark)",
     "--color-success-contrast-400": "var(--color-success-contrast-light)",
-    "--color-success-contrast-500": "var(--color-success-contrast-light)",
+    "--color-success-contrast-500": "",
     "--color-success-contrast-600": "var(--color-success-contrast-light)",
     "--color-success-contrast-700": "var(--color-success-contrast-light)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:155:28
     "--color-warning-100": "254 241 246", //
     "--color-warning-200": "245 190 188",
     "--color-warning-300": "239 165 163",
-    "--color-warning-400": "234 140 139",
+    "--color-warning-400": "",
     "--color-warning-500": "231 118 171", //
     "--color-warning-600": "203 92 95",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:157:28
     "--color-warning-300": "239 165 163",
     "--color-warning-400": "234 140 139",
     "--color-warning-500": "231 118 171", //
-    "--color-warning-600": "203 92 95",
+    "--color-warning-600": "",
     "--color-warning-700": "176 69 74",
     "--color-warning-800": "150 46 54",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:159:28
     "--color-warning-500": "231 118 171", //
     "--color-warning-600": "203 92 95",
     "--color-warning-700": "176 69 74",
-    "--color-warning-800": "150 46 54",
+    "--color-warning-800": "",
     "--color-warning-900": "81 0 0", //
     "--color-warning-950": "97 0 13",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:160:28
     "--color-warning-600": "203 92 95",
     "--color-warning-700": "176 69 74",
     "--color-warning-800": "150 46 54",
-    "--color-warning-900": "81 0 0", //
+    "--color-warning-900": "", //
     "--color-warning-950": "97 0 13",
     "--color-warning-contrast-dark": "var(--color-warning-950)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:168:37
     "--color-warning-contrast-100": "var(--color-warning-contrast-dark)",
     "--color-warning-contrast-200": "var(--color-warning-contrast-dark)",
     "--color-warning-contrast-300": "var(--color-warning-contrast-dark)",
-    "--color-warning-contrast-400": "var(--color-warning-contrast-dark)",
+    "--color-warning-contrast-400": "",
     "--color-warning-contrast-500": "var(--color-warning-contrast-dark)",
     "--color-warning-contrast-600": "var(--color-warning-contrast-light)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:171:37
     "--color-warning-contrast-400": "var(--color-warning-contrast-dark)",
     "--color-warning-contrast-500": "var(--color-warning-contrast-dark)",
     "--color-warning-contrast-600": "var(--color-warning-contrast-light)",
-    "--color-warning-contrast-700": "var(--color-warning-contrast-light)",
+    "--color-warning-contrast-700": "",
     "--color-warning-contrast-800": "var(--color-warning-contrast-light)",
     "--color-warning-contrast-900": "var(--color-warning-contrast-light)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:176:26
     "--color-warning-contrast-900": "var(--color-warning-contrast-light)",
     "--color-warning-contrast-950": "var(--color-warning-contrast-light)",
     "--color-error-50": "255 255 255", //
-    "--color-error-100": "254 241 246", //
+    "--color-error-100": "", //
     "--color-error-200": "237 126 114",
     "--color-error-300": "229 100 91",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:177:26
     "--color-warning-contrast-950": "var(--color-warning-contrast-light)",
     "--color-error-50": "255 255 255", //
     "--color-error-100": "254 241 246", //
-    "--color-error-200": "237 126 114",
+    "--color-error-200": "",
     "--color-error-300": "229 100 91",
     "--color-error-400": "220 73 69",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:182:26
     "--color-error-400": "220 73 69",
     "--color-error-500": "215 38 56", //
     "--color-error-600": "185 38 38",
-    "--color-error-700": "158 28 28",
+    "--color-error-700": "",
     "--color-error-800": "132 19 19",
     "--color-error-900": "81 0 0", //

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:185:26
     "--color-error-700": "158 28 28",
     "--color-error-800": "132 19 19",
     "--color-error-900": "81 0 0", //
-    "--color-error-950": "79 0 0",
+    "--color-error-950": "",
     "--color-error-contrast-dark": "var(--color-error-950)",
     "--color-error-contrast-light": "var(--color-error-50)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:189:35
     "--color-error-contrast-dark": "var(--color-error-950)",
     "--color-error-contrast-light": "var(--color-error-50)",
     "--color-error-contrast-50": "var(--color-error-contrast-dark)",
-    "--color-error-contrast-100": "var(--color-error-contrast-dark)",
+    "--color-error-contrast-100": "",
     "--color-error-contrast-200": "var(--color-error-contrast-dark)",
     "--color-error-contrast-300": "var(--color-error-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:193:35
     "--color-error-contrast-200": "var(--color-error-contrast-dark)",
     "--color-error-contrast-300": "var(--color-error-contrast-dark)",
     "--color-error-contrast-400": "var(--color-error-contrast-dark)",
-    "--color-error-contrast-500": "var(--color-error-contrast-dark)",
+    "--color-error-contrast-500": "",
     "--color-error-contrast-600": "var(--color-error-contrast-light)",
     "--color-error-contrast-700": "var(--color-error-contrast-light)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:197:35
     "--color-error-contrast-600": "var(--color-error-contrast-light)",
     "--color-error-contrast-700": "var(--color-error-contrast-light)",
     "--color-error-contrast-800": "var(--color-error-contrast-light)",
-    "--color-error-contrast-900": "var(--color-error-contrast-light)",
+    "--color-error-contrast-900": "",
     "--color-error-contrast-950": "var(--color-error-contrast-light)",
     "--color-surface-50": "255 255 255",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:199:27
     "--color-error-contrast-800": "var(--color-error-contrast-light)",
     "--color-error-contrast-900": "var(--color-error-contrast-light)",
     "--color-error-contrast-950": "var(--color-error-contrast-light)",
-    "--color-surface-50": "255 255 255",
+    "--color-surface-50": "",
     "--color-surface-100": "255 255 255",
     "--color-surface-200": "232 234 237",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:201:28
     "--color-error-contrast-950": "var(--color-error-contrast-light)",
     "--color-surface-50": "255 255 255",
     "--color-surface-100": "255 255 255",
-    "--color-surface-200": "232 234 237",
+    "--color-surface-200": "",
     "--color-surface-300": "162 169 184",
     "--color-surface-400": "77 84 101",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:202:28
     "--color-surface-50": "255 255 255",
     "--color-surface-100": "255 255 255",
     "--color-surface-200": "232 234 237",
-    "--color-surface-300": "162 169 184",
+    "--color-surface-300": "",
     "--color-surface-400": "77 84 101",
     "--color-surface-500": "42 46 55",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:205:28
     "--color-surface-300": "162 169 184",
     "--color-surface-400": "77 84 101",
     "--color-surface-500": "42 46 55",
-    "--color-surface-600": "33 36 43",
+    "--color-surface-600": "",
     "--color-surface-700": "9 10 12",
     "--color-surface-800": "18 19 23",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:208:28
     "--color-surface-600": "33 36 43",
     "--color-surface-700": "9 10 12",
     "--color-surface-800": "18 19 23",
-    "--color-surface-900": "9 10 12",
+    "--color-surface-900": "",
     "--color-surface-950": "9 10 12",
     "--color-surface-contrast-dark": "var(--color-surface-950)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:213:37
     "--color-surface-contrast-dark": "var(--color-surface-950)",
     "--color-surface-contrast-light": "var(--color-surface-50)",
     "--color-surface-contrast-50": "var(--color-surface-contrast-dark)",
-    "--color-surface-contrast-100": "var(--color-surface-contrast-dark)",
+    "--color-surface-contrast-100": "",
     "--color-surface-contrast-200": "var(--color-surface-contrast-dark)",
     "--color-surface-contrast-300": "var(--color-surface-contrast-dark)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:216:37
     "--color-surface-contrast-100": "var(--color-surface-contrast-dark)",
     "--color-surface-contrast-200": "var(--color-surface-contrast-dark)",
     "--color-surface-contrast-300": "var(--color-surface-contrast-dark)",
-    "--color-surface-contrast-400": "var(--color-surface-contrast-light)",
+    "--color-surface-contrast-400": "",
     "--color-surface-contrast-500": "var(--color-surface-contrast-light)",
     "--color-surface-contrast-600": "var(--color-surface-contrast-light)",

[NoCoverage] StringLiteral
services/themes/styles/valentines.ts:221:37
     "--color-surface-contrast-600": "var(--color-surface-contrast-light)",
     "--color-surface-contrast-700": "var(--color-surface-contrast-light)",
     "--color-surface-contrast-800": "var(--color-surface-contrast-light)",
-    "--color-surface-contrast-900": "var(--color-surface-contrast-light)",
+    "--color-surface-contrast-900": "",
     "--color-surface-contrast-950": "var(--color-surface-contrast-light)"
   },
