[Killed] EqualityOperator
services/course/services/lo-tree.ts:146:7
 }
 
 function localizePath(lo: Lo) {
-  if (courseProtocol.value === "http://") {
+  if (courseProtocol.value !== "http://") {
     lo.route = lo.route?.replace("https://", "http://");
     lo.video = lo.video?.replace("https://", "http://");
killedBy: injectCourseUrl() WHEN processing learning object routes should replace {{COURSEURL}} in image paths
statusReason: expected 'http://test-course.netlify.app/img/lo…' to be 'https://test-course.netlify.app/img/l…' // Object.is equality

[Survived] ConditionalExpression
services/course/services/lo-tree.ts:150:9
     lo.route = lo.route?.replace("https://", "http://");
     lo.video = lo.video?.replace("https://", "http://");
     lo.img = lo.img?.replace("https://", "http://");
-    if (lo.pdf) {
+    if (true) {
       lo.pdf = lo?.pdf?.replace("https://", "http://");
     }
